{"code": "ANTH", "name": "Anthropology", "link": "https://catalog.ucsd.edu/courses/ANTH.html"}
{"code": "ANTH 1", "title": "Introduction to Culture", "units": "4", "anchor": "anth1", "description": "An introduction to the anthropological approach to understanding human behavior, with an examination of data from a selection of societies and cultures."}
{"code": "ANTH 2", "title": "Human Origins", "units": "4", "anchor": "anth2", "description": "An introduction to human evolution from the perspective of physical anthropology, including evolutionary theory and the evolution of the primates, hominids, and modern humans. Emphasis is placed on evidence from fossil remains and behavioral studies of living primates."}
{"code": "ANTH 3", "title": "Global Archaeology", "units": "4", "anchor": "anth3", "description": "This course examines theories and methods used by archaeologists to investigate the origins and nature of human culture and its materiality. Case studies from the past and present, and digital heritage are explored. Recommended for many upper-division archaeology courses."}
{"code": "ANTH 4", "title": "Words and Worlds: Introduction to the Anthropology of Language", "units": "4", "anchor": "anth4", "description": "How does one’s language mutually interact with the social, cultural, and conceptual worlds one inhabits and mutually constructs with others? This course will introduce the comparative study of social life through the lens of the uniquely human capacity for language."}
{"code": "ANTH 5", "title": "The Human Machine: The Skeleton Within", "units": "4", "anchor": "anth5", "description": "Course will provide an introduction to bones as a tissue, to different bones in the body, and the ligaments and muscles surrounding major joints. You will learn how the skeleton, ligaments, and muscles support our mode of locomotion; the differences between male and female skeletons; and the differences across human populations. You’ll see how nutrition and disease can affect bones. Course examines functional areas within the body."}
{"code": "ANTH 21", "title": "Race and Racisms", "units": "4", "anchor": "anth21", "description": "Why does racism still matter? How is racism experienced in the United States and across the globe? With insights from the biology of human variation, archaeology, colonial history, and sociocultural anthropology, we examine how notions of race and ethnicity structure contemporary societies."}
{"code": "ANTH 23", "title": "Debating Multiculturalism: Race, Ethnicity, and Class in American Societies", "units": "4", "anchor": "anth23", "description": "This course focuses on the debate about multiculturalism in American society. It examines the interaction of race, ethnicity, and class, historically and comparatively, and considers the problem of citizenship in relation to the growing polarization of multiple social identities."}
{"code": "ANTH 24", "title": "Mapping Capitalism", "units": "4", "anchor": "anth24", "description": "This course explores the diverse ways that scholars across the humanities and social sciences have defined “capitalism” as their object of study. Much more than rational individuals involved in market relations, these approaches to capitalism explore such themes as sentiment, desire, meaning, deception, and habit."}
{"code": "ANTH 42", "title": "Primates in a Human-Dominated World", "units": "4", "anchor": "anth42", "description": "Will primates survive the anthropocene? We review major primate field studies for features of primate behavior and behavioral diversity and then consider the impact of habitat fragmentation, habitat loss, human wildlife conflict, and commensalism on the future of primates."}
{"code": "ANTH 43", "title": "Introduction to Biology and Culture of Race", "units": "4", "anchor": "anth43", "description": "This course examines conceptions of race from evolutionary and sociocultural perspectives. We will critically examine how patterns of current human genetic variation map onto conceptions of race. We will also focus on the history of the race concept and explore ways in which biomedical researchers and physicians use racial categories today. Finally, we will examine the social construction of race, and the experiences and consequences of racism on health in the United States and internationally."}
{"code": "ANTH 45", "title": "Wisdom and Ecstasy", "units": "4", "anchor": "anth45", "description": "How do the world’s religions grapple with the enduring mysteries of human existence, such as the origins of the cosmos, the meaning of life and death, or the healing of suffering? By delving into “wisdom,” we will explore how different religious communities realize—in thought and in action—the underlying order of their world; in focusing on “ecstasy,” we will attend to deeply transformative experiences of personal contact with the divine within diverse religious milieus."}
{"code": "ANTH 87", "title": "First-year Student Seminar", "units": "1", "anchor": "anth87", "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges. Topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students."}
{"code": "ANTH 101", "title": "Foundations of Social Complexity", "units": "4", "anchor": "anth101", "description": "Course examines archaeological evidence for three key “tipping points” in the human career: (1) the origins of modern human social behaviors, (2) the beginnings of agriculture and village life, and (3) the emergence of cities and states. Prerequisites: upper-division standing. (Required for all majors in anthropology.)"}
{"code": "ANTH 102", "title": "Humans Are Cultural Animals", "units": "4", "anchor": "anth102", "description": "This class examines humans from a comparative perspective; if we ignore culture, what’s left? How do culture and biology interact? And how does biology inform cultural debates over race, sex, marriage, war, peace, etc.? Prerequisites: upper-division standing."}
{"code": "ANTH 103", "title": "Sociocultural Anthropology", "units": "4", "anchor": "anth103", "description": "A systematic analysis of social anthropology and of the concepts and constructs required for cross-cultural and comparative study of human societies. Required for all majors in anthropology. Prerequisites: upper-division standing."}
{"code": "ANTH 104", "title": "Transforming the Global Environment", "units": "4", "anchor": "anth104", "description": "Introduction to the role of humans as modifiers and transformers of the physical environment. Emphasis on current changes and contemporary public issues. Prerequisites: upper-division standing."}
{"code": "ANTH 105", "title": "Climate Change, Race, and Inequality", "units": "4", "anchor": "anth105", "description": "This course introduces students to the ways in which climate change exacerbates environmental racism and inequality. We will consider the ways that structural violence and discriminatory policies create environmental inequalities where marginalized communities take on more of the risk and burdens of climate change. We will address community organizing and social justice efforts to combat the systems of power that unevenly distribute the burdens of climate change to marginalized communities. Prerequisites: upper-division standing."}
{"code": "ANTH 106", "title": "Climate and Civilization", "units": "4", "anchor": "anth106", "description": "An introductory course that questions the whole collapse narrative while teaching students about the ways in which it has and hasn’t impacted humans. Prerequisites: upper-division standing."}
{"code": "ANTH 107", "title": "Designing for Disasters, Emergencies, and Extreme Weather", "units": "4", "anchor": "anth107", "description": "Examines the social, economic, environmental, and health impacts of anthropogenic climate change through engaged learning that integrates practice and theory. Prerequisites: upper-division standing."}
{"code": "ANTH 108", "title": "Indigenous Peoples, Extractive Development, and Climate Change", "units": "4", "anchor": "anth108", "description": "Across the world, indigenous peoples’ lands and livelihoods are increasingly vulnerable to extractive development projects such as mines, gas wells, dams, logging, and monoculture agriculture, all of which increase the impacts on climate change. This class addresses the ways indigenous communities use cultural and political resources to negotiate environmental, market, and political forces. Can protecting indigenous ways of life provide alternatives for global climate change? Prerequisites: upper-division standing."}
{"code": "ANTH 109", "title": "Climate Change, Cultural Heritage, and Vulnerability", "units": "4", "anchor": "anth109", "description": "Cultural heritage is a human right that is threatened by climate change. This course introduces students to the concept of heritage, how multiple historical and ancient processes influence social vulnerabilities, and what challenges are being faced in the context of changing climate. We will explore the formation and meanings of tangible and intangible heritage, its relation to traditional knowledge and the roles of knowledge over social vulnerability. Prerequisites: upper-division standing."}
{"code": "ANTH 110", "title": "The Climate Change Seminar", "units": "4", "anchor": "anth110", "description": "Explores climate change from the perspectives of biological, archaeological, sociocultural, and medical anthropology and global health. Students develop projects on key topics, such as food, health, sustainability, political economy, and the interaction of ecological and human processes across local, regional, and global scales. Examines social impacts and existential risks. Considers questions related to public policy, education, ethics, and interdisciplinary research collaboration. Prerequisites: upper-division standing."}
{"code": "ANTH 111", "title": "Religion and Ecology: How Religion Matters in the Anthropocene", "units": "4", "anchor": "anth111", "description": "This course will study the role that religion has played, and possibly will play, in the Anthropocene, with religion construed broadly and comparatively. Topics include use of religion and ritual to regulate the ecology, religious conceptions of the relation between humanity and nature, how religion shapes ethical stances toward the nonhuman, religious ideas of ownership or stewardship of nonhuman resources, and the role of apocalyptic narratives in shaping reaction to climate change. Prerequisites: upper-division standing."}
{"code": "ANTH 112", "title": "Regenerative Science and Human Ecology", "units": "4", "anchor": "anth112", "description": "How can we protect humanity and the planet from climate change? The course introduces methods and approaches needed to design and implement human-centered solutions to climate change. It examines the process of joining scientific knowledge with cultural knowledge to produce effective, regenerative, human-centered solutions. Explores ways to support social and ecological regeneration drawn from anthropology, culture-centered design, human ecology, and computational methods. Prerequisites: upper-division standing."}
{"code": "ANTH 120", "title": "Climate Change in California: Problems and Solutions", "units": "4", "anchor": "anth120", "description": "Examines climate problems in California, the impacts these have, and the search for solutions in coastal, desert, and urban communities. Topics include drought, extreme heat, wildfires, and sea level rise. Explores potential of university-community partnerships in developing solutions. Prerequisites: upper-division standing."}
{"code": "ANTH 128A", "title": "Climate Action Scholars: Community Engagement and Research", "units": "6", "anchor": "anth128a", "description": "This course series will examine the historical, structural, and cultural roots of the climate crisis, its effects across diverse communities and ecologies, and the creative ways local people respond and build collective resilience. In this first quarter, students will engage in hands-on research, mapping, and documentation of climate change and associated social, environmental, and health impacts. Prerequisites: upper-division standing."}
{"code": "ANTH 128B", "title": "Climate Action Scholars: Capstone Project", "units": "6", "anchor": "anth128b", "description": "In the second course of this series, students will deepen and apply their knowledge of the diverse ways the climate crisis manifests and interacts with local conditions and histories of inequity and injustice. Students will continue to participate in collaborative learning and community-based research. In addition, they will develop and implement a capstone, “climate action project,” in collaboration with local community partners. Prerequisites: ANTH 128A or USP 128A.", "prereqs": {"type": "one", "courses": ["ANTH 128A", "USP 128A"]}}
{"code": "ANTH 147", "title": "Understanding the Human Social Order: Anthropology and the Long-Term", "units": "4", "anchor": "anth147", "description": "This course explores the nature of human social systems over the long term. Returning to the original project of anthropology in the broadest sense, we examine the origins and reproduction of the state, social classes, multiethnic configurations, and political economies. Prerequisites: upper-division standing."}
{"code": "ANTH 192", "title": "Senior Seminar in Anthropology", "units": "1", "anchor": "anth192", "description": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in anthropology (at the upper-division level). Senior Seminars may be offered in all campus departments. Topics will vary from quarter to quarter. Senior Seminars may be taken for credit up to four times, with a change in topic, and consent of the department. Enrollment is limited to twenty students, with preference given to seniors. Prerequisites: upper-division standing; department stamp and/or consent of instructor."}
{"code": "ANTH 195", "title": "Instructional Apprenticeship in Anthropology", "units": "4", "anchor": "anth195", "description": "Course gives students experience in teaching of anthropology at the lower-division level. Students, under direction of instructor, lead discussion sections, attend lectures, review course readings, and meet regularly to prepare course materials and to evaluate examinations and papers. Course not counted toward minor or major. P/NP grades only. Prerequisites: upper-division standing and consent of instructor and department stamp. Received grade of A in course to be taught or equivalent. Student will need to apply for the Undergraduate Instructional Apprentice position through ASES, fulfill the Academic Senate Regulations, and receive the approval of the department, instructor, department chair, and Academic Senate."}
{"code": "ANTH 196A", "title": "Honors Studies in Anthropology", "units": "4", "anchor": "anth196a", "description": "Seminar to explore student research interests and methodologies needed to complete Honors Thesis in ANTH 196B. Students will be admitted to the Honors Program by invitation of the department in the spring of their junior year. Completion of this course with a grade of at least B+ is a prerequisite to ANTH 196B. Prerequisites: department approval required."}
{"code": "ANTH 196B", "title": "Honors Studies in Anthropology", "units": "4", "anchor": "anth196b", "description": "Independent preparation of a senior thesis under the supervision of a faculty member. Students begin two-quarter sequence in fall quarter. Prerequisites: completion of ANTH 196A with grade of B+ or better.", "prereqs": "ANTH 196A"}
{"code": "ANTH 196C", "title": "Honors Studies in Anthropology", "units": "4", "anchor": "anth196c", "description": "A weekly research seminar where students share, read, and discuss in-depth research findings resulting from ANTH 196A and 196B along with selected background literature used in each individual thesis. Students are also taught how to turn their theses into brief presentations for both specialized and broader audiences. Students will be offered opportunities to present their findings at campus events and outreach events during the quarter. Prerequisites: ANTH 196A-B.", "prereqs": {"type": "all", "courses": ["ANTH 196A", "ANTH 196B"]}}
{"code": "ANTH 197", "title": "Field Studies", "units": "4", "anchor": "anth197", "description": "The Department of Anthropology has partnered with the Academic Internship Program (AIP) at UC San Diego to provide students with internship opportunities during their undergraduate studies. The AIP allows students to integrate academic theory and “real world” practice, engage in research that explores the relationship between the two, and gain hands-on experience in a professional setting. By participating, students receive ANTH 197 (P/NP) credit while fulfilling the requirements of the Academic Internship Program Office. In order to pursue this internship, you will need to have a faculty mentor from the anthropology department. Students will be responsible to follow the requirements outlined in the AIP syllabus, as well as plans established with the faculty mentor."}
{"code": "ANTH 198", "title": "Directed Group Study", "units": "2–4", "anchor": "anth198", "description": "Directed group study on a topic or in a field not included in the regular departmental curriculum by special arrangement with a faculty member. Student may take this course twice for credit. Please note: Majors may only apply eight units of approved P/NP credit toward the major, and minors may only apply four units of P/NP credit toward the minor. Please contact the department for a list of courses you may take on a P/NP basis and apply toward the major or minor. Prerequisites: consent of instructor and upper-division standing with minimum GPA of 2.5 and completed and approved Special Studies form. Department approval required. (Formerly known as ANPR 198.)"}
{"code": "ANTH 199", "title": "Independent Study", "units": "4", "anchor": "anth199", "description": "Independent study and research under the direction of a member of the faculty. Student may take this course twice for credit. Please note: majors may only apply eight units of approved P/NP credit toward the major, and minors may only apply four units of P/NP credit toward the minor. Please contact the department for a list of courses you may take on a P/NP basis and apply toward the major or minor. Prerequisites: consent of instructor and upper-division standing with minimum GPA of 2.5 and completed and approved Special Studies form. Department approval required. (Formerly known as ANPR 199.)"}
{"code": "ANAR 100", "title": "Special Topics in Anthropological Archaeology", "units": "4", "anchor": "anar100", "description": "Course will vary in title and content. When offered, the current description and title is found in the current Schedule of Classes and the Department of Anthropology website. May be taken for credit four times. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANAR 104", "title": "Introduction to Geographic Information Systems", "units": "GIS", "anchor": "anar104", "description": "This course is an introduction to geographic information systems (GIS) and spatial analysis for anthropologists and archaeologists. The course will provide students with background theory and basic skills in GIS through lectures and hands-on lab activities. Students will learn the basics of acquiring, storing, manipulating, analyzing, and visualizing spatial data for anthropological study. Prerequisites: upper-division standing."}
{"code": "ANAR 105", "title": "The Archaeology of Literate Societies in Mesoamerica", "units": "4", "anchor": "anar105", "description": "Mesoamerican societies were writing their histories for 2,000 years before the Spanish conquest. Employing interdisciplinary methods of archaeological, historical, and anthropological source-integration, this course will explore the principles and challenges of studying literate societies, and the relevance to their contemporary descendants."}
{"code": "ANAR 111", "title": "Foundations of Archaeology", "units": "4", "anchor": "anar111", "description": "As part of the broad discipline of anthropology, archaeology provides the long chronological record needed for investigating human and social evolution. The theories and methods used in this field are examined. (Archaeology core sequence course.) Recommended preparation: ANTH 3. Prerequisites: upper-division standing. "}
{"code": "ANAR 113", "title": "Past, Present, and Future Perspectives on Natural Resources in Israel", "units": "4", "anchor": "anar113", "description": "The class will provide a basic overview of Israel’s natural resources, including water, stone, minerals, oil, and gas. Case studies on ancient exploitation of these resources will be presented (e.g., copper extraction from ore in the Negev, water management in Biblical Israel, stone quarrying for the Temple Mount, etc.), followed by a discussion on the current role of these resources in the economy of modern Israel. Prerequisites: upper-division standing."}
{"code": "ANAR 114", "title": "Environmental Hazards in Israel", "units": "4", "anchor": "anar114", "description": "Israel, like California, is located on a complex tectonic boundary, which is responsible for a history of earthquakes, volcanism, and tsunamis. How great is the risk today and what will be the regional impact of a major earthquake? We will try to answer these questions by understanding the basic geology of Israel and reviewing the history of natural disasters as recorded by archaeology and historical documentation. Prerequisites: upper-division standing."}
{"code": "ANAR 115", "title": "Coastal Geomorphology and Environmental Change—Perspectives from Israel and the South-Eastern Mediterranean", "units": "4", "anchor": "anar115", "description": "Students will develop a broad understanding of the morphological features that are identified in coastal systems, and the short- and long-term processes that shape them through time. Students will become familiar with terminology, approaches, and methodologies used in coastal geomorphological research, which are relevant for today’s study of climate and environmental change, with a focus on coastal sedimentary environments and an emphasis on the coast of Israel from ancient times until today. Prerequisites: upper-division standing."}
{"code": "ANAR 116", "title": "Sea Level Change—The Israel Case in World Perspective", "units": "4", "anchor": "anar116", "description": "This course provides students with a broad understanding of the most current sea level change research that has been conducted around the globe. Students will be introduced to the general terminology used in this field, coastal shallow marine and deep-sea sea level indicators, and their degree of uncertainty, along with corresponding dating methods. An emphasis will be given to sea-level studies conducted in Israel and neighboring lands. Prerequisites: upper-division standing."}
{"code": "ANAR 117", "title": "Archaeological Field and Lab Class, Southern California", "units": "4", "anchor": "anar117", "description": "The archaeological field and laboratory class will take place in the field in San Diego or adjacent counties. This course is a hands-on introduction to the research design of interdisciplinary archaeological projects and techniques of data collection, including survey, excavation, or laboratory analysis. May be taken for credit up to two times. Program or materials fees may apply. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANAR 118", "title": "Archaeology of the UC San Diego Campus", "units": "4", "anchor": "anar118", "description": "Our campus houses some of the earliest human settlements in North America. This course reviews the archaeology, climate, and environment of the sites and outlines research aimed at understanding the lives of these early peoples. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANAR 119S", "title": "Archaeological Field and Lab Class", "units": "8", "anchor": "anar119s", "description": "The archaeological field and laboratory class will take place at Moquegua, Peru. It is an introduction to the research design of interdisciplinary projects, the technique of data collections, the methods of excavation and postexcavation lab work. Course materials fees may apply. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANAR 120", "title": "Documenting Climate Change: Past and Present", "units": "4", "anchor": "anar120", "description": "This course will help familiarize students with the types of methods that people use to document shifting climate in the past and present day, in addition to training on geospatial data sets. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANAR 121", "title": "Cyber-Archaeology and World Digital Cultural Heritage", "units": "4", "anchor": "anar121", "description": "Concerns the latest developments in digital data capture, analyses, curation, and dissemination for cultural heritage. Introduction to geographic information systems (GIS), spatial analysis, and digital technologies applied to documentation and promotion of cultural heritage and tourism. Lectures and lab exercises. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANAR 124", "title": "Archaeology of Asia", "units": "4", "anchor": "anar124", "description": "This course explores the archaeology of Asia from the first humans through the rise of state societies. Topics include the environmental setting, pioneer migrations, hunting and gathering societies, plant and animal domestication, and the development of metallurgy, agriculture, technology, trade, and warfare in early civilizations. We consider how ancient political, intellectual, and artistic achievements shape the archaeological heritage in present-day Asia. Prerequisites: upper-division standing."}
{"code": "ANAR 135S", "title": "Ancient Mediterranean Civilization", "units": "8", "anchor": "anar135s", "description": "Study Abroad program that examines the origins and history of ancient Mediterranean civilizations from the late Neolithic period through the Classical era. During the course, students will visit some of the most important archaeological sites in the world, from the ancient megalithic temples of Malta, to Phoenician colonies of the early Iron Age, to the Carthaginian and Greek cities of Sicily, and ending with Roman Pompeii and Herculaneum, destroyed by the eruption of Vesuvius in AD 79. Students are required to apply for this Study Abroad course. Program or materials fees may apply. Prerequisites: upper-division standing. Department approval required. Students cannot receive credit for ANAR 135S and ANAR 135."}
{"code": "ANAR 138", "title": "Mesopotamia: The Emergence of Civilization", "units": "4", "anchor": "anar138", "description": "This course explores in detail the rise of the world’s earliest cities and states in Mesopotamia and the ancient Near East during the fourth millennium B.C. Prerequisites: upper-division standing."}
{"code": "ANAR 141", "title": "Prehistory of the Holy Land", "units": "4", "anchor": "anar141", "description": "Israel is a land-bridge between Africa and Asia. Course highlights the prehistory of the Levant and its interconnections from the Paleolithic to the rise of the earliest cities in anthropological perspective. Prerequisites: upper-division standing. "}
{"code": "ANAR 142", "title": "The Rise and Fall of Ancient Israel", "units": "4", "anchor": "anar142", "description": "The emergence and consolidation of the state in ancient Israel is explored by using archaeological data, biblical texts, and anthropological theories. The social and economic processes responsible for the rise and collapse of ancient Israel are investigated. Recommended preparation: ANTH 3. Prerequisites: upper-division standing. "}
{"code": "ANAR 143", "title": "Biblical Archaeology—Fact or Fiction", "units": "4", "anchor": "anar143", "description": "The relationship between archaeological data, historical research, the Hebrew Bible, and anthropological theory are explored along with new methods and current debates in Levantine archaeology. Prerequisites: upper-division standing. "}
{"code": "ANAR 144", "title": "Pharaohs, Mummies, and Pyramids: Introduction to Egyptology", "units": "4", "anchor": "anar144", "description": "An introductory survey of the archaeology, history, art, and architecture of ancient Egypt that focuses on the men and women who shaped Western civilization. Prerequisites: upper-division standing."}
{"code": "ANAR 145S", "title": "Study Abroad: Egypt of the Pharaohs", "units": "4", "anchor": "anar145s", "description": "Introduction to the archaeology, history, art, architecture, and hieroglyphs of ancient Egypt. Taught in the field through visits to important temples, pyramids, palaces, and museums in Egypt. Complementary to ANAR 144. Course/program fees may apply. Prerequisites: consent of instructor only."}
{"code": "ANAR 146", "title": "Feeding the World", "units": "4", "anchor": "anar146", "description": "What should we eat and how should we farm to guide a sustainable future? This course will examine what humans evolved to eat and how we began to first cultivate the foods we rely on today. After a survey of traditional farming methods around the world, we will examine how farming systems have changed since the Green Revolution and its successes and failures. The final part of class will focus on the last twenty years, when humans began to modify plant life at the genetic level. Students may not receive credit for ANAR 146 and SIO 146. Prerequisites: upper-division standing."}
{"code": "ANAR 153", "title": "The Mysterious Maya", "units": "4", "anchor": "anar153", "description": "The archaeology, anthropology, and history of the Maya civilization, which thrived in Mexico and Central America from 1000 BC, until the Spanish conquest. Prerequisites: upper-division standing."}
{"code": "ANAR 154", "title": "The Aztecs and their Ancestors", "units": "4", "anchor": "anar154", "description": "Introduction to the archaeology of the ancient culture of Mexico from the early Olmec culture through the Postclassic Aztec, Tarascan, Zapotec, and Mixtec states. Agriculture; trade and exchange; political and social organization; kinship networks; religious system, ideology, and worldviews. Prerequisites: upper-division standing."}
{"code": "ANAR 155", "title": "Study Abroad: Ancient Mesoamerica", "units": "4", "anchor": "anar155", "description": "This course is an introduction to the archaeology of Mesoamerica and will provide students with the opportunity to gain practical skills from the field. Students will learn hands on by visiting significant ancient cities and museums in Mexico and Central America. Students may receive a combined total of twelve units for ANAR 155 and ANAR 155S. Program or materials fees may apply. Prerequisites: students must apply to study abroad program and obtain consent of instructor."}
{"code": "ANAR 155S", "title": "Study Abroad: Ancient Mesoamerica", "units": "4", "anchor": "anar155s", "description": "Introduction to archaeology of Mesoamerica, taught through visits to important ancient cities and museums of Mexico and Central America. Complementary to ANAR 154. Itinerary and subject will vary, so course may be taken more than once. Students may receive a combined total of twelve units for ANAR 155S and ANAR 155. Program or materials fees may apply. Prerequisites: students must apply and be accepted to the study abroad program to be given permission to enroll."}
{"code": "ANAR 156", "title": "The Archaeology of South America", "units": "4", "anchor": "anar156", "description": "This course will examine archaeological evidence for the development of societies in the South American continent. From the initial arrival of populations through to the Inca period and the arrival of the Spaniards. Prerequisites: upper-division standing."}
{"code": "ANAR 157", "title": "Early Empires of the Andes: The Middle Horizon", "units": "4", "anchor": "anar157", "description": "The civilizations of Wari and Tiwanaku built the first empires of Andean South America long before the Inca. Middle Horizon (AD 500–1000) mythohistory, urbanism, state origins, art, technology, agriculture, colonization, trade, and conquest are explored using ethnohistory and archaeological sources. Students may not receive credit for both ANAR 157S and ANAR 157. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANAR 157S", "title": "Early Empires of the Andes: The Middle Horizon", "units": "4", "anchor": "anar157s", "description": "The civilizations of Wari and Tiwanaku built the first empires of Andean South America long before the Inca. Middle Horizon (AD 500–1000) mythohistory, urbanism, state origins, art, technology, agriculture, colonization, trade, and conquest are explored using ethnohistory and archaeological sources. Course is offered during summer Study Abroad. Students may not receive credit for both ANAR 157 and ANAR 157S. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANAR 158", "title": "The Inca: Empire of the Andes", "units": "4", "anchor": "anar158", "description": "The history and culture of the Inca Empire of South America and its fatal encounter with the West. Archaeological excavations, accounts from the sixteenth and seventeenth centuries, and ethnographies of present-day peoples of the Andes are explored. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANAR 158GS", "title": "The Inca", "units": "4", "anchor": "anar158gs", "description": "The history and culture of the Inca Empire of South America and its fatal encounter with the west. Archaeological excavations, sixteenth- and seventeenth-century accounts, and ethnographies of present-day peoples of the Andes are explored. Prerequisites: upper-division standing or consent of instructor. Students must submit applications to the International Center Programs Abroad Office and be accepted into the Global Seminar Program."}
{"code": "ANAR 159", "title": "Pre-Hispanic Societies of the Caribbean Archipelago", "units": "4", "anchor": "anar159", "description": "This course focuses on the social processes shaping the pre-Hispanic societies of the Caribbean Archipelago from 7kya to 1500 CE. Through the lens of material culture, we examine the archaeology of both the Greater and the Lesser Antilles, and recognize the role that colonialism has had on modern Caribbean identities and discourses, including the development of Tainidad as indigeneity in the present. Prerequisites: upper-division standing."}
{"code": "ANAR 159GS", "title": "“1492”: Coexistence, Crusade, and the Origins of the Spanish Conquest", "units": "4", "anchor": "anar159gs", "description": "This course will focus on the period from 711 through the end of the sixteenth century, and will contrast evidence for “convivencia” (multicultural coexistence) versus the history of hostility, crusade, and religious intolerance among three great cultures of medieval Spain. We will then trace the direct line from the negotiation of identity and intercultural frontiers in Spain, to the conquest of the Americas and interaction with Native Americans. Prerequisites: upper-division standing. Students must submit applications to the International Center Programs Abroad Office and be accepted into the Global Seminar Program."}
{"code": "ANAR 160", "title": "Ancient Maya: Archaeological Problems and Perspectives", "units": "4", "anchor": "anar160", "description": "This course considers in detail a particular region or archaeological site within the Maya area. Content will cover primary literature on Maya archaeology, epigraphy, and art history. Course content will vary based on the specific region/site. May be taken for credit three times. Prerequisites: upper-division standing and ANAR 153. Graduate students wishing to enroll should have already taken ANTH 202.", "prereqs": "ANAR 153"}
{"code": "ANAR 164", "title": "Underwater Archaeology—From Atlantis to Science", "units": "4", "anchor": "anar164", "description": "(Cross-listed with SIO 164.) Underwater archaeology provides access to ancient environmental and cultural data concerning human adaptation to climate and environmental change. Provides an overview of methods, theories, and practice of marine archaeology including environmental characteristics of coastal and underwater settings; the nature of ports, navigation, maritime culture, submerged landscapes, shipbuilding; methods of research in underwater settings; and legislative issues regarding underwater and coastal heritage. Students may not receive credit for both ANAR 164 and SIO 164. Prerequisites: upper-division standing."}
{"code": "ANAR 165", "title": "Marine and Coastal Archaeology and the Biblical Seas", "units": "4", "anchor": "anar165", "description": "This course will follow the interaction between humans and the sea in cultures that formed the biblical world of the second and first millennium BCE: the Canaanites, Israelites, Egyptians, Phoenicians, Philistines, and cultures of the Aegean Sea. Themes discussed will be maritime matters in the Canaanite and biblical narrative, key discoveries in maritime coastal archaeology of the eastern Mediterranean, shipwrecks: Canaanite, Phoenician, and Aegean, Egyptian ports, and Egyptian sea adventures. Prerequisites: upper-division standing."}
{"code": "ANAR 166", "title": "Introduction to Environmental Archaeology—Theory and Method of Socioecodynamics and Human Paleoecology", "units": "4", "anchor": "anar166", "description": "(Cross-listed with SIO 166.) Introduction to the multidisciplinary tools for paleoenvironmental analysis—from ecology, sedimentology, climatology, zoology, botany, chemistry, and others—and provides the theory and method to investigate the dynamics between human behavior and natural processes. This socioecodynamic perspective facilitates a nuanced understanding of topics such as resource overexploitation, impacts on biodiversity, social vulnerability, sustainability, and responses to climate change. Students may not receive credit for ANAR 166 and SIO 166."}
{"code": "ANAR 167", "title": "Geoarchaeology in Theory and Practice", "units": "6", "anchor": "anar167", "description": "(Cross-listed with SIO 167.) As specialists in human timescales, archaeologists are trained to identify subtle details that are often imperceptible for other geoscientists. This course is designed to train archaeologists to identify the natural processes affecting the archaeological record, and geoscientists to identify the influence of human behavior over land surfaces. The course, which includes lectures, laboratory training, and field observations, focuses on the articulation of sedimentology and human activity. Students may not receive credit for both ANAR 167 and SIO 167. Prerequisites: upper-division standing, ANTH 3, and SIO 50.", "prereqs": {"type": "all", "courses": ["ANTH 3", "SIO 50"]}}
{"code": "ANAR 180", "title": "Archaeology Workshop: Advanced Lab Work in Archaeology", "units": "4", "anchor": "anar180", "description": "This course examines the ways in which archaeologists study ancient artifacts, contexts, and their distribution in time and space to interpret ancient cultures. It will cover basic techniques of collections and field research with particular concentration on the quantitative contextual, spatial, stylistic, and technological analyses of artifacts and ecofacts from ongoing UC San Diego field projects in archaeology. Prerequisites: upper-division standing."}
{"code": "ANAR 182", "title": "Origins of Agriculture and Sedentism", "units": "4", "anchor": "anar182", "description": "Varying theoretical models and available archaeological evidence are examined to illuminate the socio-evolutionary transition from nomadic hunter-gathering groups to fully sedentary agricultural societies in the Old and New Worlds. Archaeology concentration course. Recommended preparation: ANTH 3. Prerequisites: upper-division standing."}
{"code": "ANAR 183", "title": "Chiefdoms, States, and the Emergence of Civilizations", "units": "4", "anchor": "anar183", "description": "The course focuses on theoretical models for the evolution of complex societies and on archaeological evidence for the development of various pre- and protohistoric states in selected areas of the Old and New Worlds. Archaeology concentration course. Recommended preparation: ANTH 3. Prerequisites: upper-division standing."}
{"code": "ANAR 184", "title": "Empires in Archaeological Perspective", "units": "4", "anchor": "anar184", "description": "In what ways were ancient empires different from modern ones? We discuss theories of imperialism and examine cross-cultural similarities and differences in the strategies ancient empires used to expand and explore how they produced, acquired, and distributed wealth. Prerequisites: upper-division standing."}
{"code": "ANAR 185", "title": "Middle East Desert Cultural Ecology", "units": "4", "anchor": "anar185", "description": "Field study in Jordan. Examines how cultural systems interact with deserts by examining technology, economic organization, kinship and religion in relation to environmental variables through time. Program fees may apply. Prerequisites: upper-division standing or consent of instructor. "}
{"code": "ANAR 186", "title": "The Human Era: The Archaeology of the Anthropocene", "units": "4", "anchor": "anar186", "description": "The course uses a comparative perspective to examine changes in how human societies organized themselves after the end of the last Ice Age across the world and the impact that those changes had on the planet’s natural environment. Prerequisites: upper-division standing."}
{"code": "ANAR 190", "title": "Eastern Mediterranean Archaeological Field School", "units": "12", "anchor": "anar190", "description": "The archaeological field school will take place in the eastern Mediterranean region. It is an introduction to the design of research projects, the techniques of data collection, and the methods of excavation. Includes postexcavation lab work, study trips, and field journal. Program or materials fees may apply.  Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANAR 191", "title": "Advanced Cyber-Archaeology Field School", "units": "12", "anchor": "anar191", "description": "Students learn advanced field methods in cyber-archaeology and excavation. Includes 3-D data capture tools and processing, digital photography, construction of research designs, cyber-infrastructure. Takes place in the eastern Mediterranean region. Program or materials fees may apply. Prerequisites: upper-division standing and consent of instructor."}
{"code": "ANBI 100", "title": "Special Topics in Biological Anthropology", "units": "4", "anchor": "anbi100", "description": "Course usually taught by visiting faculty in biological anthropology. Course will vary in title and content. When offered, the current description and title is found in the current Schedule of Classes and the Department of Anthropology website. May be taken for credit four times as topics vary. Prerequisites: upper-division standing."}
{"code": "ANBI 109", "title": "Brain Mind Workshop", "units": "2", "anchor": "anbi109", "description": "A weekly forum for presentation and discussion of work in anthropology and cognitive neuroscience by faculty, students, and guest speakers. P/NP only. Please note: Majors may only apply eight units of approved P/NP credit toward the major, and minors may only apply four units of P/NP credit toward the minor. Prerequisites: upper-division standing."}
{"code": "ANBI 111", "title": "Human Evolution", "units": "4", "anchor": "anbi111", "description": "Major stages of human evolution including the fossil evidence for biological and cultural changes through time. Prerequisites: upper-division standing."}
{"code": "ANBI 112", "title": "Methods in Human Comparative Neuroscience", "units": "4", "anchor": "anbi112", "description": "Structural, molecular, cellular, and hybrid methods are used to examine the conserved and derived features of the human brain. Students will study the literature on these methods, observe their application in the design and execution of laboratory experiments, and discuss the challenges involved in their application, including limitations and strengths. Prerequisites: upper-division standing, ANBI 140, or consent of instructor.", "prereqs": "ANBI 140"}
{"code": "ANBI 114", "title": "Methods in Primate Conservation", "units": "4", "anchor": "anbi114", "description": "Primate (and other vertebrate) conservation involves a variety of methods: field (e.g., population and habitat assessment), computer (e.g., population genetic models), and increasingly the web (e.g., interactive GIS and databases). Course takes problem-solving approach to learning some of these methods. Prerequisites: upper-division standing."}
{"code": "ANBI 116", "title": "Human Sexuality in an Evolutionary Perspective", "units": "4", "anchor": "anbi116", "description": "This course examines how human sexuality evolved and how it is similar/dissimilar to that of other primates. The topics include the evolution of mating strategies and parenting strategies including the role of sexual selection and how hormones control these behaviors. Prerequisites: upper-division standing."}
{"code": "ANBI 117", "title": "Ancient Genomics: Who We Are and How We Got Here", "units": "4", "anchor": "anbi117", "description": "From fragments of ancient DNA discovered in the pigment of 50,000-year-old cave paintings, to the remains of Neanderthal bones buried in caves, the potential to extract DNA from ancient human remains has revolutionized the study of human prehistory and evolution. In this course we will focus on technological benchmarks that have allowed the interpretation of ancient genomes. Some highlights include evidence of ancient hominid-human mixing and the spread of farming and languages across the globe. Prerequisites: upper-division standing."}
{"code": "ANBI 118", "title": "Technology on the Go: Mobile Tools for Human Biology", "units": "4", "anchor": "anbi118", "description": "Mobile tools are democratizing access to biomedicine in low resource areas of the world. This course highlights the impact of portable technologies on human biology through three modes of innovation: communication (e.g., sensors, cellphones), intervention (e.g., telemedicine, drones), and population analytics (e.g., metadata, epidemic tracking). Prerequisites: upper-division standing."}
{"code": "ANBI 120", "title": "Ethical Dilemmas in Biological Anthropology", "units": "4", "anchor": "anbi120", "description": "All human endeavors are subject to human biases. We’ll cover several issues that are subject to such biases: “race” concept; transfer of human remains to Native American tribal members; nonhuman primate testing; and use of human materials, including cell lines. Prerequisites: upper-division standing."}
{"code": "ANBI 121", "title": "The Original Moonshot: The Voyaging Achievements of the Polynesian Ancestors", "units": "4", "anchor": "anbi121", "description": "For more than a millennium, Polynesians have occupied the remotest islands in the Pacific Ocean. Polynesians can trace their roots to a group of epic voyagers who ventured out into the unknown in one of the greatest adventures in human history. Using a mix of biology, history, geography, anthropology, and the science of navigation, “the original moonshot” will explore the thrill of exploration and the drama of discovery in a vivid tour of one of the most captivating regions in the world. Prerequisites: upper-division standing."}
{"code": "ANBI 130", "title": "Biology of Inequality", "units": "4", "anchor": "anbi130", "description": "Biological and health consequences of racial and social inequalities. Psychosocial stress and measurement of health impact. Effects on disease and precursors to disease, including measures of molecular biology (e.g., epigenetics, gene expression), and biomarkers of inflammation, cardiometabolic health, and immune function. Prerequisites: upper-division standing."}
{"code": "ANBI 131", "title": "Biology and Culture of Race", "units": "4", "anchor": "anbi131", "description": "This course examines conceptions of race from both evolutionary and sociocultural perspectives. We will examine current patterns of human genetic variation and critically determine how these patterns map onto current and historic conceptions of race in the United States, and abroad. We will also explore the social construction of race throughout US history, the use of racial categories in biomedicine today, and consequences of racism and discrimination on health. Prerequisites: upper-division standing."}
{"code": "ANBI 132", "title": "Conservation and the Human Predicament", "units": "4", "anchor": "anbi132", "description": "Interdisciplinary discussion of the human predicament, biodiversity crisis, and importance of biological conservation. Examines issues from biological, cultural, historical, economic, social, political, and ethical perspectives emphasizing new approaches and new techniques for safeguarding the future of humans and other biosphere inhabitants. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANBI 133", "title": "Planet of the Apes: Evolution and Ecology of the Great Ape", "units": "4", "anchor": "anbi133", "description": "The great apes are our closest living relatives and their ecology and evolution provide insights for human evolutionary history and perhaps ideas about how to coexist with them. The course examines the natural history, behavior, ecology, and life history of each of the great apes including orangutans, gorillas, bonobos, and chimpanzees. We will also consider conservation issues facing wild great apes, the welfare of apes in captivity, and ethical debates on ape “personhood.” Prerequisites: upper-division standing."}
{"code": "ANBI 134", "title": "Human Evolutionary Genetics", "units": "4", "anchor": "anbi134", "description": "This course explores how genetic data can be used to address core issues in human evolution. We will reconstruct population history and explore sources of human genetic diversity, such as migration and selection, based on studies of modern and ancient DNA. Through critical evaluation of recent publications, we will discuss the molecular evidence for the origin of modern humans, race, reconstruction of key human migrations, interactions with the environment, and implications for disease. May be coscheduled with ANTH 264. Prerequisites: BILD 1 and upper-division standing.", "prereqs": "BILD 1"}
{"code": "ANBI 135", "title": "Genetic Anthropology Lab Techniques", "units": "4", "anchor": "anbi135", "description": "This course provides hands-on experience with the latest molecular techniques as applied to questions of anthropological and human genetic interest. Students will isolate their own DNA and generate DNA sequence data. They will also measure and analyze the percent of DNA methylation at certain regions of their own genomes. We will also discuss measurement of other nongenetic biomarkers that can be incorporated into anthropological research of living populations, e.g., cortisol measures. Prerequisites: upper-division standing."}
{"code": "ANBI 136", "title": "Human Comparative Neuroanatomy", "units": "4", "anchor": "anbi136", "description": "The human brain and the structural and functional adaptations it has undergone throughout primate evolution are responsible for the most defining characteristics of our species. This course familiarizes students with major brain structures and functions linked to human cognitive and behavioral specializations and examines the relationship between structural variation of the brain and behavior through comparative neuroanatomical studies in human neuropathologies. Prerequisites: upper-division standing."}
{"code": "ANBI 139", "title": "Evolution of Human Disease", "units": "4", "anchor": "anbi139", "description": "The course will explore the major epidemiological transitions from ape-like ancestors to foraging tribes, farmers, and pastoralists to the global metropolitan primate we now are. We will focus on how diseases have shaped humans and how humans have shaped disease. Prerequisites: upper-division standing."}
{"code": "ANBI 140", "title": "The Evolution of the Human Brain", "units": "4", "anchor": "anbi140", "description": "Introduction to the organization of the brain of humans and apes. Overview of the theoretical perspectives on the evolution of the primate cortex and limbic system. Exposure to contemporary techniques applied to the comparative study of the hominoid brain. Prerequisites: upper-division standing."}
{"code": "ANBI 141", "title": "The Evolution of Human Diet", "units": "4", "anchor": "anbi141", "description": "The genotype of our ancestors had no agriculture or animal domestication, or rudimentary technology. Our modern diet contributes to heart disease, cancers, and diabetes. This course will outline the natural diet of primates and compare it with early human diets. Prerequisites: upper-division standing."}
{"code": "ANBI 143", "title": "The Human Skeleton", "units": "4", "anchor": "anbi143", "description": "Learn the bones of your body; how bone pairs differ even within the body, between men, women, ethnic groups; and how nutrition and disease affect them. Course examines each bone and its relation with other bones and muscles that allow your movements. Prerequisites: upper-division standing."}
{"code": "ANBI 144", "title": "Human Anatomy", "units": "4", "anchor": "anbi144", "description": "This course will introduce students to the internal structure of the human body through dissection tutorials on CD-ROM. Prerequisites: upper-division standing."}
{"code": "ANBI 145", "title": "Bioarcheology", "units": "4", "anchor": "anbi145", "description": "How are skeletal remains used to reconstruct human livelihoods throughout prehistory? The effects of growth, use, and pathology on morphology and the ways that skeletal remains are understood and interpreted by contemporary schools of thought. Recommend related course in human anatomy. Prerequisites: upper-division standing."}
{"code": "ANBI 146", "title": "Stable Isotopes in Ecology", "units": "4", "anchor": "anbi146", "description": "The stable isotopes of carbon, nitrogen, oxygen, and hydrogen in animal tissues, plant tissues, and soils indicate aspects of diet and ecology. The course will introduce students to this approach for reconstructing paleo-diet, paleo-ecology, and paleo-climate. Prerequisites: upper-division standing."}
{"code": "ANBI 148", "title": "Not by Genes Alone: The Ecology and Evolution of Primate Behavior", "units": "4", "anchor": "anbi148", "description": "The course examines the evolution of primate behaviors (e.g., group formation, dispersal, parenting, coalition formation) from a comparative behavioral, ecological, and evolutionary perspective. Observational methodology and analytical methods will also be discussed. Attendance in lab sections is required. Prerequisites: upper-division standing."}
{"code": "ANBI 149", "title": "Social and Behavioral Epigenetics", "units": "4", "anchor": "anbi149", "description": "This course is a seminar where we will discuss the latest scientific research in epigenetic mechanisms (changes to gene expression without changing underlying DNA sequences) and their role in regulating health and behavior of humans and other mammals in response to environmental stimuli. Our focus will be on publications related to social and behavioral epigenetics phenomena. Recommended preparation: students should have research experience in a molecular lab. Prerequisites: upper-division standing. ANBI 130 or ANBI 131 or ANBI 134 or ANBI 135 or consent of instructor."}
{"code": "ANBI 159", "title": "Biological and Cultural Perspectives on Intelligence", "units": "4", "anchor": "anbi159", "description": "Attitudes toward other individuals (and species) are often shaped by their apparent “intelligence.” This course discusses the significance of brain size/complexity, I.Q. tests, communication in marine mammals and apes, complex behavioral tactics, and the evolution of intelligence. Prerequisites: upper-division standing."}
{"code": "ANBI 173", "title": "How Monkeys See the World", "units": "4", "anchor": "anbi173", "description": "The last divide between humans and other animals is in the area of cognition. A comparative perspective to explore recent radical reinterpretations of the cognitive abilities of different primate species, including humans and their implications for the construction of evolutionary scenarios. Prerequisites: upper-division standing."}
{"code": "ANBI 174", "title": "Conservation and the Media: Film Lab", "units": "4", "anchor": "anbi174", "description": "Conservation on a human-dominated planet is a complex topic. Sometimes a picture is worth a thousand words. This course explores how films about conservation and the human predicament tackle current problems. What makes them effective and what makes them “fail”? We view one film a week and discuss it based on articles and books about that week’s topic. Prerequisites: upper-division standing."}
{"code": "ANBI 175", "title": "Paleofantasy: The Evidence for Our Early Ancestors", "units": "4", "anchor": "anbi175", "description": "Models of human evolution combine science and myth. This course examines methods used in reconstructions of human evolution. Models such as “man the hunter” and “woman the gatherer” are examined in light of underlying assumptions, and cultural ideals. Prerequisites: upper-division standing."}
{"code": "ANSC 100", "title": "Special Topics in Sociocultural Anthropology", "units": "4", "anchor": "ansc100", "description": "Course usually taught by visiting faculty in sociocultural anthropology. Course will vary in title and content. When offered, the current description and title is found in the current Schedule of Classes and the anthropology department website. (Can be taken a total of four times as topics vary.) Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANSC 101", "title": "Aging: Culture and Health in Late Life Human Development", "units": "4", "anchor": "ansc101", "description": "(Cross-listed with GLBH 101.) Examines aging as process of human development, from local and global perspectives. Focuses on the interrelationships of social, cultural, psychological, and health factors that shape the experience and well-being of aging populations. Students explore the challenges and wisdom of aging. Students may not receive credit for GLBH 101 and ANSC 101. Prerequisites: upper-division standing."}
{"code": "ANSC 101A", "title": "Korean Wave Media and Cultural Change", "units": "4", "anchor": "ansc101a", "description": "This course examines Korean Wave media (e.g., music, dramas, film) as an institution of transnational cultural change in relation to everyday social behavior, consumerism, and identifications with gender, sexuality, class, race, and nationality. The course highlights different responses to Korean media to analyze how cultural meanings are not fixed by the productive frame of Korean society and its “cultural industries,” but rather interpreted, reimagined, and performed by international audiences. Prerequisites: upper-division standing."}
{"code": "ANSC 104", "title": "The US-Mexico Border", "units": "4", "anchor": "ansc104", "description": "This course puts the perennial hot-button topic of the border into historical and anthropological perspective, unpacking its importance for both Mexico and the United States. After establishing its implications since 1848 for national identities, flows of labor and capital, and state consolidation, we will explore a series of contemporary topics including tourism and cross-border consumption, violence and illegal traffic, border enforcement technologies, migration and asylum, and more. Prerequisites: upper-division standing."}
{"code": "ANSC 105", "title": "Global Health and Inequality", "units": "4", "anchor": "ansc105", "description": "(Cross-listed with GLBH 105.) Why is there variation of health outcomes across the world? We will discuss health and illness in context of culture and address concerns in cross-national health variations by comparing healthcare systems in developed, underdeveloped, and developing countries. In addition, we’ll study the role of socioeconomic and political change in determining health outcomes and examine social health determinants in contemporary global health problems: multidrug resistance to antibiotics, gender violence, human trafficking, etc. Students may receive credit for one of the following: ANSC 105GS, ANSC 105S, ANSC 105, or GLBH 105. Prerequisites: first-year students and sophomores cannot enroll without consent of the instructor."}
{"code": "ANSC 105GS", "title": "Global Health and Inequality", "units": "4", "anchor": "ansc105gs", "description": "Why is there variation of health outcomes across the world? We will discuss health and illness in context of culture and address concerns in cross-national health variations by comparing health-care systems in developed, underdeveloped, and developing countries. In addition, we’ll study the role of socioeconomic and political change in determining health outcomes, and examine social health determinants in contemporary global health problems—multidrug resistance to antibiotics, gender violence, human trafficking, etc. Students may receive credit for one of the following: ANSC 105GS, ANSC 105S, ANSC 105, or GLBH 105. Program or materials fees may apply. Students must apply at http://globalseminars.ucsd.edu."}
{"code": "ANSC 105S", "title": "Global Health and Inequality—Study Abroad", "units": "4", "anchor": "ansc105s", "description": "Why is there variation of health outcomes across the world? We will discuss health and illness in context of culture and address concerns in cross-national health variations by comparing healthcare systems in developed, underdeveloped, and developing countries. In addition, we’ll study the role of socioeconomic and political change in determining health outcomes, and examine social health determinants in contemporary global health problems: multidrug resistance to antibiotics, gender violence, and human trafficking, etc. Students must apply to the Study Abroad Program online at http://anthro.ucsd.edu. Program or materials fees may apply. Students may receive credit for one of the following: ANSC 105GS, ANSC 105S, ANSC 105, or GLBH 105."}
{"code": "ANSC 106", "title": "Global Health: Indigenous Medicines in Latin America", "units": "4", "anchor": "ansc106", "description": "Drawing on medical anthropology ethnography, students will explore a variety of forms of healing among rural and urban indigenous communities. A particular focus on intercultural health will allow the students to analyze contemporary medical landscapes where patients encounter indigenous and Western medicine. Students will learn about the complexities of urban and rural indigenous healing settings and their sociopolitical significance in contexts of state biomedical interventions. Students may receive credit for one of the following: ANSC 106, ANSC 106S, or ANSC 106GS. First-year students and sophomores cannot enroll without consent of the instructor."}
{"code": "ANSC 106S", "title": "Global Health: Indigenous Medicines in Latin America—Study Abroad", "units": "4", "anchor": "ansc106s", "description": "Drawing on medical anthropology ethnography, students will explore a variety of forms of healing among rural and urban indigenous communities. A particular focus on intercultural health will allow the students to analyze contemporary medical landscapes where patients encounter indigenous and Western medicine. Students will learn about the complexities of urban and rural indigenous healing settings and their sociopolitical significance in contexts of state biomedical interventions. Students may receive credit for one of the following: ANSC 106, ANSC 106S, or ANSC 106GS. Students must apply to the program online at http://anthropology.ucsd.edu. Program or materials fees may apply."}
{"code": "ANSC 106GS", "title": "Global Health: Indigenous Medicines in Latin America", "units": "4", "anchor": "ansc106gs", "description": "Drawing on medical anthropology ethnography, students will explore a variety of forms of healing among rural and urban indigenous communities. A particular focus on intercultural health will allow the students to analyze contemporary medical landscapes where patients encounter indigenous and Western medicine. Students will learn about the complexities of urban and rural indigenous healing settings and their sociopolitical significance in contexts of state biomedical interventions. Students may receive credit for one of the following: ANSC 106, ANSC 106S, or ANSC 106GS. Program or materials fees may apply. Students must apply at https://globalseminars.ucsd.edu."}
{"code": "ANSC 107", "title": "Capitalism and Empire", "units": "4", "anchor": "ansc107", "description": "This course is one of several about the dominant manner of organizing life on the planet: capitalism. It explores the way that capitalist relations often entail political arrangements larger than the unit we are most familiar with, the nation-state. The goal of the course is to better understand the relationship between capitalism and its various systems of rule, including not only colonialism and imperialism, but also new global configurations that are now coming into view. Prerequisites: upper-division standing."}
{"code": "ANSC 108", "title": "Capitalism and Money", "units": "4", "anchor": "ansc108", "description": "This course considers the diverse forms of capitalist money and money relations, including the historical significance of metals like silver and gold, the relationship between money and finance, and new developments like Bitcoin and the promise of other emergent digital technologies. The goal of the course is to better understand the centrality of money in capitalist relations, including its most contemporary forms. Prerequisites: upper-division standing."}
{"code": "ANSC 109", "title": "Capitalism and the State", "units": "4", "anchor": "ansc109", "description": "This course is one of several about the dominant manner of organizing life on the planet: capitalism. It focuses on the nation-state as the preeminent capitalist political form and explores how specific ones around the world have developed in different ways. The goal of the course is to better understand what capitalist states are and what they do, including especially their economic and military activities. Prerequisites: upper-division standing."}
{"code": "ANSC 110", "title": "Societies and Cultures of the Caribbean", "units": "4", "anchor": "ansc110", "description": "This course examines societies and cultures of the Caribbean in anthropological and historical perspective. Topics include slavery, emancipation, indentureship, kinship, race, ethnicity, class, gender, politics, food, religion, music, festivals, popular culture, migration, globalization, and tourism. Prerequisites: upper-division standing."}
{"code": "ANSC 111", "title": "The Chinese Heritage in Taiwan", "units": "4", "anchor": "ansc111", "description": "This course will provide an anthropological perspective on Chinese culture in Taiwan from its earliest settlement to the present, including distinctive Taiwanese variants of traditional Chinese marriage and family life, institutions, festivals, agricultural practices, etc. Prerequisites: upper-division standing."}
{"code": "ANSC 113", "title": "Language, Style, and Youth Identities", "units": "4", "anchor": "ansc113", "description": "Young people draw on language as well as clothing and music to display identities in contemporary societies. We examine the relation of language to race, class, gender, and ethnicity in youth identity construction, especially in multilingual and multiracial societies. Prerequisites: upper-division standing."}
{"code": "ANSC 114", "title": "Food Cultures of South Asia", "units": "4", "anchor": "ansc114", "description": "This course explores the diverse food cultures of South Asia, focusing on the ways food, spices, and beverages shape identity, social relations, and cultural heritage. It will place food practices in the context of food security, sustainability, inequality, nutrition, family, and kinship. Students develop projects focused on understanding the cultural and historical significance of a particular food dish or regional culinary tradition. Prerequisites: upper-division standing."}
{"code": "ANSC 116", "title": "Languages of the Americas: Mayan", "units": "4", "anchor": "ansc116", "description": "An introduction to the languages and cultures of speakers of the Mayan family of languages, with emphasis on linguistic structures, ethnography, and the social history of the region. The course will concentrate on linguistic and ethnographic literature of a single language or subbranch, emphasizing commonalities with the family and region as a whole. Prerequisites: upper-division standing."}
{"code": "ANSC 117", "title": "Transgenderisms", "units": "4", "anchor": "ansc117", "description": "This course contrasts mainstream Anglo-American conceptualizations of transgenderism with ethnographic accounts of the experiences and practices of gender expansive people of color (African, Native, Asian/Pacific Islander, and Latinx Americans) in the U.S. and abroad. It will question the idea of transgenderism as a crossing from one gender to another one, the distinction between gender identity and sexuality, and the analytic of intersectionality. Students will not receive credit for both CGS 117 and ANSC 117. Prerequisites: upper-division standing."}
{"code": "ANSC 118", "title": "Language and Culture", "units": "4", "anchor": "ansc118", "description": "An introduction to the study of cultural patterns of thought, action, and expression, in relation to language. We consider comparatively semiotics and structuralism, cognition and categorization, universals versus particulars, ideologies of stasis and change, cultural reconstruction, and ethnopoetics. Prerequisites: upper-division standing."}
{"code": "ANSC 119", "title": "Gesture, Communication, and the Body", "units": "4", "anchor": "ansc119", "description": "The course is an introduction to a flourishing area of research that connects linguistic communication to alternate and complementary modalities—manual gesticulation, the face, the body, and aspects of the “lived environment” (spaces, tools, artifacts). Credit not allowed for both ANSC 119GS and ANSC 119. Prerequisites: upper-division standing."}
{"code": "ANSC 119GS", "title": "Gesture, Communication, and the Body", "units": "4", "anchor": "ansc119gs", "description": "A critical examination of research connecting language to alternate complementary modalities—the hands, face, body, and aspects of “lived environments” (spaces, tools, artifacts). Program or materials fees may apply. Prerequisites: upper-division standing or consent of instructor. Students must apply and be accepted to the Global Seminar Program."}
{"code": "ANSC 120", "title": "Religion and Culture", "units": "4", "anchor": "ansc120", "description": "Explores religious life in various cultures. Topics addressed include the problem of religious meaning, psychocultural aspects of religious experience, religious conversion and revitalization, contrasts between traditional and world religions, religion and social change. Prerequisites: upper-division standing."}
{"code": "ANSC 121", "title": "Psychological Anthropology", "units": "4", "anchor": "ansc121", "description": "Interrelationships of aspects of individual personality and various aspects of sociocultural systems are considered. Relations of sociocultural contexts to motives, values, cognition, personal adjustment, stress and pathology, and qualities of personal experience are emphasized. Prerequisites: upper-division standing."}
{"code": "ANSC 122", "title": "Language in Society", "units": "4", "anchor": "ansc122", "description": "This course examines the role of communicative practices and language differences in organizing social life. Topics include social action through language; child language socialization; language and social identity (ethnicity, gender, class); interethnic communication; language ideologies; and language and power in social institutions and everyday life. Prerequisites: upper-division standing. "}
{"code": "ANSC 123", "title": "Political Anthropology", "units": "4", "anchor": "ansc123", "description": "Humans are goal seekers, some with public goals. Course considers ways goals are pursued, which are desirable, and how this pursuit is carried out at the local level with attention to the parts played by legitimacy and coercion. Prerequisites: upper-division standing. "}
{"code": "ANSC 124", "title": "Cultural Anthropology", "units": "4", "anchor": "ansc124", "description": "This course introduces the concept of culture and the debates surrounding it. Cultural anthropology asks how people create meaning and order in society, how culture intersects with power, and how national and global forces impact local meanings and practices. Prerequisites: upper-division standing."}
{"code": "ANSC 125", "title": "Gender, Sexuality, and Society", "units": "4", "anchor": "ansc125", "description": "How are gender and sexuality shaped by cultural ideologies, social institutions, and social change? We explore their connections to such dimensions of society as kinship and family, the state, religion, and popular culture. We also examine alternative genders/sexualities cross-culturally. Students may not receive credit for ANSC 125 and ANSC 125GS. Prerequisites: upper-division standing."}
{"code": "ANSC 125GS", "title": "Gender, Sexuality, and Society", "units": "4", "anchor": "ansc125gs", "description": "How are gender and sexuality shaped by cultural ideologies, social institutions, and social change? We explore their connections to such dimensions of society as kinship and family, the state, religion, and popular culture. We also examine alternative genders/sexualities cross-culturally. Students may not receive credit for ANSC 125GS and ANSC 125. Program or materials fees may apply. Prerequisites: upper-division standing or consent of instructor. Students must apply for and be accepted to the Global Seminar Program."}
{"code": "ANSC 126", "title": "Childhood and Adolescence", "units": "4", "anchor": "ansc126", "description": "This course examines the diversity of practices of child-rearing, socialization, and enculturation across cultures, and the role of culture in the development of personality, morality, spirituality, sexuality, emotion, and cognition. Prerequisites: upper-division standing."}
{"code": "ANSC 127", "title": "Discourse, Interaction, and Social Life", "units": "4", "anchor": "ansc127", "description": "The course considers how social life is constituted and negotiated through language and interaction. How do people establish, maintain, and alter social relationships through face-to-face talk, and how do different modalities of interaction (including discourse and gesture) affect social life? Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANSC 129", "title": "Meaning and Healing", "units": "4", "anchor": "ansc129", "description": "(Cross-listed with GLBH 129.) This course examines the nature of healing across cultures, with special emphasis on religious and ritual healing. Students may not receive credit for GLBH 129 and ANSC 129. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANSC 130", "title": "Hinduism", "units": "4", "anchor": "ansc-130", "description": "An anthropological introduction to Hinduism, focusing on basic religious concepts and practices. Topics include myth, ritual, and symbolism; forms of worship; gods and goddesses; the roles of priest and renouncer; pilgrimages and festivals; the life cycle; popular Hinduism, Tantrism. Prerequisites: upper-division standing."}
{"code": "ANSC 131", "title": "Language, Law, and Social Justice", "units": "4", "anchor": "ansc131", "description": "Legal systems are central in (re)organizing social institutions, international arrangements, (in)equalities, and are an arena where linguistic practices predominate and define outcomes. With an anthropological approach to language, examine languages of the law, legal conceptions of language, and most importantly, the nature and structure of talk in a range of legal institutions and activities. Students will engage in direct anthropological fieldwork in local contexts involving the legal bureaucracy. Prerequisites: upper-division standing."}
{"code": "ANSC 132", "title": "Sex and Love", "units": "4", "anchor": "ansc132", "description": "What is love? This course explores evolutionary, historical, philosophical, physiological, psychological, sociological, political-economic, and anthropological perspectives on love. We examine how love has evolved, study various aspects considered biological or cultural, and address contemporary debates around the nature and uses of love, including topics such as monogamy, arranged marriage, companionship, interracial relationships, and online dating. Prerequisites: upper-division standing."}
{"code": "ANSC 133", "title": "Peoples and Cultures of the Middle East", "units": "4", "anchor": "ansc133", "description": "This course explores the living structures, family and gender relations, economy, and religion in the Middle East. We will especially focus on how people come to terms with recent transformations such as nationalism, literacy, globalism, and Islamism. Prerequisites: upper-division standing."}
{"code": "ANSC 134", "title": "The Politics of Environmental Change", "units": "4", "anchor": "ansc134", "description": "In this course, we will explore how people advocating for environmental change works. We will study the theory of social change, including the discourses of nature and culture that underlie contemporary societies. We will study the ways political decisions are made and how policy makers are influenced. Given the enormity of what is at stake—climate change and increasing environmental precarity—how can we harness politics to transform our world? Prerequisites: upper-division standing."}
{"code": "ANSC 135", "title": "Indigenous Peoples of Latin America", "units": "4", "anchor": "ansc135", "description": "Indigenous peoples in the Americas have long been dominated and exploited. They have also resisted and reworked the powerful forces affecting them. This course will trace this centuries-long contestation, focusing on ways anthropological representations have affected those struggles. Students may receive credit for one of the following: ANSC 135 or ANSC 135GS. Prerequisites: upper-division standing."}
{"code": "ANSC 135GS", "title": "Indigenous Peoples of Latin America", "units": "4", "anchor": "ansc135gs", "description": "Indigenous peoples in the Americas have long been dominated and exploited. They have also resisted and reworked the powerful forces affecting them. This course will trace this centuries-long contestation, focusing on ways anthropological representations have affected those struggles. Students may receive credit for one of the following: ANSC 135 or ANSC 135GS. Program or materials fees may apply. Students must apply at https://globalseminars.ucsd.edu."}
{"code": "ANSC 136", "title": "Traditional Chinese Society", "units": "4", "anchor": "ansc136", "description": "Course examines major institutions and culture patterns of traditional China, especially as studied through ethnographic sources. Topics include familism, religion, agriculture, social mobility, and personality. Prerequisites: upper-division standing."}
{"code": "ANSC 137", "title": "Chinese Popular Religion", "units": "4", "anchor": "ansc137", "description": "The religious world of ordinary precommunist times, with some reference to major Chinese religious traditions. Recommended preparation: background in premodern Chinese history. Prerequisites: upper-division standing."}
{"code": "ANSC 138", "title": "The Cultural Design Practicum: Using Anthropology to Solve Human Problems", "units": "4", "anchor": "ansc138", "description": "Explores anthropological approaches to finding solutions to human problems. Using cultural analysis and ethnographic approaches, students conduct supervised field projects to assess real-world problems and then design, evaluate, and communicate possible solutions. Prerequisites: upper-division standing."}
{"code": "ANSC 139", "title": "Native American Health and Healing", "units": "4", "anchor": "ansc139", "description": "(Cross-listed with GLBH 139.) This course examines fact and fiction with respect to epidemics of contagious diseases including smallpox and tuberculosis, alcohol and drug dependency, diabetes and obesity, depression and suicide. We analyze health care with respect to the history and development of the Indian Health Service, health care efforts by Christian missionaries, tribal-led health initiatives, indigenous spiritual healing, and collaborations between indigenous healers and biomedical professionals. Students may not receive credit for ANSC 139 and GLBH 139. ANSC 139/GLBH 139 may be coscheduled with ANTH 237/GLBH 245. Prerequisites: upper-division standing."}
{"code": "ANSC 140", "title": "Human Rights II: Contemporary Issues", "units": "4", "anchor": "ansc140", "description": "Interdisciplinary discussion that outlines the structure and functioning of the contemporary human rights regime, and then delves into the relationship between selected human rights protections—against genocide, torture, enslavement, political persecution, etc.—and their violation, from the early Cold War to the present. Students may not receive credit for both ANSC 140 and HMNR 101. Prerequisites: upper-division standing."}
{"code": "ANSC 141", "title": "Language and Political Action", "units": "4", "anchor": "ansc141", "description": "This class explores how language use and people’s ideas about language benefit some people and work to the detriment of others. Actively engaging contemporary topics and materials related to race, gender, social class, activism, bureaucracy, and electoral politics, this course offers insight into the constitutive role of language in the making of political action. Prerequisites: upper-division standing."}
{"code": "ANSC 142", "title": "Anthropology of Latin America", "units": "4", "anchor": "ansc142", "description": "This course will examine the overarching legacies of colonialism, the persistence of indigenous peoples and cultures, the importance of class and land reform, the effects of neoliberalism, and citizens’ efforts to promote social change in contemporary democracies. Prerequisites: upper-division standing."}
{"code": "ANSC 143", "title": "Mental Health as Global Health Priority", "units": "4", "anchor": "ansc143", "description": "(Cross-listed with GLBH 143.) Why is mental health a global concern? This anthropological course reviews globalization, culture, and mental health. We examine issues of social suffering, stigma, and economic burden associated with mental illness, gender inequality, political violence, “global security,” pharmaceutical and illegal drugs. May be coscheduled with ANTH 243. Students may not receive credit for both ANSC 143 and GLBH 143. Prerequisites: upper-division standing."}
{"code": "ANSC 144", "title": "Immigrant and Refugee Health", "units": "4", "anchor": "ansc144", "description": "Examines physical and mental health sequalae of internal and transnational movement of individuals and populations due to warfare, political violence, natural disaster, religious persecution, poverty and struggle for economic survival, and social suffering of communities abandoned by migrants and refugees. May be coscheduled with ANTH 238. Prerequisites: upper-division standing. Students may not receive credit for ANSC 144 and ANTH 238."}
{"code": "ANSC 145", "title": "Indigenous Peoples of North America", "units": "4", "anchor": "ansc145", "description": "This course addresses: 1) Diversity among traditional Native American cultures with respect to social organization, religion, environmental adaptation, subsistence, and reaction to colonial conquest and domination; and, 2) Contemporary social issues including tribal sovereignty, religious freedom, health, education, gambling, and repatriation of artifacts/remains. Prerequisites: upper-division standing."}
{"code": "ANSC 147", "title": "Global Health and the Environment", "units": "4", "anchor": "ansc147", "description": "(Cross-listed with GLBH 147.) Examines interactions of culture, health, and environment. Rural and urban human ecologies, their energy foundations, sociocultural systems, and characteristic health and environmental problems are explored. The role of culture and human values in designing solutions will be investigated. Students may not receive credit for GLBH 147 and ANSC 147. Prerequisites: upper-division standing."}
{"code": "ANSC 148", "title": "Global Health and Cultural Diversity", "units": "4", "anchor": "ansc148", "description": "(Cross-listed with GLBH 148.) Introduction to global health from the perspective of medical anthropology on disease and illness, cultural conceptions of health, doctor-patient interaction, illness experience, medical science and technology, mental health, infectious disease, and health-care inequalities by ethnicity, gender, and socioeconomic status. May be coscheduled with ANTH 248. Students may not receive credit for GLBH 148 and ANSC 148. Prerequisites: upper-division standing."}
{"code": "ANSC 149", "title": "Conflict, Health, and Inequality", "units": "4", "anchor": "ansc149", "description": "Mitigating the effects of conflict and inequality is a major priority for global health practitioners. This course explores the ways that conflict and structural inequalities deeply affect people’s mental and physical health and how they cope and survive in these conditions. We know that the effects of violence and war do not just disappear after the fact but linger for a long time. How do we know how and when a person’s health is restored after massive disruptions? Prerequisites: upper-division standing."}
{"code": "ANSC 150", "title": "Culture and Mental Health", "units": "4", "anchor": "ansc150", "description": "(Cross-listed with GLBH 150.) This course reviews mental health cross-culturally and transnationally. Issues examined are cultural shaping of the interpretation, experience, symptoms, treatment, course, and recovery of mental illness. World Health Organization findings of better outcome in non-European and North American countries are explored. Students may not receive credit for GLBH 150 and ANSC 150. Prerequisites: upper-division standing."}
{"code": "ANSC 151", "title": "US-Mexico Border Ethnographies", "units": "4", "anchor": "ansc151", "description": "This course examines ethnographies of the US-Mexican borderlands to understand how the binational relationship shapes social life on both sides of the border. Topics discussed will include the maquiladora industry, drug trafficking, militarization, migration, tourism, missionary work, femicide, and prostitution. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANSC 153", "title": "War in Lived Experience", "units": "4", "anchor": "ansc153", "description": "Violence seems ubiquitous in our world, whether it results from natural disasters, wars, accidents, or interpersonal conflict. Experts agree that violence does not simply disappear after the fact, but it stays for a long time. In this course, we will explore militarism, war, and empire, and look at what anthropologists call “structural violence.” Prerequisites: upper-division standing."}
{"code": "ANSC 154", "title": "Gender and Religion", "units": "4", "anchor": "ansc154", "description": "This course explores the intersections of religion and gender. Focusing on modern Islam, Christianity, and Judaism, we will address such questions as: How and why are gender and sexuality significant in the context of religious beliefs and practices? Why do religions place so much emphasis on defining proper gender roles for women and men? How do nonheterosexual people of faith grapple with religious ideologies that reject LGBTQ ways of life? Prerequisites: upper-division standing."}
{"code": "ANSC 155", "title": "Humanitarian Aid: What Is It Good For?", "units": "4", "anchor": "ansc155", "description": "This course examines the intended and unintended consequences of humanitarian aid. How do organizations negotiate principles of equality with the reality of limited resources? What role does medicine play in aid efforts? In spaces where multiple vulnerabilities coexist, how do we decide whom we should help first? While the need for aid, charity, and giving in the face of suffering is often taken as a commonsensical good, this course reveals the complexities underpinning humanitarian aid. Prerequisites: ANTH 101, ANSC 123, ANSC 148, and upper-division standing.", "prereqs": {"type": "all", "courses": ["ANTH 101", "ANSC 123", "ANSC 148"]}}
{"code": "ANSC 156", "title": "Mad Films: Cultural Studies of Mental Illness in Cinema", "units": "4", "anchor": "ansc156", "description": "This course examines historical and cultural dimensions of madness as depicted in iconic and popular films such as “One Flew Over the Cuckoo’s Nest,” “Girl Interrupted,” “Silver Linings Playbook,” along with ethnographic and artistic films that utilize anthropological approaches. Prerequisites: upper-division standing."}
{"code": "ANSC 159", "title": "The Anthropology of Marriage", "units": "4", "anchor": "ansc159", "description": "What can we learn by looking at a society’s ideas about marriage, intimate relationships, and family? Why do these “private” institutions draw so much public scrutiny and debate? How are they linked to concepts of national progress, individualism, religion, status, or morality? We will explore these questions in Western and non-Western contexts through such topics as polygamy, same-sex marriage, transnational marriage, and the global impact of Western ideas of love and companionate marriage. Prerequisites: upper-division standing."}
{"code": "ANSC 160", "title": "Nature, Culture, and Environmentalism", "units": "4", "anchor": "ansc160", "description": "Course examines theories concerning the relation of nature and culture. Particular attention is paid to explanations of differing ways cultures conceptualize nature. Along with examples from non-Western societies, the course examines the Western environmental ideas embedded in contemporary environmentalism. Prerequisites: upper-division standing."}
{"code": "ANSC 162", "title": "Language, Identity, and Community", "units": "4", "anchor": "ansc162", "description": "This course examines the use of language difference in negotiating identity in bilingual and bidialectal communities, and in structuring interethnic relations. It addresses social tensions around language variation and the social significance of language choices in several societies. Prerequisites: upper-division standing."}
{"code": "ANSC 164", "title": "Introduction to Medical Anthropology", "units": "4", "anchor": "ansc164", "description": "Basic concepts and theory of medical anthropology are introduced and applied to comparison of medical systems including indigenous and biomedical, taking into account cross-cultural variation in causal explanation, diagnosis, perception, management, and treatment of illness and disease. Prerequisites: upper-division standing."}
{"code": "ANSC 165", "title": "Contemporary South Asia", "units": "4", "anchor": "ansc165", "description": "This course explores contemporary cultural life in South Asia by examining selected works of literature, film, and ethnography. Prerequisites: upper-division standing."}
{"code": "ANSC 166", "title": "Film and Culture in Asia", "units": "4", "anchor": "ansc166", "description": "Explores films from China, India, Japan and other Asian countries. Popular, documentary, and ethnographic films are examined for what they reveal about family life, gender, politics, religion, social change and everyday experience in South Asia. Prerequisites: upper-division standing."}
{"code": "ANSC 169", "title": "Culture and Environment: Research Seminar and Practicum", "units": "4", "anchor": "ansc169", "description": "Examines the role of culture in the way people perceive and interact with the natural environment. Combines reading of select anthropological studies with training in ethnographic research methods. Students develop a research project and analyze data. Limit: fifteen students. Prerequisites: upper-division standing or consent of instructor."}
{"code": "ANSC 171", "title": "Multimodal Methods in Ethnography", "units": "4", "anchor": "ansc171", "description": "Examines methods for employing iconic recording techniques into ethnographic field research, with an emphasis on digital audio and video recording technologies and analysis. Prerequisites: upper-division standing."}
{"code": "ANSC 173", "title": "Ethnography in Practice", "units": "4", "anchor": "ansc173", "description": "This practicum course will explore anthropology’s traditional methodology, ethnography, through texts, films, and literature, and give students practical experience through a quarter-long case study. Prerequisites: upper-division standing."}
{"code": "ANSC 175", "title": "Money, Work, and Nature: The Anthropology of Capitalism", "units": "4", "anchor": "ansc175", "description": "This course considers together the economic, political, social, and cultural dimensions of capitalist relations on the planet. Focuses on the current trajectory of capitalism, especially its changing margins and centers. Emphasizes new research on money, paid and unpaid work, and the material concerns of water, energy, food, and shelter. Prerequisites: upper-division standing."}
{"code": "ANSC 177", "title": "Step Into Anthrohistory: The Past and Its Hold on the Future", "units": "4", "anchor": "ansc177", "description": "Course aims to explore the ways in which historicity can be turned to a critical field of inquiry and reflection. Shows how the past isn’t something that “has happened,” but that actively lingers and invades the present, both inviting and constraining possible futures. Challenges the assumptions and practices of each modern discipline, affecting key concepts, methods, modes of analysis, and narrative forms that both anthropologists and historians have used. Prerequisites: upper-division standing."}
{"code": "ANSC 178", "title": "Brain, Mind, Culture, and History", "units": "4", "anchor": "ansc178", "description": "Students will learn firsthand a new transdisciplinary effort to understand the intersection of individual and society at all levels of analysis. This course introduces students to a remarkable convergence led by transdisciplinary scholars at UC San Diego (anthropology, cognitive science, psychology, history, philosophy, the arts, etc.), based on the recognition that individual neurological, cognitive, emotional, and behavioral capacities are reciprocally related to aggregate social, cultural, and historical processes. Prerequisites: upper-division standing."}
{"code": "ANSC 180", "title": "Capitalism and Gender", "units": "4", "anchor": "ansc180", "description": "Drawing insight from anti-colonial and queer of color critique, this course critically examines the demands capitalism makes on us to perform gender, and how that relates to processes of exploitation and racialization. We will explore alternatives and develop strategies for navigating jobs in this system. Students may receive credit for one of the following: CGS 120, CGS 180 and ANSC 180. CGS 120 is renumbered from CGS 180. Prerequisites: upper-division standing."}
{"code": "ANSC 181", "title": "Animal Affairs", "units": "4", "anchor": "ansc181", "description": "We humans are animals. How do our relations with other animals—how we rely on them, how we struggle against them, how we live among them—shape our own worlds? In this course, we examine, through ethnography and speculative fiction, the boundary between human and other animals. Prerequisites: upper-division standing."}
{"code": "ANSC 182", "title": "Gun Violence as Social Pathology", "units": "4", "anchor": "ansc182", "description": "In this seminar, we investigate gun violence from a critical perspective that draws on social and health sciences, films, media, and more. While we take the contemporary issue of gun violence in the United States as a primary case study, we employ a global and comparative perspective. We explore controversies to include cultural, gendered, ethnic, political, and economic analysis. We examine discourses on gun violence as rational/irrational, healthy/pathological, and individually or socially produced. Prerequisites: upper-division standing."}
{"code": "ANSC 183", "title": "Visualizing the Human: Film, Photography, and Digital Technologies", "units": "4", "anchor": "ansc183", "description": "Explores the role of film, photography, digital media, and visualization technologies in understanding human life. Students develop their own visualization projects. Prerequisites: upper-division standing."}
{"code": "ANSC 184", "title": "Food, Culture, and Society", "units": "4", "anchor": "ansc184", "description": "This seminar addresses the production, consumption, and distribution of food, with particular emphasis on the culture of food. Food studies provide insight into a wide range of topics including class, poverty, hunger, ethnicity, nationalism, capitalism, gender, race, and sexuality. Prerequisites: upper-division standing."}
{"code": "ANSC 185", "title": "#BlackLivesMatter", "units": "4", "anchor": "ansc185", "description": "(Cross-listed with AAS 185.) This seminar traces the historical roots and growth of the Black Lives Matter social movement in the United States and comparative global contexts. Occupy Wall Street, protests against the prison industrial complex, black feminist, and LGBTQ intersectionality are explored in the context of millennial and postmillennial youth as the founders of this movement. Students may not receive credit for ANSC 185 and AAS 185. Prerequisites: upper-division standing."}
{"code": "ANSC 186", "title": "Gender and Incarceration", "units": "4", "anchor": "ansc186", "description": "(Cross-listed with CGS 118.) This course investigates the ways in which forces of racism, gendered violence, and state control intersect in the penal system. The prison-industrial complex is analyzed as a site where certain types of gendered and racialized bodies are incapacitated, neglected, or made to die. Students may not receive credit for ANSC 186 and CGS 118. Prerequisites: upper-division standing."}
{"code": "ANSC 187", "title": "Anthropology of Mental Health in Israel and the Diaspora", "units": "4", "anchor": "ansc187", "description": "Like other modern nation-states, mental health in Israel is constituted by therapeutic interventions that assume that psychiatry, psychotherapy, and social work are the “taken for granted” ways to treat mental disorders. Drawing upon diverse ethnographies and using the tools of medical anthropology and psychological anthropology, we will examine the role and work of these experts and analyze how their expertise is contested by diverse groups. Prerequisites: upper-division standing."}
{"code": "ANSC 188", "title": "Cultures of Healing", "units": "4", "anchor": "ansc188", "description": "This course looks at how illness, health, and healing are understood and experienced in contexts where they are not defined merely as physiological problems, but are seen as having important spiritual, aesthetic, and sociopolitical dimensions. We will look at the role of traditional healers, such as shamans; how cultures vary in what they consider to be the forces that lead to illness; what forms illness takes; and how we evaluate the effectiveness of healing practices. Prerequisites: upper-division standing."}
{"code": "ANSC 190", "title": "Yoga Practices: From Banaras to Beverly Hills", "units": "4", "anchor": "ansc190", "description": "Yoga practices have recently gained dizzying popularity in the U.S. But how has yoga changed and transformed over time? How might we contextualize yoga practices in India and globally? This course is divided into two parts. First, we will do a close reading of philosophical texts about yoga, such as The Yoga Sutras of Patanjali. Second, we will examine yoga practices, including processes of commodification and popularization of yoga in the West. Prerequisites: upper-division standing."}
{"code": "ANSC 190GS", "title": "Medicine and Healing in South Asia", "units": "4", "anchor": "ansc190GS", "description": "This course introduces students to the medical anthropology of South Asia. This course will be divided into two parts. First, we will analyze how religious, cultural, political, and economic structures impact health and well-being. Second, we will look at ethnomedicine, that is, how local systems of healing provide alternative ideas of illness and health. Program or materials fees may apply. Prerequisites: ANSC 101, ANSC 121, ANSC 155, ANSC 173, ANTH 103, ANSC 146, ANSC 147, ANSC 148, or ANSC 164, department approval required, and upper-division standing. Students must apply for and be accepted to the Global Seminar program.", "prereqs": {"type": "one", "courses": ["ANSC 101", "ANSC 121", "ANSC 155", "ANSC 173", "ANTH 103", "ANSC 146", "ANSC 147", "ANSC 148", "ANSC 164"]}}
{"code": "ANSC 191", "title": "Narrative and Subjectivity", "units": "4", "anchor": "ansc191", "description": "A recurrent theme in the study of subjectivity has been the subject’s capacity to posit herself as such in language. This course explores both individual and collective subjectivity as emergent in a range of contextually grounded narrative practices: in news and novels, ritual verse and everyday chit-chat, songs, and cartoons. The course includes a workshop component where students will be encouraged to present material from their own research projects. Prerequisites: upper-division standing."}
{"code": "ANSC 191GS", "title": "Everyday Life in South Asia: Beyond the Clichés", "units": "4", "anchor": "ansc191GS", "description": "Popular representations of South Asia abound in clichés: poverty and luxury, cities and hamlets, ascetics and call centers. What do these clichés do to our understanding of South Asia? How do we get beneath or beyond these representations? We will respond to these questions by exploring how people in South Asia live on a day-to-day basis, while also attending to how major historical events, such as colonialism and the Partition of India and Pakistan, shape contemporary life and politics. Program or materials fees may apply. Prerequisites: ANSC 121, ANSC 148, ANSC 155, ANSC 164, ANTH 1, ANTH 21, ANTH 23, or ANTH 103, department approval required, and upper-division standing. Students must apply for and be accepted to the Global Seminar program.", "prereqs": {"type": "one", "courses": ["ANSC 121", "ANSC 148", "ANSC 155", "ANSC 164", "ANTH 1", "ANTH 21", "ANTH 23", "ANTH 103"]}}
{"code": "ANSC 192", "title": "Liberation Bound: Struggles Against Capitalism and Imperialism Worldwide", "units": "4", "anchor": "ansc192", "description": "Using a variety of sources, this course surveys the varied efforts by people acting in contexts worldwide to overcome capitalist relations and imperial systems and construct new ways of organizing life on the planet. Prerequisites: upper-division standing."}
{"code": "ANSC 192A", "title": "US Empire: What Is It?", "units": "4", "anchor": "ansc192a", "description": "This course examines the way that the United States became a world power during the twentieth century and up to the present. It addresses the question of whether this nation-state can be understood as an imperial power in the same way as other colonial empires. The course focuses on the economic, political, sociocultural, and ecological dimensions of United States’ world-power status. Prerequisites: upper-division standing."}
{"code": "ANSC 192GS", "title": "Rethinking Poverty and Development", "units": "4", "anchor": "ansc192GS", "description": "Why are so many people poor? What does poverty mean for those who live it and for those who try to help them? This course examines the field of international development, to understand the discourses and practices that governments, aid agencies, and communities have tried. To what extent are these practices linked to colonial legacies, race, and class? Looking to new innovations in participatory and compassionate development, this will prepare students for critical engagement with development. Program or materials fees may apply. Prerequisites: department approval required and upper-division standing. Students must apply for and be accepted to the Global Seminar program."}
{"code": "ANSC 193", "title": "Capitalism and Nature", "units": "4", "anchor": "ansc193", "description": "This course explores the way that “capitalism,” understood as a combined economic, political, and cultural system, shapes features of the world that typically have been understood as “natural.” The course considers how these categorical distinctions affect our understandings of contemporary life and our chances to change it. Prerequisites: upper-division standing."}
{"code": "ANSC 193GS", "title": "Human Rights and Environmental Justice", "units": "4", "anchor": "ansc193gs", "description": "In this course, we will examine the dominant human rights framework to think about one issue that has escaped its purview: environmental justice. If we all share a common planet, is there a universal right to a clean environment? Why are the effects of pollution and climate change unequally distributed among the world’s peoples? Can human rights norms serve as effective tools to fight the unequal effects of climate change and contamination? Program or materials fees may apply. Prerequisites: department approval required and upper-division standing. Students must apply for and be accepted to the Global Seminar program."}
{"code": "ANSC 194", "title": "Language, Migration, Borders", "units": "4", "anchor": "ansc194", "description": "This course uses the study of language to unpack contemporary processes of human mobility across geopolitical borders. We will explore both the role of language in shaping movement and the politics of language that arise from and around these movements. Migrations to the United States will be a core theme, though we will also work to put them in comparative perspective. Ultimately, our aim will be to critically rethink all three of the title terms—language, migration, and borders—in tandem. Prerequisites: upper-division standing."}
{"code": "ANSC 196", "title": "Human Rights Advocacy Seminar", "units": "4", "anchor": "ansc196", "description": "Every year thousands of scholars and students are imprisoned by oppressive regimes across the world. This course provides students with the opportunity to work as a team to provide advocacy for one such person. We will pick one person in prison and gather information about them and design a strategy to draw attention to their case, including contacting public officials and media. Prerequisites: upper-division standing."}
{"code": "ANTH 200", "title": "Special Topics in Anthropology Graduate Studies", "units": "4", "anchor": "anth200", "description": "Course will vary in title and content. When offered, the current description and title is found in the current Schedule of Classes and the Anthropology department website. (Can be taken a total of four times as topics vary.) Prerequisites: graduate standing."}
{"code": "ANTH 201", "title": "Special Topics in Anthropological Archaeology", "units": "4", "anchor": "anth201", "description": "Course usually taught by visiting faculty in anthropological archaeology. Course will vary in title and content. When offered, the current description and title is found in the current Schedule of Classes on TritonLink, and the Department of Anthropology website. (Can be taken a total of four times as topics vary.) Prerequisites: graduate standing."}
{"code": "ANTH 202", "title": "Olmec and Maya Archaeology", "units": "4", "anchor": "anth202", "description": "Course examines the birth of Olmec and Maya civilizations in the Formative period, the rise of city states during the Early Classic, the decline of the Classic Maya, and the resurgence of the Postclassic period. Prerequisites: graduate standing."}
{"code": "ANTH 203", "title": "Introduction to Anthropogeny", "units": "4", "anchor": "anth203", "description": "The course specifically addresses a variety of general theories for explaining modern human origins and introduces graduate students participating in the anthropogeny specialization, as well as other interested graduate students, to the key questions motivating ongoing research into human origins. Prerequisites: graduate standing."}
{"code": "ANTH 204", "title": "Contemporary Anthropology", "units": "4", "anchor": "anth204", "description": "This course, intended for first-year anthropology graduate students, examines the contemporary practice of anthropology. We discuss the construction of a multiple-year research project including how to differentiate theory and evidence, the contours of anthropological interest, the question of audience, and rhetorical style. We analyze nine recent ethnographies as possible models for our own practice. Prerequisites: graduate standing."}
{"code": "ANTH 205", "title": "Postcolonial and Decolonial Anthropology", "units": "4", "anchor": "anth205", "description": "This course builds upon the question can authentic anthropology emerge from the critical intellectual traditions and counter-hegemonic struggles of Third World peoples? (Harrison 1991:1). We will analyze the rise of postcolonial and decolonial approaches across the four fields of the discipline over the past decade. In turn, we will analyze the ways a lack of attention to decolonial anthropology functions to reiterate hierarchies and oppressive systems of knowledge production. Prerequisites: graduate standing."}
{"code": "ANTH 206", "title": "Race, Ethnicity, and Citizenship", "units": "4", "anchor": "anth206", "description": "This graduate seminar examines how racial and ethnic categories are constructed, how contemporary societies manage difference through multicultural policies, and how discourses and institutions of citizenship can act as sites of contestation over inclusion and exclusion. Prerequisites: graduate standing."}
{"code": "ANTH 207", "title": "Eastern Mediterranean Archaeology—New Perspectives", "units": "4", "anchor": "anth207", "description": "This graduate seminar examines the archaeology of the eastern Mediterranean world from the Neolithic through Ottoman times. The seminar is thematically organized examining current methods and theories that apply to state-of-the-art research in one of the “foundational” culture-historical regions in the world. Topics may include archaeometry, archaeometallurgy, colonization, dating methods, settlement patterns and survey methodology, paleoclimate reconstruction, and geoarchaeology. Students may not receive credit for HIGR 234 and ANTH 207. Prerequisites: graduate standing."}
{"code": "ANTH 209", "title": "Archaeology’s Role in Building National Narrative: Israel as a Case Study", "units": "4", "anchor": "anth209", "description": "Archaeology played a major role in the early days of the newly founded state of Israel, with many projects aimed at finding evidence for past Jewish presence in the land. Archaeological excavations, some on a national scale, were part of the creation of a new national narrative—and some would argue that this role still exists today. This class will explore the connection between archaeology and modern history in the contentious land of Israel. Prerequisites: graduate standing."}
{"code": "ANTH 211", "title": "Capitalism and Science", "units": "4", "anchor": "anth211", "description": "This advanced graduate seminar examines the relationship between scientific knowledge production and the development of capitalist relations on the planet. The course examines the historical content of the two concepts in specific contexts. Rather than assume a cause and effect relationship, the seminar seeks to clarify understandings of what constitutes “science,” “capitalism,” and their relationship. Prerequisites: graduate standing."}
{"code": "ANTH 212", "title": "Advanced Topics in Biological Anthropology", "units": "4", "anchor": "anth212", "description": "A critical exploration of timely and/or controversial topics in biological anthropology. Course will vary in title and content. Prerequisites: graduate standing."}
{"code": "ANTH 213", "title": "Anthropology and Mental Health", "units": "4", "anchor": "anth213", "description": "This seminar examines intersection of anthropology and psychiatry. Topics include cultural conceptions and social determinants of anxiety, depression, trauma, and psychosis, corporeal experience and manifestation of illness, transnational variation in course and outcome, global circulation of psychiatric knowledge/practice and pharmaceuticals. Prerequisites: graduate standing."}
{"code": "ANTH 215", "title": "Advanced Topics in Sociocultural Anthropology", "units": "4", "anchor": "anth215", "description": "A critical exploration of timely and/or controversial topics in sociocultural anthropology. Course will vary in title and content. Prerequisites: graduate standing."}
{"code": "ANTH 219", "title": "Seminar in Political Anthropology", "units": "4", "anchor": "anth219", "description": "The focus here is “politics,” broadly constructed, in various societies. Analysis is from the perspective of the recourses deployed by all involved, including but not limited to power, with emphasis on the role of culture and social structure. Prerequisites: graduate standing. (Formerly known as ANGR 219.)"}
{"code": "ANTH 220", "title": "The Human Body in Discourse and Experience", "units": "4", "anchor": "anth220", "description": "This is an interdisciplinary seminar examining the place of the body and embodiment in contemporary culture and culture theory. Prerequisites: graduate standing."}
{"code": "ANTH 221", "title": "Phenomenology of Perception", "units": "4", "anchor": "anth221", "description": "This seminar will focus on a close and intensive reading of Maurice Merleau-Ponty’s masterwork, The Phenomenology of Perception. Emphasis will be placed on the relevance of this work for theory, method, and practice in the social sciences. Prerequisites: graduate standing."}
{"code": "ANTH 222", "title": "Anthropological Studies of Subjectivity", "units": "4", "anchor": "anth222", "description": "The study of subjectivity has emerged as an anthropological focal point for theorizing the interconnections among culture, experience, and power. This seminar explores the shaping of the lived experience and structures of knowledge that reciprocally produce forms of subjectivity. Prerequisites: graduate standing."}
{"code": "ANTH 223", "title": "Anthropological Interviewing", "units": "4", "anchor": "anth223", "description": "The course teaches techniques of long-term, intensive interviewing in fieldwork settings with an emphasis on psychodynamic inference and its usefulness in different cultural settings. Prerequisites: graduate standing. (Formerly known as ANGR 223.)"}
{"code": "ANTH 224", "title": "The Anthropology of Gender and Sexuality", "units": "4", "anchor": "anth224", "description": "A critical analysis of ethnographic and theoretical texts focusing on the sociocultural study of gender. We will also draw on studies of gender and feminist theory from other disciplines (e.g., history, philosophy) to illuminate issues relevant to anthropology. Prerequisites: graduate standing or consent of instructor."}
{"code": "ANTH 226", "title": "Ethnography of Christianity", "units": "4", "anchor": "anth226", "description": "Directed to graduate students planning ethnographic work in Christian societies, this course explores variations in the interpretation and expression of Christianity using historical and ethnographic sources. Prerequisites: graduate standing or consent of instructor. (Formerly known as ANGR 226.)"}
{"code": "ANTH 227", "title": "Living in an Emotional World", "units": "4", "anchor": "anth227", "description": "This course examines the relationship between culture and emotions. It thinks about emotions as sources of knowledge, but also historicizes the delegitimization of emotions in social science and other disciplines. Each week, we will explore one emotion, including anger, shame, and hope. Prerequisites: graduate standing."}
{"code": "ANTH 228", "title": "Partners Not Subjects: Community-Engaged Research for Anthropologists", "units": "4", "anchor": "anth228", "description": "Over the past decade community-based participatory research (CBPR) methods have gained traction in fields like anthropology, global health, and community development. Moreover, academic-community partnerships are key to improving health outcomes for vulnerable populations. In this graduate seminar, we will explore the history of colonialism in research practice and contrast it with emerging culturally sustainable methods where community members are treated like partners, and not subjects. Prerequisites: graduate standing."}
{"code": "ANTH 229", "title": "Religion and Healing", "units": "4", "anchor": "anth229", "description": "This seminar is an in-depth analysis of cultural meaning, personal experience, and therapeutic process in ritual healing, emphasizing performative/persuasive aspects of the relation between religion and health in comparative, cross-cultural perspective. Prerequisites: graduate standing."}
{"code": "ANTH 230", "title": "Department Colloquium", "units": "1", "anchor": "anth230", "description": "A forum to present work by faculty, students, and guests. Course will be offered quarterly. Prerequisites: graduate standing. (S/U grades only.) (Formerly known as ANGR 230.)"}
{"code": "ANTH 231", "title": "Maritime Archaeology in the Eastern Mediterranean—New Perspectives on Climate, Environmental, and Cultural Change", "units": "4", "anchor": "anth231", "description": "New discoveries, methods, and theories concerning maritime archaeology in the eastern Mediterranean provide an important data source for studying the evolution of human culture from the emergence of anatomically modern humans to the development of ancient civilizations. This course focuses on reviewing the archaeological and environmental data from Greece, Cyprus, Israel, and the neighboring lands related to these issues. Prerequisites: graduate standing."}
{"code": "ANTH 232", "title": "Labor and Semiotics", "units": "4", "anchor": "anth232", "description": "Indexing a social identity is an achievement; it takes work. But what kind? This course examines Peircean semiotics as a theory of labor, putting it into conversation with traditional Marxist and practice-based conceptualizations of labor. Prerequisites: graduate standing."}
{"code": "ANTH 233", "title": "Critical Studies of Capitalism", "units": "4", "anchor": "anth233", "description": "This seminar takes up Marx’s varied critiques of capitalist forms, categories, doctrines, practices, and tendencies and brings them to bear on contemporary conditions. In particular, the seminar examines what may be understood as Marx’s ontology, epistemology, and ethico-political stance. Prerequisites: graduate standing."}
{"code": "ANTH 235", "title": "Theories of Social Justice", "units": "4", "anchor": "anth235", "description": "This graduate seminar will attend to the theory and praxis of social justice. Social justice is primarily concerned with the ways in which wealth and privileges are distributed in society. This course explores the ideologies and logics of wealth distribution at various points in history and in different places across the globe. The ways in which we understand basic human needs and the distribution of entitlements are also critical components of theories of social justice. Prerequisites: graduate standing."}
{"code": "ANTH 237", "title": "Native American Health and Healing", "units": "4", "anchor": "anth237", "description": "This course examines fact and fiction with respect to epidemics of contagious diseases including smallpox and tuberculosis, alcohol and drug dependency, diabetes and obesity, depression and suicide. We analyze health care with respect to the history and development of the Indian Health Service, health care efforts by Christian missionaries, tribal-led health initiatives, indigenous spiritual healing and collaborations between indigenous healers and biomedical professionals. Students may not receive credit for ANTH 237 and GLBH 245. ANTH 237/GLBH 245 may be coscheduled with ANSC 139/GLBH 139. Prerequisites: graduate standing."}
{"code": "ANTH 238", "title": "Immigrant and Refugee Health", "units": "4", "anchor": "anth238", "description": "Examines physical and mental health sequelae of internal and transnational movement of individuals and populations due to warfare, political violence, natural disaster, religious persecution, poverty and struggle for economic survival, and social suffering of communities abandoned by migrants and refugees. May be coscheduled with ANSC 144. Students will not receive credit for both ANTH 238 and GLBH 244. Prerequisites: graduate standing."}
{"code": "ANTH 239", "title": "Contemporary Religious Movements", "units": "4", "anchor": "anth239", "description": "Recent decades have witnessed the dramatic rise of religious movements worldwide, posing challenges to secular models of modernity. We will study the sociocultural and political implications of this phenomenon comparatively, focusing especially on new forms of Islamic and Christian practice. Prerequisites: graduate standing."}
{"code": "ANTH 241", "title": "Linguistic Anthropology Workshop", "units": "4", "anchor": "anth241", "description": "A forum for presenting and discussing linguistic anthropological research in progress and new work in the field. Forum will present work by faculty, guests, and students. It will be offered quarterly. The course may be repeated with instructor’s permission. Prerequisites: graduate standing."}
{"code": "ANTH 242", "title": "Anthropology of Latin America", "units": "4", "anchor": "anth242", "description": "This course will examine the overarching legacies of colonialism, the persistence of indigenous peoples and cultures, the importance of class and land reform, the effects of neoliberalism, and citizens’ efforts to promote social change in contemporary democracies. Prerequisites: graduate standing."}
{"code": "ANTH 243", "title": "Mental Health as Global Health Priority", "units": "4", "anchor": "anth243", "description": "Why is mental health a global concern? This anthropological course reviews globalization, culture, and mental health. We examine issues of social suffering, stigma, and economic burden associated with mental illness, gender inequality, political violence, “global security,” pharmaceutical and illegal drugs. Prerequisites: graduate standing."}
{"code": "ANTH 244", "title": "Andean Prehistory: Origins of Chiefdoms and States", "units": "4", "anchor": "anth244", "description": "This seminar examines the prehistory of the Andean region from the peopling of the New World through the formation of Archaic, Preceramic, and Initial periods; the Chavin Horizon; and the Nasca and Moche States of the Early Intermediate Period. Prerequisites: graduate standing. "}
{"code": "ANTH 245", "title": "The Middle Horizon", "units": "4", "anchor": "anth245", "description": "This seminar compares the distinct urban and expansive state phenomena of the highland Wari and Tiwanaku cultures (AD 500–1000) with emphasis on their formative origins and the ideological, agrarian, and technological foundations of Middle Horizon political development. Prerequisites: graduate standing."}
{"code": "ANTH 246", "title": "The Inca and the Late Horizon", "units": "4", "anchor": "anth246", "description": "This seminar considers the ethnohistory, ethnography, and archaeology of the Inca Empire Tawantinsuyu, with emphasis on the economic, social, and ideological foundations of the Cusco Inca state and the dynamics of Inca imperial expansion throughout Andean South America. Prerequisites: graduate standing."}
{"code": "ANTH 247", "title": "Multimodal Interaction", "units": "4", "anchor": "anth247", "description": "Human society evolved in the context of face-to-face interaction. The course will examine methods and theoretical approaches to different modalities of interaction—especially speech, gesture, and gaze—their mutual integration, and their relevance to ethnography. Prerequisites: graduate standing in anthropology or consent of instructor."}
{"code": "ANTH 248", "title": "Global Health and Cultural Diversity", "units": "4", "anchor": "anth248", "description": "This seminar investigates global health from the perspective of medical anthropology on disease and illness; cultural conceptions of health; doctor-patient interaction; illness experience; medical science and technology; mental health; infectious disease; and health-care inequalities by ethnicity, gender, and socioeconomic status. Prerequisites: graduate standing."}
{"code": "ANTH 249", "title": "Gender and Mental Health", "units": "4", "anchor": "anth249", "description": "This course examines gender and mental health by considering social, cultural, and biological explanations for problems such as depression, trauma, anxiety, drugs/alcohol use. Cross-cultural similarities and differences of gender are considered with respect to etiology, epidemiology, symptomatology, treatment, and recovery. Prerequisites: graduate standing."}
{"code": "ANTH 250", "title": "The Anthropology of Human Rights", "units": "4", "anchor": "anth250", "description": "This graduate seminar will explore the theories and critiques of the contemporary human rights framework, through history and ethnography. Prerequisites: graduate standing."}
{"code": "ANTH 251", "title": "The Ethnography of Modernity", "units": "4", "anchor": "anth251", "description": "How is the idea of modernity experienced in diverse cultural and historical settings? This seminar focuses on ethnographic representations of modernity, exploring such topics as globalization, mass media, consumerism, gender and modernity, modern religious movements, and theories of modernity. Prerequisites: graduate standing or consent of instructor. "}
{"code": "ANTH 253", "title": "Who Cares? Sympathy and the Conduct of Liberalism", "units": "4", "anchor": "anth253", "description": "This course pulls on classical Western social theory as well as recent ethnographies to examine the role of sympathetic engagement in liberal governance. We also interrogate the role anthropology has played as liberalism’s witness in this regard. Prerequisites: graduate standing."}
{"code": "ANTH 254", "title": "Dissertation Practicum", "units": "4", "anchor": "anth254", "description": "Students writing their dissertations present work-in-progress and receive structured peer and mentor feedback. Supervising or coparticipating faculty lead workshops about doctoral completion, publication, and other professionalization processes. S/U grades only. May be taken for credit six times. Prerequisites: graduate standing."}
{"code": "ANTH 256", "title": "Seminar on Brain Evolution", "units": "4", "anchor": "anth256", "description": "We will review the neural basis of cognition in humans and other primates. Neurobiological findings will be related to contributions from various subfields of anthropology. Brain/mind associations will be explored in the context of hominid evolution. Prerequisites: graduate student in anthropology or consent of instructor. (Formerly known as ANGR 256.)"}
{"code": "ANTH 257", "title": "Mind, Self, and Identity", "units": "4", "anchor": "anth257", "description": "This seminar critically examines social, cultural, and psychological theories of the person, and their relationship to conceptions of the person found in moral political and religious discourses. It explores the role of concepts of the person in ethnographic research. Formerly known as ANGR 257. Prerequisites: graduate standing in anthropology."}
{"code": "ANTH 258", "title": "Analytical Methods in Archaeology", "units": "4", "anchor": "anth258", "description": "Specialized scientific techniques are increasingly important to archaeology. This seminar examines chronometric date techniques, site-formation processes, and geoarchaeology and pedology, chemical analyses of soils, zooarchaeology, paleoethnobotany, and how land-use strategies can be inferred from archaeological remains. Prerequisites: graduate standing. (Formerly known as ANGR 258.)"}
{"code": "ANTH 259", "title": "Gender and Mental Health", "units": "4", "anchor": "anth259", "description": "This seminar in psychological/psychiatric anthropology takes a comparative approach to the study of gender and mental health. Culture and feminist theory is employed to address questions of gender in relation to various problems, such as depression, anxiety, and eating disorders. Prerequisites: graduate standing."}
{"code": "ANTH 260", "title": "Seminar in Medical and Psychological Anthropology", "units": "4", "anchor": "anth260", "description": "This seminar examines medical, psychological, and psychiatric anthropology through reading, discussion, and presentation of work 1) essential to the development of and 2) exemplifying the state of the art in these related fields. May be taken for credit up to two times. Prerequisites: graduate standing."}
{"code": "ANTH 261", "title": "Audio and Video Methods in Ethnography", "units": "4", "anchor": "anth261", "description": "A seminar exploration, both theoretical and practical, of iconic recording tools in ethnography, focusing on graphic images, photography, and audio and video recording in both natural and semiexperimental settings, with special critical attention to epistemological and theoretical bases of ethnographic representations. Prerequisites: graduate standing in Anthropology (AN 75, AN 77) or consent of instructor."}
{"code": "ANTH 262", "title": "Critical Anthropology Workshop", "units": "4", "anchor": "anth262", "description": "Anthropology has long analyzed the relations between culture, economics, and politics. This seminar will examine these issues through ethnographic and historical accounts, engaging contemporary theory and debates. S/U grades only. May be taken for credit ten times. Prerequisites: graduate standing."}
{"code": "ANTH 263", "title": "Beyond the Genome", "units": "4", "anchor": "anth263", "description": "This graduate seminar discusses recent publications on topics related to human evolution and health in modern and ancient populations, using data beyond traditional genetics, including the microbiome, various levels of epigenetic regulation (DNA and histone modifications, micro and noncoding RNAs), telomeres, hormonal influences on the genome (e.g., cortisol, oxytocin), and gender-biased selection in reproductive success under stressful environments. Prerequisites: graduate standing."}
{"code": "ANTH 264", "title": "Human Evolutionary Genetics", "units": "4", "anchor": "anth264", "description": "This course explores how genetic data can be used to address core issues in human evolution. We will reconstruct population history and explore sources of human genetic diversity, such as migration and selection, based on studies of modern and ancient DNA. Through critical evaluation of recent publications, we will discuss the molecular evidence for the origin of modern humans, race, reconstruction of key human migrations, interactions with the environment, and implications for disease. May be coscheduled with ANBI 134. Prerequisites: graduate standing."}
{"code": "ANTH 265", "title": "Marine and Coastal Archaeology: Israel and the Neighboring Lands", "units": "4", "anchor": "anth265", "description": "The seminar will follow recent advances and key discoveries in the coastal and maritime archaeology of Israel and the eastern Mediterranean from the Neolithic period to the end of the classical period. Topics include methodologies of underwater excavations and surveys, sunken Neolithic villages of the Carmel coast, archaeology and geoarchaeology of Canaanite and Phoenician harbors, shipwrecks of the eastern Mediterranean and maritime trade, the Anthropocene, sea level changes, and paleoclimate. Prerequisites: graduate standing."}
{"code": "ANTH 266", "title": "Anthropology of Love", "units": "4", "anchor": "anth266", "description": "This course interrogates the association of romantic love with modernity, egalitarianism, and choice. The focus is on how cultural political economy shapes desires and structures relationships. We consider how race, class, nation, gender, and sexuality reinforce or undermine status hierarchies. For example, we examine the concept of racial and transnational hypergamy, in which women, men, and trans people from lower status ethnic groups and developing countries “marry up.” Prerequisites: graduate standing."}
{"code": "ANTH 267", "title": "Decolonizing Ethnography: Ethics, Politics, and Praxis", "units": "4", "anchor": "anth267", "description": "Despite being foundational to the discipline of anthropology, ethnographic methods are often mystifying to graduate students. Students are expected to simply go into their respective field sites armed with a notebook, voice recorder, and hope. Drawing on feminist and decolonial epistemologies, we will examine, critique, and reconstruct ethnography’s dilemmas, changing forms, and ethical stakes as we understand it as a particular mode of writing and representation. Prerequisites: graduate standing."}
{"code": "ANTH 268", "title": "Introduction to Science Studies: Part I", "units": "4", "anchor": "anth268", "description": "Study and discussion of classic themes and texts in history of science, sociology of science, and philosophy of science, and of work that attempts to develop an interdisciplinary science studies approach. Students may receive credit for one of the following: ANTH 268, COGR 225A, HIGR 238, PHIL 209A, or SOCG 255A. Prerequisites: graduate standing."}
{"code": "ANTH 269", "title": "Introduction to Science Studies: Part II", "units": "4", "anchor": "anth269", "description": "Continuing the introduction developed in Part I, this course examines recent key topics and problem situations in science studies. Emphasis is on recent theoretical perspectives and empirical studies in communication, history, philosophy, and sociology of science and technology, and the interplay between them. Students may receive credit for one of the following: ANTH 269, COGR 225D, HIGR 241, PHIL 209D, or SOCG 255D. Prerequisites: graduate standing."}
{"code": "ANTH 270", "title": "The Archaeology of Climate Change—Social Adaptation and Vulnerability in Temporal Perspective", "units": "4", "anchor": "anth270", "description": "This seminar studies the dynamics of climate change and human responses through time. Topics include research methods in socioecodynamics, human responses to change in different sociopolitical and economic contexts, and lessons from the past that can inform the present. Students may not receive credit for ANTH 270 and SIOG 270. Prerequisites: graduate standing."}
{"code": "ANTH 271", "title": "Ethics and Survival Skills in Academia", "units": "2", "anchor": "anth271", "description": "Lectures, readings, and discussions about the responsible conduct and reporting of research, working with others in science, social responsibilities, and various career advancement skills. The course is designed as an option for meeting current federal regulations. Students may receive credit for one of the following: ANTH 271, COGS 241, PATH 241, NEU 241, or SOMI 241. Prerequisites: graduate standing."}
{"code": "ANTH 272", "title": "Seminar in Science Studies", "units": "4", "anchor": "anth272", "description": "Study and discussion of a selected topic in the science studies field with an emphasis on the development of research and writing skills. The topic varies from year to year. ANTH 272, COGR 225B, HIGR 239, PHIL 209B, and SOCG 255B may be repeated and taken for credit in any combination for a combined total of six times. Prerequisites: graduate standing."}
{"code": "ANTH 273", "title": "Colloquium in Science Studies", "units": "4", "anchor": "anth273", "description": "A forum for the presentation and discussion of research in progress in science studies by graduate students, faculty, and visitors. Students must attend the colloquium series for their entire first and second years. ANTH 273, COGR 225C, HIGR 240, PHIL 209C, and SOCG 255C may be repeated and taken for credit in any combination for a combined total of two times. Prerequisites: graduate standing."}
{"code": "ANTH 274", "title": "Debates in Anthropology", "units": "4", "anchor": "anth274", "description": "This seminar will review a series of current or recent significant debates in anthropology. The debates will be examined in the light of their substantive, theoretical, and epistemological implications, with some attention to the rhetorical elements of the arguments themselves. Prerequisites: graduate standing in anthropology. (Formerly known as ANGR 274.)"}
{"code": "ANTH 275", "title": "Paleoethnobotany", "units": "6", "anchor": "anth275", "description": "This course provides an introduction to the fundamentals of practicing archaeobotany. How do archaeobotanists identify ancient plant remains in sites, and how can we use this information to understand human subsistence and forestry regimes, animal feeding patterns, and climate change? Prerequisites: graduate standing in anthropology."}
{"code": "ANTH 276", "title": "Global Mental Health", "units": "4", "anchor": "anth276", "description": "(Cross-listed with GLBH 274.) This course will examine core topics in global mental health research and practice, including cross-cultural classification of mental illness, stigma, and intervention. It combines anthropological perspectives alongside cross-cultural psychiatry, epidemiology, humanities, and global public health. The course highlights mixed method approaches to research, intervention design, and evaluation. The seminar includes a combination of interactive lectures, discussion, and hands-on activities. Prerequisites: graduate standing."}
{"code": "ANTH 277", "title": "Critique of Value and the Value of Critique", "units": "4", "anchor": "anth277", "description": "This course explores the diverse ways that anthropologists and other scholars have developed “value” as a concept and category for defining their object of study. From price to ethic to meaning, and more, the term’s attractiveness seems to lie in its flexibility and inclusivity. These varied approaches to value each carry significant ontological, epistemological, and political implications, which we will critically examine. Prerequisites: graduate standing."}
{"code": "ANTH 278", "title": "Anthropological Methods", "units": "4", "anchor": "anth278", "description": "This course provides students with knowledge of the theoretical principles of qualitative and mixed-methods research and develops skills in the practical application of key methods used in anthropology. The focus will be on interviews, focus group discussions, and (participant) observation. The course will focus on the strategies and challenges of applying these research methods in international settings and provides guidance on fieldwork planning and implementation. Prerequisites: graduate standing"}
{"code": "ANTH 279", "title": "Special Topics in Language and Society", "units": "4", "anchor": "anth279", "description": "Selected topics in the anthropology of language, such as linguistic ideology, language and identity, multilingualism, discourse analysis. Topics will vary from year to year, and the course may be repeated with instructor’s permission. Prerequisites: graduate standing. (Formerly known as ANGR 279.)"}
{"code": "ANTH 280A", "title": "Core Seminar in Social Anthropology", "units": "4", "anchor": "anth280a", "description": "Core seminar focuses on individual action and social institutions. Prerequisites: graduate standing in anthropology or consent of instructor. (Formerly known as ANGR 280A.)"}
{"code": "ANTH 280B", "title": "Core Seminar in Cultural Anthropology", "units": "4", "anchor": "anth280b", "description": "Core seminar focuses on personal consciousness and cultural experience. Prerequisites: graduate standing in anthropology or consent of instructor. (Formerly known as ANGR 280B.)"}
{"code": "ANTH 280C", "title": "Core Seminar in Psychological Anthropology", "units": "4", "anchor": "anth280c", "description": "Core seminar focuses on motives, values, cognition, and qualities of personal experience. Prerequisites: graduate standing in anthropology or consent of instructor. (Formerly known as ANGR 280C.)"}
{"code": "ANTH 280D", "title": "Core Seminar in Anthropological Archaeology", "units": "4", "anchor": "anth280d", "description": "Seminar focuses on the development of archaeological theory. Required of archaeological and biological anthropology graduate students, sociocultural students may take this course to fulfill core distribution requirement. Prerequisites: graduate standing in anthropology or consent of instructor. (Formerly known as ANGR 280D.) "}
{"code": "ANTH 280E", "title": "Core Seminar in Biological Anthropology", "units": "4", "anchor": "anth280e", "description": "This seminar will examine the central problems and concepts of biological anthropology, laying the foundation for first-year graduate students in Biological Anthropology as well as providing an overview of the field for graduate students in other areas of anthropology. Prerequisites: graduate standing in anthropology or consent of instructor. (Formerly known as ANGR 280E.) "}
{"code": "ANTH 280F", "title": "Core Seminar in Linguistic Anthropology", "units": "4", "anchor": "anth280f", "description": "Examines the theoretical and methodological foundations and principal research questions of linguistic anthropology, providing the fundamentals for graduate study in this area. Required for students specializing in linguistic anthropology and open to other students. Course formerly numbered as ANTH 263. Students will not receive credit for both ANTH 263 and ANTH 280F. Prerequisites: graduate standing."}
{"code": "ANTH 281A", "title": "Proseminar", "units": "2", "anchor": "anth281a", "description": "These seminars are held during the first year of graduate study. Faculty members will present an account of their current research and interests. When appropriate, a short preliminary reading list will be given for the particular lecture. S/U grades only. Prerequisites: first-year graduate standing in anthropology."}
{"code": "ANTH 281B", "title": "Proseminar", "units": "2", "anchor": "anth281b", "description": "Continuation of seminars held in the first year of graduate study. Faculty members will present an account of their current research and interests. When appropriate, a short preliminary reading list will be given for the particular lecture. S/U grades only. Prerequisites: first-year graduate standing in anthropology."}
{"code": "ANTH 281C", "title": "Anthropology Proseminar", "units": "2", "anchor": "anth281c", "description": "Faculty members, visitors, or advanced students will present on current research or professionalization topics for anthropologists including study and research skills, preparation for the master of arts thesis project, teaching assistant training, field research, conference presentation, publication, or job search. When appropriate, short readings may be given for particular lectures. Prerequisites: first-year graduate standing in anthropology."}
{"code": "ANTH 283A", "title": "Fieldwork Seminar", "units": "4", "anchor": "anth283a", "description": "A seminar given to acquaint students with the techniques and problems of fieldwork. Students carry out ethnographic field research in a local community group under faculty supervision. Prerequisites: graduate standing or consent of instructor. (Formerly known as ANGR 283A.) "}
{"code": "ANTH 284", "title": "Master Writing Practicum", "units": "4", "anchor": "anth284", "description": "This workshop is designed for second year students writing their MA theses. It includes study of thesis and article writing styles, standards of documentation, and argumentation. Students will be expected to share their work with each other. Prerequisites: graduate standing."}
{"code": "ANTH 285", "title": "Grants Writing Practicum", "units": "4", "anchor": "anth285", "description": "This workshop is designed for third- and fourth-year students writing grant proposals for dissertation research. Students will learn grant writing, research methods, ethics, and budgets. Students will be expected to share their work with each other. Prerequisites: graduate standing."}
{"code": "ANTH 287", "title": "Ethnography Practicum", "units": "4", "anchor": "anth287", "description": "This course offers students a primer in ethnographic research. We examine all parts of the ethnographic process: from the concept work of project formulation and design to practical issues around the conduct of ethnographic research. This course is intended for graduate students at any stage of ethnographic research. Students may not receive credit for ANTH 287 and COGR 285 and ETHN 287. Prerequisites: graduate standing."}
{"code": "ANTH 288", "title": "Archaeology Practicum", "units": "12", "anchor": "anth288", "description": "Field and laboratory training for graduate students in archaeology. Students will design and implement archaeological fieldwork or analyze data collected in the field. Prerequisites: consent of the instructor. (Formerly known as ANGR 288.)"}
{"code": "ANTH 289S", "title": "Tanzania Anthropogeny Study Tour", "units": "1–4", "anchor": "anth289s", "description": "Graduate students will visit key sites representing the three major approaches to studying human origins: fossils evidence, comparison with nonhumans, and study of human foragers. Visits will be combined with lectures, discussion, and brief training in conducting relevant field research. Prerequisites: graduate standing; department authorization required."}
{"code": "ANTH 291", "title": "Archaeology of Highland Mexico", "units": "4", "anchor": "anth291", "description": "Survey of Mesoamerican archaeology focusing on highland Mexico. Topics covered: settling of Mesoamerica, agricultural origins, development of social complexity, rise of cities, emergence of large-scale states. Prerequisites: graduate standing. (Formerly known as ANGR 291.)"}
{"code": "ANTH 292", "title": "Social Evolution/Iron Age Levant", "units": "4", "anchor": "anth292", "description": "The Iron Age (ca. 1200–586 BCE) represents the rise of small secondary states throughout the southern Levant. Seminar explores these archaic states through ideology, technology, subsistence, trade and social organization based on archaeological data, historical texts, and anthropological models. Prerequisites: graduate standing. (Formerly known as ANGR 292.)"}
{"code": "ANTH 293", "title": "Primate Socioecology", "units": "4", "anchor": "anth293", "description": "Course examines theories for the causes of sociality in primates. Implications for our understanding of human evolution are considered. Prerequisites: graduate standing or consent of instructor. (Formerly known as ANGR 293.) "}
{"code": "ANTH 295", "title": "Master’s Thesis Preparation", "units": "4", "anchor": "anth295", "description": "The student will work on the master’s thesis under the direction of the departmental committee chair. The course will be taken in the student’s second year. S/U grades only. Prerequisites: graduate student in anthropology and consent of master’s thesis chair. (Formerly known as ANGR 295.)"}
{"code": "ANTH 296", "title": "Dissertation Fieldwork Proposal Preparation", "units": "4", "anchor": "anth296", "description": "The student will work in cooperation with his or her departmental committee to develop a research proposal for the doctoral research project. S/U grades only. Prerequisites: graduate standing in anthropology and consent of departmental committee chair. (Formerly known as ANGR 296A/296B.)"}
{"code": "ANTH 297", "title": "Research Practicum", "units": "1–4", "anchor": "anth297", "description": "Supervised advanced research studies with individual topics to be selected according to the student’s special interests. S/U grades only. Prerequisites: for anthropology graduate students who have returned from their field research."}
{"code": "ANTH 298", "title": "Independent Study", "units": "1–4", "anchor": "anth298", "description": "Supervised study of individually selected anthropological topics under the direction of a member of the faculty. S/U grades only. Prerequisites: graduate standing. (Formerly known as ANGR 298.)"}
{"code": "ANTH 299", "title": "Dissertation Research", "units": "1–12", "anchor": "anth299", "description": "S/U grades only. Prerequisites: PhD candidacy in anthropology. (Formerly known as ANGR 299.)"}
{"code": "ANTH 500", "title": "Apprentice Teaching", "units": "4", "anchor": "anth500", "description": "Anthropology graduate students participate in the undergraduate teaching program during one quarter anytime in the first four years of residence. Teaching may be in the anthropology department or other departments or programs on campus. Equivalent to duties expected of a fifty percent TA. Enrollment in four units documents the PhD requirement. S/U grades only. Prerequisites: graduate student in anthropology. (Formerly known as ANGR 500.)"}
