{"code": "BIOL", "name": "Biological Sciences, School of", "link": "https://catalog.ucsd.edu/courses/BIOL.html"}
{"code": "BILD 1", "title": "The Cell", "units": "4", "anchor": "bild1", "description": "An introduction to cellular structure and function, to biological molecules, bioenergetics, to the genetics of both prokaryotic and eukaryotic organisms, and to the elements of molecular biology. Recommended preparation: prior completion of high school- or college-level chemistry course."}
{"code": "BILD 2", "title": "Multicellular Life", "units": "4", "anchor": "bild2", "description": "An introduction to the development and the physiological processes of plants and animals. Included are treatments of reproduction, nutrition, respiration, transport systems, regulation of the internal environment, the nervous system, and behavior. Prerequisites: BILD 1.", "prereqs": "BILD 1"}
{"code": "BILD 3", "title": "Organismic and Evolutionary Biology", "units": "4", "anchor": "bild3", "description": "The first principles of evolutionary theory, classification, ecology, and behavior; a phylogenetic synopsis of the major groups of organisms from viruses to primates."}
{"code": "BILD 4", "title": "Introductory Biology Lab", "units": "2", "anchor": "bild4", "description": "Students gain hands-on experience and learn the theoretical basis of lab techniques common to a variety of biological disciplines such as biochemistry, molecular biology, cell biology, and bioinformatics. Students will work in groups, learning how to collect, analyze, and present data while using the scientific method to conduct inquiry-based laboratory experiments. Material lab fees will apply."}
{"code": "BILD 5", "title": "Data Analysis and Design for Biologists", "units": "4", "anchor": "bild5", "description": "This course is a practical introduction to information literacy, experimental design, and data analysis for biologists. Students will be introduced to coding, data management, and quantitative analysis. However, this is not a traditional statistics course and no mathematics prerequisites are required. Rather this course focuses on practical skills related to effectively asking and answering biological questions with data."}
{"code": "BILD 7", "title": "The Beginning of Life", "units": "4", "anchor": "bild7", "description": "An introduction to the basic principles of plant and animal development, emphasizing the similar strategies by which diverse organisms develop. Practical applications of developmental principles as well as ethical considerations arising from these technologies will be discussed."}
{"code": "BILD 10", "title": "Fundamental Concepts of Modern Biology", "units": "4", "anchor": "bild10", "description": "An introduction to the biochemistry and genetics of cells and organisms; illustrations are drawn from microbiology and human biology. This course is designed for nonbiology students and does not satisfy a lower-division requirement for any biology major. Open to nonbiology majors only. Note: Students may not receive credit for BILD 10 after receiving credit for BILD 1."}
{"code": "BILD 12", "title": "Neurobiology and Behavior", "units": "4", "anchor": "bild12", "description": "Introduction to the organization and functions of the nervous system; topics include molecular, cellular, developmental, systems, and behavioral neurobiology. This course is designed for nonbiology students and does not satisfy a lower-division requirement for any biology major. Open to nonbiology majors only. Note: Students may not receive credit for both BILD 12 and COGS 17."}
{"code": "BILD 18", "title": "Human Impact on the Environment", "units": "4", "anchor": "bild18", "description": "Course will focus on issues such as global warming, species extinction, and human impact on the oceans and forests. History and scientific projections will be examined in relation to these events. Possible solutions to these worldwide processes and a critical assessment of their causes and consequences will be covered."}
{"code": "BILD 20", "title": "Human Genetics in Modern Society", "units": "4", "anchor": "bild20", "description": "Fundamentals of human genetics and introduction to modern genetic technology such as gene cloning and DNA finger printing. Applications of these techniques, such as forensic genetics, genetic screening, and genetic engineering. Social impacts and ethical implications of these applications. This course is designed for nonbiology students and does not satisfy a lower-division requirement for any biology major. Open to nonbiology majors only. Note: Students may not receive credit for BILD 20 after receiving credit for BICD 100."}
{"code": "BILD 22", "title": "Human Nutrition", "units": "4", "anchor": "bild22", "description": "A survey of our understanding of the basic chemistry and biology of human nutrition; discussions of all aspects of food: nutritional value, diet, nutritional diseases, public health, and public policy. This course is designed for nonbiology students and does not satisfy a lower-division requirement for any biology major. Open to nonbiology majors only. Note: Students may not receive credit for BILD 22 after receiving credit for BIBC 120."}
{"code": "BILD 26", "title": "Human Physiology", "units": "4", "anchor": "bild26", "description": "Introduction to the elements of human physiology and the functioning of the various organ systems. The course presents a broad, yet detailed, analysis of human physiology, with particular emphasis toward understanding disease processes. This course is designed for nonbiology students and does not satisfy a lower-division requirement for any biology major. Open to nonbiology majors only. Note: Students may not receive credit for BILD 26 after receiving credit for BIPN 100."}
{"code": "BILD 30", "title": "Biology of Plagues: Past and Present", "units": "4", "anchor": "bild30", "description": "An introduction to diseases caused by viruses, bacteria, and parasites, and the impact of these diseases on human society. Topics include the biology of infectious disease, epidemiology, and promising new methods to fight disease. Open to nonbiology majors only. Note: Students will not receive credit for BILD 30 if taken after BIMM 120."}
{"code": "BILD 32", "title": "Introduction to Cancer Biology", "units": "4", "anchor": "bild32", "description": "Cancer is the second leading cause of death both in the United States and globally. This course is an introduction to the basic biology of cancer including the cellular and genetic changes that characterize the development and progression of cancer, as well as a review of the major therapies currently being pursued to treat cancer. Topics that are emphasized in this course include the fundamental causes of cancers, the socioeconomic implications of cancer incidence, and basic preventative measures. This course does not satisfy any requirement for a biology major. Students may not receive credit for BILD 32 after receiving credit for BIMM 134."}
{"code": "BILD 36", "title": "AIDS Science and Society", "units": "4", "anchor": "bild36", "description": "An introduction to all aspects of the AIDS epidemic. Topics will include the epidemiology, biology, and clinical aspects of HIV infection; HIV testing; education and approaches to therapy; and the social, political, and legal impacts of AIDS on the individual and society. This course is designed for nonbiology students and does not satisfy a lower-division requirement for any biology major. Open to nonbiology majors only. Note: Students may not receive credit for BILD 36 after receiving credit for BICD 136."}
{"code": "BILD 38", "title": "Dementia, Science, and Society", "units": "4", "anchor": "bild38", "description": "Introduction to basic human neuroscience leading to a discussion of brain diseases classified under the rubric Dementia. Topics include basic brain structure and function, diseases of the aging brain and their economic, social, political and ethical impacts on society."}
{"code": "BILD 40", "title": "Introduction to Biomedical Research", "units": "2", "anchor": "bild40", "description": "Course introduces students to some of the research approaches employed by physicians and scientists at the UC San Diego School of Medicine to investigate the etiology, biology, prevention and treatment of human diseases, including cancer, diabetes, and others. P/NP grades only."}
{"code": "BILD 42", "title": "Our Sustainable Future", "units": "4", "anchor": "bild42", "description": "This course will provide an overview of existing methods for energy, food, and materials production and utilization, and describe new technologies for their sustainable production and the consequences of this to our society and the planet."}
{"code": "BILD 44", "title": "Scientific Perspectives for a Changing World", "units": "4", "anchor": "bild44", "description": "Science can help us define and solve problems of the modern world, from how to improve health and change people’s behavior to how to protect the environment. This course will train students to assess scientific claims and their implications in today’s complex information ecosystem, critically engaging from the scale of data analysis through to the social framework in which research is carried out and presented. Contemporary case studies from natural and social sciences will be discussed."}
{"code": "BILD 46", "title": "Ecology of a Changing Planet", "units": "4", "anchor": "bild46", "description": "Biodiversity is changing worldwide in response to global changes. What do these changes in biodiversity foretell for the continued provisioning of ecosystem services on which humans depend? How can we develop conservation and management strategies that preserve biodiversity, backed up by sound science? These are some of the most important questions of our time. Topics will be presented at an introductory level appropriate for students in all majors. Students will not receive credit if taken after BIEB 182."}
{"code": "BILD 51", "title": "Quantitative Biology Project Lab", "units": "4", "anchor": "bild51", "description": "Course covers two important aspects: (1) interdisciplinary and research-based education and (2) teaching fundamental experimental and computational skills in quantitative studies of living systems. Participation by application only. Material lab fees will apply. Prerequisites: department approval required."}
{"code": "BILD 60", "title": "Exploring Issues of Diversity, Equity, and Inclusion in Relation to Human Biology", "units": "4", "anchor": "bild60", "description": "This course will examine diversity, equity, and inclusion beginning with a biological framework. Focus will be on how underlying biological differences have been used to support bias and prejudice against particular groups such as women, African Americans, and Latinos. This course is approved to meet the campus Diversity, Equity, and Inclusion (DEI) requirement.  Prerequisites: BILD 1 and BILD 2 or 3.", "prereqs": {"type": "all", "courses": ["BILD 1", {"type": "one", "courses": ["BILD 2", "BILD 3"]}]}}
{"code": "BILD 62", "title": "Introduction to Python for Biologists", "units": "4", "anchor": "bild62", "description": "Introductory class for biology students interested in using Python for data analysis and visualization. Course covers the basics of programming in Python and introduces students to various implementations of Python analyses for biological data such as time series and images. Students will use their own laptops. Students may receive credit for one of the following: BILD 62, COGS 18, CSE 6R, or CSE 8A."}
{"code": "BILD 70", "title": "Genomics Research Initiative Lab I", "units": "4", "anchor": "bild70", "description": "Students will isolate bacterial viruses or other organisms from the environment and characterize them by methods including electron microscopy and nucleic acid analysis. The genomic DNA will be purified and sent for sequencing. Restricted to student participants in the Phage Genomics Research program. Renumbered from BIMM 171A. Students may not receive credit for BILD 70 and BIMM 171A. Material lab fees will apply. Prerequisites: department approval required."}
{"code": "BILD 75", "title": "Essential Lab Techniques in the Biological Sciences", "units": "1", "anchor": "bild75", "description": "In this hands-on workshop, students will gain experience in the fundamental lab techniques used by biological scientists. The techniques covered will vary by topic. Examples of topics are biochemistry, neuroscience, molecular biology, and microbiology. Intended for students with limited lab experience. Students may enroll up to four times as topics vary."}
{"code": "BILD 80", "title": "Job and Internship Preparation: Job Application", "units": "1", "anchor": "bild80", "description": "This is an internship and job preparation course where professional development skills will be built upon in future quarters. The focus of this course will be writing résumés and cover letters and applying to jobs. Students can apply to internships or jobs that they seek out on their own or through industry partnerships that the course facilitator has strategically developed for this course. Open to biology majors only. It is recommended that students take BILD 80, BILD 81, and BILD 82."}
{"code": "BILD 81", "title": "Job and Internship Preparation: Interview Skills", "units": "1", "anchor": "bild81", "description": "This is an internship and job preparation course where professional development skills will build upon what was learned in the prior quarter. The focus of this course will be interview skills and having mock interviews with industry professionals. Students can apply to internships or jobs that they seek out on their own or through industry partnerships that the course facilitator has strategically developed for this course. Open to biology majors only. It is recommended that students take BILD 80, BILD 81, and BILD 82."}
{"code": "BILD 82", "title": "Job and Internship Preparation: Professional Development Skills", "units": "1", "anchor": "bild82", "description": "This is an internship and job preparation course where professional development skills will build upon what was learned in the prior quarter. The focus of this course will be building soft skills and other professional development skills that are applicable to internships. Students can apply to internships or jobs that they seek out on their own or through industry partnerships that the course facilitator has strategically developed for this course."}
{"code": "BILD 83", "title": "Business Communications for Biological Sciences", "units": "1", "anchor": "bild83", "description": "Students will learn to write and speak clearly and effectively for professional channels including email, presentations, and business meetings. Students will practice these techniques with industry professionals who will provide feedback to help them strengthen these skills."}
{"code": "BILD 87", "title": "First-year Seminar", "units": "1", "anchor": "bild87", "description": "The First-year Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year seminars can be offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students."}
{"code": "BILD 91", "title": "Biology First-year Students: Strategies for Success", "units": "1", "anchor": "bild91", "description": "Course is designed to assist new first-year students in making a smooth and informed transition from high school. Lectures focus on study skills, academic planning and using school and campus resources to help achieve academic, personal and professional goals. Exercises and practicums will develop the problems solving skills needed to succeed in biology. Attention will be given to research possibilities. Intended for new first-year students."}
{"code": "BILD 92", "title": "Professional Development Topics in the Biological Sciences", "units": "1", "anchor": "bild92", "description": "Seminars will introduce students to various professional development topics in the biological sciences. Emphasis may include current research in academe and industry, using campus and community resources to help achieve academic, personal and professional goals, and career exploration. Activities may include presentations by faculty, alumni, and practicing professional biologists, as well as panel discussions with professionals from industry."}
{"code": "BILD 95", "title": "Undergraduate Workshops", "units": "1", "anchor": "bild95", "description": "The workshops will be restricted to lower-division undergraduates. The course will introduce students to the methods of scientific research and to a variety of research topics in the biological/biomedical sciences. Examples of topics are: Introduction to Scientific Research, AIDS, Medical and Social Aspects, Is the Mind the Same as the Brain, Wildlife Conservation."}
{"code": "BILD 96", "title": "Biology: Honors Seminar", "units": "2", "anchor": "bild96", "description": "Weekly seminar providing Biological Sciences Scholars Program students with the opportunity to learn more about research and scholarly activities available to them and acquaints them with UC San Diego faculty members. The course will promote student’s participation in research and other scholarly activities on campus. Prerequisites: department approval required."}
{"code": "BILD 97", "title": "Topics in Modern Biology: Professional Development and Analysis", "units": "1", "anchor": "bild97", "description": "Students participating in the Biological Sciences Co-Op Program will meet with course instructors and fellow students during the quarter to discuss their project. At the end of the course, students will give a formal presentation describing their co-op project and complete a written assignment designed to evaluate their co-op experience. This course will focus on professional development skills designed to prepare students to provide feedback on research and communication in an industry setting. May be taken for credit up to six times. Prerequisites: department approval required."}
{"code": "BILD 98", "title": "Directed Group Study", "units": "1 to 4", "anchor": "bild98", "description": "Investigation of a topic in biological sciences through directed reading and discussion by a small group of students under the supervision of a faculty member. Students must complete a Special Studies form. Paperwork for a BILD 98 must be submitted to SIS by Friday of the eighth week of the quarter preceding the quarter in which the 98 will be completed. P/NP grades only. May be taken for credit two times. Prerequisites: department approval required."}
{"code": "BILD 99", "title": "Independent Research", "units": "2 or 4", "anchor": "bild99", "description": "Independent research by special arrangement with a faculty member. (P/NP grades only.) Students must have an overall UC San Diego GPA of at least 3.0 and a minimum of thirty units complete. Students must complete a Special Studies form and a School of Biological Sciences Research Plan. Credit may not be received for a course numbered 99 subsequent to receiving credit for a course numbered 199. Prerequisites: department approval required."}
{"code": "BIBC 100", "title": "Structural Biochemistry", "units": "4", "anchor": "bibc100", "description": "The structure and function of biomolecules. Includes protein conformation, dynamics, and function; enzymatic catalysis, enzyme kinetics, and allosteric regulation; lipids and membranes; sugars and polysaccharides; and nucleic acids. Prerequisites: CHEM 40A or CHEM 140A or BENG 120 and CHEM 40B or CHEM 140B or BENG 120. Note: Students may not receive credit for both BIBC 100 and CHEM 114A.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CHEM 40A", "CHEM 140A", "BENG 120"]}, {"type": "one", "courses": ["CHEM 40B", "CHEM 140B", "BENG 120"]}]}}
{"code": "BIBC 102", "title": "Metabolic Biochemistry", "units": "4", "anchor": "bibc102", "description": "Energy-producing pathways–glycolysis, the TCA cycle, oxidative phosphorylation, photosynthesis, and fatty acid oxidation; and biosynthetic pathways–gluconeogenesis, glycogen synthesis, and fatty acid biosynthesis. Nitrogen metabolism, urea cycle, amino acid metabolism, nucleotide metabolism, and metabolism of macromolecules. Prerequisites: CHEM 40A or CHEM 140A or BENG 120 and CHEM 40B or CHEM 140B or BENG 120. Note: Students may not receive credit for both BIBC 102 and CHEM 114B.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CHEM 40A", "CHEM 140A", "BENG 120"]}, {"type": "one", "courses": ["CHEM 40B", "CHEM 140B", "BENG 120"]}]}}
{"code": "BIBC 103", "title": "Biochemical Techniques", "units": "4", "anchor": "bibc103", "description": "Introductory laboratory course in current principles and techniques applicable to research problems in biochemistry and molecular biology. Techniques include protein and nucleic acid purification; identification methods such as centrifugation, chromatography, and electrophoresis; immunological, spectrophotometric, and enzymatic methods. Material lab fees will apply. Prerequisites: BILD 1. Note: Students may not receive credit for BIBC 103 after taking CHEM 108. Attendance at the first lecture/lab is required. Nonattendance may result in the student’s being dropped from the course roster.", "prereqs": "BILD 1"}
{"code": "BIBC 120", "title": "Nutrition", "units": "4", "anchor": "bibc120", "description": "Elaborates the relationship between diet and human metabolism, physiology, health, and disease. Covers the functions of carbohydrates, lipids, proteins, vitamins, and minerals, and discusses dietary influences on cardiovascular disease, diabetes, obesity, and cancer. Prerequisites: BIBC 102 or CHEM 114B.", "prereqs": {"type": "one", "courses": ["BIBC 102", "CHEM 114B"]}}
{"code": "BIBC 140", "title": "Our Energy Future—Sustainable Energy Solutions", "units": "4", "anchor": "bibc130", "description": "Course will provide an overview of energy production and utilization and the consequences of this on the economy and environment. The course will introduce renewable energy technologies including biofuels, and explores the social, economic, and political aspects of energy use. Prerequisites: BILD 1.", "prereqs": "BILD 1"}
{"code": "BIBC 151", "title": "Chemistry of Biological Interactions", "units": "4", "anchor": "bibc151", "description": "Nearly all interactions between organisms, including host-pathogen interactions and mate attraction, have a chemical basis. Plants and microorganisms are the dominant life forms on earth and remain a major source of pharmaceutical leads. Students in this course will utilize biochemical methods to extract, fractionate, and analyze plant and microbial compounds of medicinal and ecological significance including antibiotics, growth regulators, toxins, and signaling molecules. Students use own laptops. Course requires field studies. Transportation not provided by the university. Students must comply with all risk management policies and procedures. Course materials fees will be applied. Prerequisites: BIBC 100 or BIBC 102 or CHEM 114A or CHEM 114B.", "prereqs": {"type": "one", "courses": ["BIBC 100", "BIBC 102", "CHEM 114A", "CHEM 114B"]}}
{"code": "BIBC 194", "title": "Advanced Topics in Modern Biology: Biochemistry", "units": "2", "anchor": "bibc194", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Students may receive credit in 194 courses a total of four times as topics vary. Students may not receive credit for the same topic. Prerequisites: BIBC 100 or BIBC 102 or CHEM 114A or CHEM 114B.", "prereqs": {"type": "one", "courses": ["BIBC 100", "BIBC 102", "CHEM 114A", "CHEM 114B"]}}
{"code": "BICD 100", "title": "Genetics", "units": "4", "anchor": "bicd100", "description": "An introduction to the principles of heredity emphasizing diploid organisms. Topics include Mendelian inheritance and deviations from classical Mendelian ratios, pedigree analysis, gene interactions, gene mutation, linkage and gene mapping, reverse genetics, population genetics, and quantitative genetics. Prerequisites: BILD 1 and BILD 3.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 3"]}}
{"code": "BICD 101", "title": "Eukaryotic Genetics Laboratory", "units": "4", "anchor": "bicd101", "description": "Course implements key concepts in genetics and genomics such as performing and interpreting results of genetic crosses, analyzing mutations and their phenotypic consequences, analyzing the genetic basis of quantitative traits, and analyzing genome sequences in relation to phenotypic variation. Attendance at the first lecture/lab is required. Nonattendance may result in the student being dropped from the course roster. Recommended preparation: BICD 100. Prerequisites: BILD 1.", "prereqs": "BILD 1"}
{"code": "BICD 102", "title": "Genetic Inquiry", "units": "4", "anchor": "bicd102", "description": "Students will interact with primary literature in genetics through reading, writing, and in-class discussions. The focus will be to learn to analyze research data and develop critical thinking skills, while applying concepts in genetics to understand scientific discoveries. Topics may vary from quarter to quarter; examples include but are not limited to genetic basis of complex human traits or genetics and evolution of form and function in organisms. Prerequisites: BICD 100 and MATH 11.", "prereqs": {"type": "all", "courses": ["BICD 100", "MATH 11"]}}
{"code": "BICD 104", "title": "Genetic Neurobiology", "units": "4", "anchor": "bicd104", "description": "This course will survey studies of the genetic influences on behavior and the use of genetic tools to study behavior and neurobiology, with particular emphasis on studies of the mechanisms underlying various behaviors. Studies of model organisms (bacteria, paramecium, C. elegans, Drosophila, and mice) will be discussed along with their implications for understanding human behavior. The material is highly interdisciplinary, reflecting the variety of experimental approaches to the subject. Prerequisites: BILD 2 and BICD 100.", "prereqs": {"type": "all", "courses": ["BILD 2", "BICD 100"]}}
{"code": "BICD 110", "title": "Cell Biology", "units": "4", "anchor": "bicd110", "description": "The structure and function of cells and cell organelles, cell growth and division, motility, cell differentiation and specialization. Prerequisites: BIBC 100 or BIBC 102 or CHEM 114A or CHEM 114B.", "prereqs": {"type": "one", "courses": ["BIBC 100", "BIBC 102", "CHEM 114A", "CHEM 114B"]}}
{"code": "BICD 112", "title": "Stem Cells and Regeneration", "units": "4", "anchor": "bicd112", "description": "Stem cells maintain homeostasis of nearly all organ systems and the regenerative capacity of certain organisms. Course explores the paradigm of the tissue-specific stem cell, the cellular mechanisms of tissue regeneration, the evolution of stem cells and regenerative capacity over time, the basis of induced pluripotency, and how these basic processes can inform new approaches to human health. Prerequisites: BIMM 100.", "prereqs": "BIMM 100"}
{"code": "BICD 120", "title": "Molecular Basis of Plant Development", "units": "4", "anchor": "bicd120", "description": "Introduction to the biology of plants with a particular focus on the underlying genetic and molecular mechanisms controlling plant development. Topics include the role of plant hormones and stem cells in the formation of embryos, roots, flowers, and fruit. Prerequisites: BILD 1.", "prereqs": "BILD 1"}
{"code": "BICD 123", "title": "Plant Molecular Genetics and Biotechnology Laboratory", "units": "4", "anchor": "bicd123", "description": "Techniques in plant cell and tissue culture, plant transformation, genetic selection and screening of mutants, host pathogen interactions, gene regulation, organelle isolation, membrane transport. Attendance at the first lecture/lab is required. Nonattendance may result in the student being dropped from the course roster. Recommended preparation: BICD 120. Material lab fees will apply. Prerequisites: upper-division standing."}
{"code": "BICD 124", "title": "Plant Innate Immunity", "units": "4", "anchor": "bicd124", "description": "Plant immunity protects against pathogens and enables symbioses. This course explores the agents of plant disease, the genetics of inherited immunity, mechanisms of pathogenesis and defense, the coordination of plant immunity by plant hormones, and the regulation of symbioses. Prerequisites: BICD 100.", "prereqs": "BICD 100"}
{"code": "BICD 130", "title": "Embryos, Genes, and Development", "units": "4", "anchor": "bicd130", "description": "Developmental biology of animals at the tissue, cellular, and molecular levels. Basic processes of embryogenesis in a variety of invertebrate and vertebrate organisms. Cellular and molecular mechanisms that underlie cell fate determination and cell differentiation. More advanced topics such as pattern formation and sex determination are discussed. Open to upper-division students only. Recommended preparation: BICD 110 and BIMM 100. Prerequisites: upper-division standing; BICD 100 and BIBC 100 or BIBC 102 or CHEM 114A or CHEM 114B.", "prereqs": {"type": "all", "courses": ["BICD 100", {"type": "one", "courses": ["BIBC 100", "BIBC 102", "CHEM 114A", "CHEM 114B"]}]}}
{"code": "BICD 136", "title": "AIDS Science and Society", "units": "4", "anchor": "bicd136", "description": "An introduction to all aspects of the AIDS epidemic. Topics will include the epidemiology, biology, and clinical aspects of HIV infection, HIV testing, education and approaches to therapy, and the social, political, and legal impacts of AIDS on the individual and society. In order to count for their major, biology majors must take the upper-division course, BICD 136. Prerequisites: BILD 1, BILD 2 recommended.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 2"]}}
{"code": "BICD 140", "title": "Immunology", "units": "4", "anchor": "bicd140", "description": "Formation and function of the mammalian immune system, molecular and cellular basis of the immune response, infectious diseases and autoimmunity. Prerequisites: BICD 100, BIMM 100. BIBC 100 recommended.", "prereqs": {"type": "all", "courses": ["BICD 100", "BIMM 100"]}}
{"code": "BICD 145", "title": "Laboratory in Molecular Medicine", "units": "4", "anchor": "bicd145", "description": "This course focuses upon a molecular and immunological approach to study problems in modern medical research. The emphasis will be on novel approaches in medicine, including lymphocyte biology, cancer biology, and gene transfer. Material lab fees will apply. Prerequisites: BIMM 100.", "prereqs": "BIMM 100"}
{"code": "BICD 156", "title": "Population Genetics", "units": "4", "anchor": "bicd156", "description": "How do natural selection, mutation, migration, and genetic drift drive evolution? Students will learn how these forces operate and how to describe them quantitatively with simple mathematical models. We will discuss how to apply this knowledge to understand the spread of drug resistance in pathogens, the evolution of beneficial as well as disease traits in our own species, the evolution of engineered organisms, and more. Renumbered from BIEB 156. Students may not receive credit for BICD 156 and BIEB 156. Prerequisites: BICD 100 and MATH 10A or MATH 20A.", "prereqs": {"type": "all", "courses": ["BICD 100", {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}]}}
{"code": "BICD 194", "title": "Advanced Topics in Modern Biology: Cellular Development", "units": "2", "anchor": "bicd194", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Students may receive credit in 194 courses a total of four times as topics vary. Students may not receive credit for the same topic. Prerequisites: BICD 110.", "prereqs": "BICD 110"}
{"code": "BIEB 100", "title": "Biostatistics", "units": "4", "anchor": "bieb100", "description": "An interactive introduction to estimation, hypothesis testing, and statistical reasoning. Emphasis on the conceptual and logical basis of statistical ideas. Focus on randomization rather than parametric techniques. Topics include describing data, sampling, bootstrapping, and significance. Mandatory one-hour weekly section. Students may not receive credit for both BIEB 100 and SIO 187. Prerequisites: BILD 3 and MATH 10A or 20A and MATH 10B or 20B. Students may not receive credit for both BIEB 100 and SIO 187.", "prereqs": {"type": "all", "courses": ["BILD 3", {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}, {"type": "one", "courses": ["MATH 10B", "MATH 20B"]}]}}
{"code": "BIEB 102", "title": "Introductory Ecology—Organisms and Habitat", "units": "4", "anchor": "bieb102", "description": "This course emphasizes principles shaping organisms, habitats, and ecosystems. Topics covered include population regulation, physiological ecology, competition, predation, and human exploitation. This will be an empirical look at general principles in ecology and conservation with emphasis on the unique organisms and habitats of California. Prerequisites: BILD 3 or equivalent.", "prereqs": "BILD 3"}
{"code": "BIEB 121", "title": "Ecology Laboratory", "units": "4", "anchor": "bieb121", "description": "A laboratory course to familiarize students with ecological problem solving and methods. Students will perform outdoor fieldwork and use a computer for data exploration and analysis. Fieldwork can be expected in this course. Associated travel may be required, and students are responsible for their own transportation. Students may need to provide and use their own laptop. Program or materials fees may apply. Prerequisites: BIEB 100 or MATH 11 or SIO 187 and BILD 3.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["BIEB 100", "MATH 11", "SIO 187"]}, "BILD 3"]}}
{"code": "BIEB 123", "title": "Molecular Methods in Evolution and Ecology Lab", "units": "4", "anchor": "bieb123", "description": "Theory and practice of molecular biology techniques used in evolutionary and ecological research. Includes isolation and genotyping of DNA, PCR, and its applications. Phylogenetics, biodiversity, bioinformatics, and evolutionary and ecological analysis of molecular data. Material lab fees will apply. Students may not enroll in and receive credit for both BIMM 101 and BIEB 123. Attendance at the first lecture/lab is required. Nonattendance may result in the student being dropped from the course roster. Prerequisites: BILD 1 and BILD 3.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 3"]}}
{"code": "BIEB 126", "title": "Plant Ecology", "units": "4", "anchor": "bieb126", "description": "This course begins with an introduction to plant population biology including whole-plant growth and physiology. We then focus on three classes of ecological interactions: plant-plant competition, plant-herbivore coevolution, and plant reproductive ecology including animal pollination and seed dispersal. Prerequisites: BILD 3.", "prereqs": "BILD 3"}
{"code": "BIEB 128", "title": "Insect Diversity", "units": "4", "anchor": "bieb128", "description": "Course begins with a survey of insect diversity and phylogenetic relationships. Course then addresses issues such as population dynamics (including outbreaks), movement and migration, competition, predation, herbivory, parasitism, insect defense, mimicry complexes, and sociality. Course also includes discussions of pest management, evolution of insecticide resistance, insect-borne diseases, and how insects are responding to global change. Prerequisites: BILD 3.", "prereqs": "BILD 3"}
{"code": "BIEB 130", "title": "Marine Conservation Biology", "units": "4", "anchor": "bieb130", "description": "Course integrates principles of ecology and marine biology to examine marine biodiversity loss from overexploitation, habitat loss, invasion, climate change, and pollution. We examine consequences of biodiversity loss to marine ecosystems, discuss management regimes, and address global and local ocean conservation problems. Course includes basic overviews of climate, marine biology, and oceanography that may be similar to topics covered in introductory courses at Scripps Institution of Oceanography. Prerequisites: BILD 3.", "prereqs": "BILD 3"}
{"code": "BIEB 131", "title": "Marine Invertebrate Ecology Lab", "units": "4", "anchor": "bieb131", "description": "A laboratory course introducing students to coastal marine ecology. Students will participate in outdoor fieldwork and work in the laboratory gathering and analyzing ecological data. We will focus on ecological communities from a variety of coastal habitats and use them to learn about basic ecological processes as well as issues related to sustainability and conservation of biodiversity. Fieldwork is expected in this course. Associated travel in the San Diego area is required and students are responsible for their own transportation. Material lab fees will apply. Prerequisites: BILD 3 and BIEB 100 or MATH 11.", "prereqs": {"type": "all", "courses": ["BILD 3", {"type": "one", "courses": ["BIEB 100", "MATH 11"]}]}}
{"code": "BIEB 134", "title": "Introduction to Biological Oceanography", "units": "4", "anchor": "bieb134", "description": "(Cross-listed with SIO 134.) Basics for understanding the ecology of marine communities. The approach is process-oriented, focusing on major functional groups of organisms, their food-web interactions and community response to environmental forcing, and contemporary issues in human and climate influences. Prerequisites: BILD 3. Students will not receive credit for both BIEB 134 and SIO 134.", "prereqs": "BILD 3"}
{"code": "BIEB 135", "title": "Aquatic Ecology Lab", "units": "4", "anchor": "bieb135", "description": "Course provides overview of physical, chemical, and biological processes that characterize inland waters (lakes and rivers), estuaries, and near-shore environments. Dominant biota of lakes, rivers, and streams, and how they are related to physical and chemical processes of the systems in which they reside will be covered. Methods will be introduced for assessing the chemical composition of water and detecting organisms that affect drinking water quality and coastal water quality management. Course requires field studies. Students should expect to fully participate in field trips; transportation not provided by the university. Students must comply with all risk management policies/procedures. Material lab fees will apply. Prerequisites: BILD 3.", "prereqs": "BILD 3"}
{"code": "BIEB 136GS", "title": "Tropical Field Ecology", "units": "4", "anchor": "bieb136gs", "description": "An introduction to the ecosystems of Costa Rica and the methods used to study them. Students will work in teams to collect data and make systematic natural history observations on plants, insects, birds, and other organisms in tropical rain forests, mangroves, and other tropical environments. Hypothesis formulation and testing, data analysis, and oral and written presentation of research will be emphasized. Students must apply and be accepted to the Global Seminar Program in order to enroll. Program or materials fees may apply. Prerequisites: BILD 3.", "prereqs": "BILD 3"}
{"code": "BIEB 137GS", "title": "Sea Turtle Ecology and Conservation", "units": "4", "anchor": "bieb137gs", "description": "Course will introduce the biology of sea turtles (evolution, physiology, anatomy, behavior, life history, and population dynamics), conservation status, and ecological roles in coastal and marine ecosystems. Course reviews socio-ecological systems to incorporate human connections to sea turtles, the ocean, and governance. Emerging research and technology will be integrated with national and international law and policy to learn about management of endangered and migratory species. Students must apply and be accepted to the Global Seminar Program in order to enroll. Program or materials fees may apply. Prerequisites: BILD 3.", "prereqs": "BILD 3"}
{"code": "BIEB 140", "title": "Biodiversity", "units": "4", "anchor": "bieb140", "description": "An introduction to the patterns of geographic distribution and natural history of plants and animals living in terrestrial and marine ecosystems. We will explore ecological and evolutionary processes responsible for generating and maintaining biological diversity; and the nature of extinction both in past and present ecosystem. Prerequisites: BILD 3.", "prereqs": "BILD 3"}
{"code": "BIEB 143", "title": "Computer Modeling in Evolution and Ecology", "units": "4", "anchor": "bieb143", "description": "An introduction to computer modeling in evolution and ecology. Students will use the computer language “R” to write code to analyze ecological and evolutionary processes. Topics include natural selection, genetic drift, community ecology, game theory, and chaos. Students will use their own laptop computers. Prerequisites: BIEB 100 or BIEB 150.", "prereqs": {"type": "one", "courses": ["BIEB 100", "BIEB 150"]}}
{"code": "BIEB 146", "title": "Genome Diversity and Dynamics", "units": "4", "anchor": "bieb146", "description": "Modern sequencing technology has revolutionized our ability to detect how genomes vary in space among individuals, populations, and communities, and over time. This course will review methods and concepts in ecological and evolutionary genomics that help us understand these differences, including their relevance to health (human microbiome, cancer evolution), evolutionary history (ancestor reconstruction, human evolution), and the environment (effect of climate change). Prerequisites: BILD 1 and BILD 3.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 3"]}}
{"code": "BIEB 150", "title": "Evolution", "units": "4", "anchor": "bieb150", "description": "Evolutionary processes are discussed in their genetic, historical, and ecological contexts. Population genetics, agents of evolution, microevolution, speciation, macroevolution. Prerequisites: BILD 3 and BILD 1 or BIEB 143.", "prereqs": {"type": "all", "courses": ["BILD 3", {"type": "one", "courses": ["BILD 1", "BIEB 143"]}]}}
{"code": "BIEB 152", "title": "Evolution of Infectious Diseases", "units": "4", "anchor": "bieb152", "description": "Treating infectious diseases is a uniquely difficult problem since pathogens often evolve, rendering today’s therapies useless tomorrow. This course will provide a review of concepts and methods in evolutionary medicine, with an emphasis on microbial genomics and molecular evolution. Prerequisites: BILD 3.", "prereqs": "BILD 3"}
{"code": "BIEB 154", "title": "Evolutionary Inquiry", "units": "4", "anchor": "bieb154", "description": "Students will investigate selected in-depth topics in evolutionary biology through reading and writing. Students will read books and articles written for a general audience as well as primary literature. Example topics include the origins of novel features, the impact of human activity and environmental changes on evolutionary processes, the rate and intensity of natural selection, and how our own evolutionary history affects human health. Prerequisites: BILD 1 and BILD 3.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 3"]}}
{"code": "BIEB 158", "title": "Microbiomes: The Ecology and Evolution of Microbes", "units": "4", "anchor": "bieb158", "description": "Microbes, the most numerous organisms on the planet, are often the most maligned. Most do not cause disease, but instead are useful: producing oxygen, promoting plant growth, or helping us digest. This course explores the microbial communities that regulate Earth’s biological and chemical processes. Students will learn theory, methods, and applications of microbial ecology and evolution relevant to contemporary world issues including human health, conservation of biodiversity, and climate change. Prerequisites: BILD 1 and BILD 3.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 3"]}}
{"code": "BIEB 166", "title": "Animal Behavior and Communication", "units": "4", "anchor": "bieb166", "description": "An integrated approach to animal behavior focusing on mechanisms of acoustic, visual, and olfactory communication. Course covers ethology and the genetics and neurobiology of behavior; orientation and navigation; and signal origins, properties, design, and evolution. Prerequisites: BILD 3 and Physics 1A or 2A.", "prereqs": "BILD 3"}
{"code": "BIEB 167", "title": "Animal Communication Lab", "units": "4", "anchor": "bieb167", "description": "Laboratory exercises will introduce students to quantitative methods of visual, auditory, and olfactory signal analysis and to lab and field studies of animal signaling. Prerequisites: BIEB 102 and BIEB 166. Attendance at the first lecture/lab is required. Nonattendance may result in the student’s being dropped from the course roster. Materials fees will apply.", "prereqs": {"type": "all", "courses": ["BIEB 102", "BIEB 166"]}}
{"code": "BIEB 174", "title": "Ecosystems and Global Change", "units": "4", "anchor": "bieb174", "description": "This course will teach the principles of ecosystem ecology in terrestrial and marine systems and will use examples from recent research to help students understand how global environmental changes are altering processes from leaf-level ecophysiology to global cycling of carbon, water, and nutrients. Fieldwork may be required. Prerequisites: BILD 3.", "prereqs": "BILD 3"}
{"code": "BIEB 176", "title": "Biology of Conservation and the Human Predicament", "units": "4", "anchor": "bieb176", "description": "Discussion of the human predicament, biodiversity crisis, and importance of biological conservation. Examines issues from biological perspectives emphasizing new approaches and new techniques for safeguarding the future of humans and other biosphere inhabitants. Prerequisites: BILD 3.", "prereqs": "BILD 3"}
{"code": "BIEB 182", "title": "Biology of Global Change", "units": "4", "anchor": "bieb182", "description": "This class will focus on ecological and evolutionary responses to three major anthropogenic stressors—climate change, resource exploitation, and urbanization. Students will learn about the eco-evolutionary changes that are currently happening due to anthropogenic impacts and also predictions about future changes due to such impacts. They will also learn about the economic and societal impacts of such changes and some of the strategies for conservation and sustainability in a changing world. Prerequisites: BIEB 102.", "prereqs": "BIEB 102"}
{"code": "BIEB 194", "title": "Advanced Topics in Modern Biology: Ecology, Behavior, Evolution", "units": "2", "anchor": "bieb194", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Students may receive credit in 194 courses a total of four times as topics vary. Students may not receive credit for the same topic. Prerequisites: BIEB 102.", "prereqs": "BIEB 102"}
{"code": "BIMM 100", "title": "Molecular Biology", "units": "4", "anchor": "bimm100", "description": "Molecular mechanisms and applications of the central dogma. Genome structure and function. Transcription and translation. Regulation of gene expression. Use of DNA technology in basic and applied biology. Note: Students will not receive credit for both BIMM 100 and CHEM 114C. Prerequisites: BILD 1 and BIBC 103 or BILD 4 or BILD 70 or BIMM 101 and BENG 120 or CHEM 40A or CHEM 40AH and BENG 120 or CHEM 40B or CHEM 40BH.", "prereqs": {"type": "all", "courses": ["BILD 1", {"type": "one", "courses": ["BIBC 103", "BILD 4", "BILD 70", "BIMM 101"]}, {"type": "one", "courses": ["BENG 120", "CHEM 40A", "CHEM 40AH"]}, {"type": "one", "courses": ["BENG 120", "CHEM 40B", "CHEM 40BH"]}]}}
{"code": "BIMM 101", "title": "Recombinant DNA Techniques", "units": "4", "anchor": "bimm101", "description": "Theory and practice of recombinant DNA and molecular biology techniques. Includes CRISPR-Cas9 editing, DNA sequencing, PCR, and basic bioinformatics. Nonattendance may result in the student’s being dropped from the course roster. Note: Students may not enroll in or receive credit for both BIMM 101 and BIEB 123, or BIMM 101 and CHEM 109. Material lab fees will apply. Prerequisites: BILD 1.", "prereqs": "BILD 1"}
{"code": "BIMM 110", "title": "Molecular Basis of Human Disease", "units": "4", "anchor": "bimm110", "description": "An examination of the molecular basis of human diseases. Course emphasizes inherited human disorders, and some important diseases caused by viruses. Focus on the application of genetic, biochemical, and molecular biological principles to an understanding of the diseases. Prerequisites: BICD 100 and BIMM 100 and BIBC 100 or BIBC 102 or CHEM 114A or CHEM 114B, upper-division standing.", "prereqs": {"type": "all", "courses": ["BICD 100", "BIMM 100", {"type": "one", "courses": ["BIBC 100", "BIBC 102", "CHEM 114A", "CHEM 114B"]}]}}
{"code": "BIMM 112", "title": "Regulation of Eukaryotic Gene Expressions", "units": "4", "anchor": "bimm112", "description": "This course explores the mechanisms by which gene activity is regulated in eukaryotes, with an emphasis on transcriptional regulation and chromatin. Topics will include chromatin structure, histone modifications, chromatin dynamics, transcription factors, transcriptional elongation, enhancers, CpG methylation, heterochromatin, and epigenetics. Prerequisites: BIMM 100.", "prereqs": "BIMM 100"}
{"code": "BIMM 114", "title": "Virology", "units": "4", "anchor": "bimm114", "description": "An introduction to eukaryotic virology, with emphasis on animal virus systems. Topics discussed include the molecular structure of viruses; the multiplication strategies of the major virus families; and viral latency, persistence, and oncology. Prerequisites: BIMM 100.", "prereqs": "BIMM 100"}
{"code": "BIMM 116", "title": "Circadian Rhythms—Biological Clocks", "units": "4", "anchor": "bimm116", "description": "(Cross-listed with Psych 133; however, biology majors must take the course as BIMM 116.) This interdisciplinary course provides an overview of the fundamental properties of daily biological clocks of diverse species, from humans to microbes. Emphasis is placed on the relevance of internal time keeping in wide-ranging contexts including human performance, health, and industry. Prerequisites: BILD 1 or COGS 107B or PSYC 106. Students may receive credit for one of the following: BIMM 116, BIMM 116R, PSYC 133, or PSYC 133R.", "prereqs": {"type": "one", "courses": ["BILD 1", "COGS 107B", "PSYC 106"]}}
{"code": "BIMM 116B", "title": "BioClock Studio", "units": "4", "anchor": "bimm116b", "description": "The BioClock Studio is an innovative course in which a team of undergraduate students, drawn from diverse disciplines, will work collaboratively to develop their scientific and communicative skills to produce creative educational materials that will enhance understanding of circadian biology. Students are expected to attend the annual Circadian Biology Symposium held each winter, to the extent course schedules allow, to conduct interviews with prominent scientists. BIMM 116 is not a prerequisite to enroll in BIMM 116B. May be taken for credit three times. Prerequisites: department approval required. Students will be required to formally apply to participate via an online application form and selected students will work in small teams with intensive mentoring to execute projects."}
{"code": "BIMM 116R", "title": "Circadian Rhythms—Biological Clocks", "units": "4", "anchor": "bimm116r", "description": "(Cross-listed with PSYC 133R; however, biology majors must take the course as BIMM 116R.) This interdisciplinary course provides an overview of the fundamental properties of daily biological clocks of diverse species, from humans to microbes. Emphasis is placed on the relevance of internal timekeeping in wide-ranging contexts including human performance, health, and industry. Prerequisites: BILD 1 or COGS 107B or PSYC 106. This course is a distance education course. Students may receive credit for one of the following: BIMM 116, BIMM 116R, PSYC 133, or PSYC 133R.", "prereqs": {"type": "one", "courses": ["BILD 1", "COGS 107B", "PSYC 106"]}}
{"code": "BIMM 118", "title": "Pharmacology", "units": "4", "anchor": "bimm118", "description": "Basics of pharmacology such as drug absorption, distribution, metabolism, and elimination. Concepts in toxicology and pharmacognosy are used to survey the major drug categories. Prerequisites: BIPN 100 and BIBC 100 or BIBC 102 or CHEM 114A or CHEM 114B.", "prereqs": {"type": "all", "courses": ["BIPN 100", {"type": "one", "courses": ["BIBC 100", "BIBC 102", "CHEM 114A", "CHEM 114B"]}]}}
{"code": "BIMM 120", "title": "Microbiology", "units": "4", "anchor": "bimm120", "description": "A discussion of the structure, growth, physiology, molecular genetics, genomics, and ecology of prokaryotic microorganisms, with emphasis on the genetic and metabolic diversity of bacteria and Archaea and their interactions with hosts and the environment. Prerequisites: BILD 3 and BIBC 100 or BIBC 102 or CHEM 114A or CHEM 114B and BIMM 100.", "prereqs": {"type": "all", "courses": ["BILD 3", {"type": "one", "courses": ["BIBC 100", "BIBC 102", "CHEM 114A", "CHEM 114B"]}, "BIMM 100"]}}
{"code": "BIMM 121", "title": "Microbiology Laboratory", "units": "4", "anchor": "bimm121", "description": "Techniques in microbial physiology, microbial genomics, microbial evolution, and microbial ecology will be used to explore the role of microbes in industry, health, and the environment. Inquiry-based experiments will cover the fundamentals of both working with live microscopic organisms at the bench and bioinformatically analyzing their genomes at the computer. Attendance at the first lecture/lab is required. Nonattendance may result in the student being dropped from the course roster. Material lab fees will apply. Prerequisites: BILD 1.", "prereqs": "BILD 1"}
{"code": "BIMM 122", "title": "Microbial Genetics", "units": "4", "anchor": "bimm122", "description": "Course will consider the organization and function of prokaryotic genomes including content, DNA supercoiling, histone-like proteins, chromosomal dynamics (short-term and long-term), extrachromosomal elements, bacterial sex, transduction, transformation, mobile elements (transposon), epigenetic change, adaptive and directed mutation, transcription and its regulation, sensory transduction, bacterial differentiation, symbiosis, and pathogenesis. Prerequisites: BIMM 100.", "prereqs": "BIMM 100"}
{"code": "BIMM 124", "title": "Medical Microbiology", "units": "4", "anchor": "bimm124", "description": "Encompasses the increasingly important areas of viral, bacterial, and parasitic diseases and understanding the complex interaction between humans and infectious agents. Covers human-pathogen interactions, mechanisms and molecular principles of infectious diseases, immune responses, countermeasures by pathogens and hosts, epidemiology, and cutting-edge approaches to therapy. Prerequisites: BIBC 100 or BIBC 102 or CHEM 114A or CHEM 114B.", "prereqs": {"type": "one", "courses": ["BIBC 100", "BIBC 102", "CHEM 114A", "CHEM 114B"]}}
{"code": "BIMM 130", "title": "Microbial Physiology", "units": "4", "anchor": "bimm130", "description": "Prokaryotic cell biology will be discussed primarily from physiological and biochemical standpoints with a focus on conceptual understanding, integration, and mechanism. Topics will vary from year to year but will include the following themes: bioenergetics, cell polarity, cell adhesion, the molecular basis of morphogenesis and differentiation, prokaryotic motility and behavior, rotary and linear molecular machines, bacterial organelles, pheromones and messengers, circadian rhythms, biological warfare, and bioremediation. Prerequisites: BIBC 100 or BIBC 102 or CHEM 114A or CHEM 114B.", "prereqs": {"type": "one", "courses": ["BIBC 100", "BIBC 102", "CHEM 114A", "CHEM 114B"]}}
{"code": "BIMM 134", "title": "Biology of Cancer", "units": "4", "anchor": "bimm134", "description": "This course explores the molecular and cellular pathways that become dysregulated during carcinogenesis. We will synthesize principles from genetics and molecular, cellular, and developmental biology to investigate how normal cells evolve into tumors. We will examine how tissues distinct from the tumor itself can participate in both facilitating and fighting tumor growth and explore historical and current approaches employed to inhibit tumorigenesis. Prerequisites: BILD 1, upper-division standing.", "prereqs": "BILD 1"}
{"code": "BIMM 140", "title": "Quantitative Principles in Biology", "units": "4", "anchor": "bimm140", "description": "Course considers problems in biology that were solved using quantitative biology approaches. Problems will range from the molecular to the population level. Students will learn about the scientific method and process, and how to apply it. Prerequisites: BILD 1.", "prereqs": "BILD 1"}
{"code": "BIMM 143", "title": "Bioinformatics Laboratory", "units": "4", "anchor": "bimm143", "description": "Bioinformatics is the analysis of big data in the biosciences. This course provides a hands-on introduction to the computer-based analysis of biomolecular and genomic data. Major topic areas include advances in sequencing technologies, genome resequencing and variation analysis, transcriptomics, structural bioinformatics, and personal genomics. This course will utilize free, web-based bioinformatics tools and no programming skills are required. Prerequisites: BILD 1 and BILD 4 or BIEB 123 or BIMM 101.", "prereqs": {"type": "all", "courses": ["BILD 1", {"type": "one", "courses": ["BILD 4", "BIEB 123", "BIMM 101"]}]}}
{"code": "BIMM 149", "title": "Computation for Biologists", "units": "4", "anchor": "bimm149", "description": "Course will provide students with the computational tools and problem-solving skills that are increasingly important to the biosciences. Students learn to program in a modern general-purpose programming language and write their own programs to explore a variety of applications in biology including simulations, sequence analysis, phylogenetics, among others. Students will use their own laptop computers. Prerequisites: BILD 1 and BILD 2.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 2"]}}
{"code": "BIMM 170", "title": "Genomics Research Initiative Laboratory II", "units": "4", "anchor": "bimm170", "description": "Students will characterize the genomic sequence of the organisms isolated in BILD 70 and use molecular and computational tools to resolve ambiguities and close gaps. They will then annotate the DNA sequence to identify protein and RNA coding regions. Renumbered from BIMM 171B. Students may not receive credit for BIMM 170 and BIMM 171B. Material lab fees will apply. Prerequisites: BILD 70.", "prereqs": "BILD 70"}
{"code": "BIMM 172", "title": "Genome Science", "units": "4", "anchor": "bimm172", "description": "Genomes are the immortal agents of evolution, passing from one individual to another in an unbroken line since the origin of life. This course explores the structure of genomes, the functions of its parts on a genome scale, the mechanisms of genome change, and the applications of genomic methods and knowledge. Prerequisites: BICD 100 and BIMM 100.", "prereqs": {"type": "all", "courses": ["BICD 100", "BIMM 100"]}}
{"code": "BIMM 174", "title": "Genomics, Big Data, and Human Health", "units": "4", "anchor": "bimm174", "description": "Imagine a world in which you can input your lifestyle and genomic information into an app to obtain personalized health recommendations. This world is not thirty years in the future but beginning to unfold now. Course reviews how genomic advances are revolutionizing health care. Includes recent developments in personalized medicine, disease screening, targeted immunotherapy, pharmacogenomics, and our emerging understanding of how microbiome and epigenetic factors impact health. Prerequisites: BILD 1 and BILD 4 or BIMM 101.", "prereqs": {"type": "all", "courses": ["BILD 1", {"type": "one", "courses": ["BILD 4", "BIMM 101"]}]}}
{"code": "BIMM 181", "title": "Molecular Sequence Analysis", "units": "4", "anchor": "bimm181", "description": "This course covers the analysis of nucleic acid and protein sequences, with an emphasis on the application of algorithms to biological problems. Topics include sequence alignments, database searching, comparative genomics, and phylogenetic and clustering analyses. Pairwise alignment, multiple alignment, DNA sequencing, scoring functions, fast database search, comparative genomics, clustering, phylogenetic trees, gene finding/DNA statistics. This course open to bioinformatics majors only. Prerequisites: CSE 100 or MATH 176 and CSE 101 and BIMM 100 or CHEM 114C. Students may receive credit for one of the following: CSE 181, BIMM 181, or BENG 181.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 100", "MATH 176"]}, "CSE 101", {"type": "one", "courses": ["BIMM 100", "CHEM 114C"]}]}}
{"code": "BIMM 182", "title": "Biological Databases", "units": "4", "anchor": "bimm182", "description": "This course provides an introduction to the features of biological data, how that data is organized efficiently in databases, and how existing data resources can be utilized to solve a variety of biological problems. Object-oriented databases, data modeling and description, survey of current biological database with respect to above, implementation of database focused on a biological topic. This course open to bioinformatics majors only. Prerequisites: CSE 100 or MATH 176. Students may receive credit for one of the following: CSE 182, BENG 182, or BIMM 182.", "prereqs": {"type": "one", "courses": ["CSE 100", "MATH 176"]}}
{"code": "BIMM 184", "title": "Computational Molecular Biology", "units": "4", "anchor": "bimm184", "description": "This advanced course covers the application of machine learning and modeling techniques to biological systems. Topics include gene structure, recognition of DNA and protein sequence patterns, classification, and protein structure prediction. Pattern discovery, hidden Markov models/support vector machines/neural network/profiles, protein structure prediction, functional characterization of proteins, functional genomics/proteomics, metabolic pathways/gene networks. Prerequisites: BIMM 181 or BENG 181 or CSE 181, BIMM 182 or BENG 182 or CSE 182 or CHEM 182.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["BIMM 181", "BENG 181", "CSE 181"]}, {"type": "one", "courses": ["BIMM 182", "BENG 182", "CSE 182", "CHEM 182"]}]}}
{"code": "BIMM 185", "title": "Bioinformatics Laboratory", "units": "Advanced", "anchor": "bimm185", "description": "This course emphasizes the hands-on application of bioinformatics methods to biological problems. Students will gain experience in the application of existing software, as well as in combining approaches to answer specific biological questions. Sequence alignment, fast database search, profiles and motifs, comparative genomics, gene finding, phylogenetic trees, protein structure, functional characterization of proteins, expression analysis, computational proteomics. This course open to bioinformatics majors only. Prerequisites: two courses out of BIMM 181 or BENG 181 or CSE 181, BIMM 182 or BENG 182 or CSE 182, BENG 183, BIMM 184 or BENG 184 or CSE 184. Attendance at the first lecture/lab is required. Nonattendance may result in the student’s being dropped from the course roster.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["BIMM 181", "BENG 181", "CSE 181"]}, {"type": "one", "courses": ["BIMM 182", "BENG 182", "CSE 182"]}, "BENG 183", {"type": "one", "courses": ["BIMM 184", "BENG 184", "CSE 184"]}]}}
{"code": "BIMM 194", "title": "Advanced Topics in Modern Biology: Molecular Biology", "units": "2", "anchor": "bimm194", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Students may receive credit in 194 courses a total of four times as topics vary. Students may not receive credit for the same topic. Prerequisites: BIMM 100.", "prereqs": "BIMM 100"}
{"code": "BIPN 100", "title": "Human Physiology I", "units": "4", "anchor": "bipn100", "description": "Course introduces the concepts of physiological regulation, controlled and integrated by the nervous and endocrine systems. Course then examines the muscular, cardiovascular, and renal systems in detail and considers their control through the interaction of nervous activity and hormones. Note: Students may not receive credit for both BIPN 100 and BENG 140A. Prerequisites: BILD 1 and BILD 2.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 2"]}}
{"code": "BIPN 102", "title": "Human Physiology II", "units": "4", "anchor": "bipn102", "description": "Course completes a survey of organ systems begun in BIPN 100 by considering the respiratory and gastrointestinal systems. Consideration is given to interactions of these systems in weight and temperature regulation, exercise physiology, stress, and pregnancy and reproduction. Note: Students may not receive credit for both BIPN 102 and BENG 140B. Prerequisites: BIPN 100.", "prereqs": "BIPN 100"}
{"code": "BIPN 105", "title": "Human Physiology Lab", "units": "6", "anchor": "bipn105", "description": "The focus of this course is to study human physiology. Experimental animals and human demonstrations are used to study membrane physiology, nerve and muscle function, hormone actions, cardiovascular physiology, and renal function. Students will also perform a research project and present their results in a symposium at the end of the quarter. Material lab fees will apply. Attendance at the first lecture/lab is required. Nonattendance may result in the student being dropped from the course roster. Prerequisites: BIPN 100.", "prereqs": "BIPN 100"}
{"code": "BIPN 106", "title": "Comparative Physiology", "units": "4", "anchor": "bipn106", "description": "This course examines the physiological adaptation of animals, invertebrates and vertebrates, to their particular environmental and behavioral niches. Structural, functional, and molecular adaptations of the basic organ systems are discussed. Prerequisites: BILD 2, CHEM 6A-B-C. BILD 3 is recommended.", "prereqs": {"type": "all", "courses": ["BILD 2", "CHEM 6A", "CHEM 6B", "CHEM 6C"]}}
{"code": "BIPN 108", "title": "Biology and Medicine of Exercise", "units": "4", "anchor": "bipn108", "description": "Course addresses the human body’s response to exercise, addressing energy metabolism and the effects of both acute and chronic exercise on function in several important organ systems. Designing training regimes and the role of exercise in health will be considered. Prerequisites: BIPN 100 and BIBC 102 or CHEM 114B.", "prereqs": {"type": "all", "courses": ["BIPN 100", {"type": "one", "courses": ["BIBC 102", "CHEM 114B"]}]}}
{"code": "BIPN 120", "title": "Endocrinology", "units": "4", "anchor": "bipn120", "description": "Normal function and diseases of the major hormone systems of the body including the hypothalamus/pituitary axis, the thyroid gland, reproduction and sexual development, metabolism and the pancreas, bone and calcium metabolism, and the adrenal glands. Students may not receive credit for both BIPN 120 and BICD 150. Prerequisites: BIPN 100.", "prereqs": "BIPN 100"}
{"code": "BIPN 134", "title": "Human Reproduction", "units": "4", "anchor": "bipn134", "description": "Course focuses on physiological aspects of the human reproductive systems. Emphasis will be on cellular and systems physiology. Topics will include reproductive endocrinology, gametogenesis, fertilization and implantation, pregnancy and parturition, development of reproductive systems, and reproductive pathologies. Students may not receive credit for both BIPN 134 and BICD 134. Prerequisites: BIPN 100.", "prereqs": "BIPN 100"}
{"code": "BIPN 140", "title": "Cellular Neurobiology", "units": "4", "anchor": "bipn140", "description": "This course covers the biophysics of the resting and active membranes of nerve cells. It also covers the mechanisms of sensory transduction and neuromodulation, as well as the molecular basis of nerve cell function. Prerequisites: BILD 1 and BILD 2.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 2"]}}
{"code": "BIPN 142", "title": "Systems Neurobiology", "units": "4", "anchor": "bipn142", "description": "Course will cover integrated networks of nerve cells, including simple circuits like those involved in spinal reflexes. Course will study how information and motor output is integrated and processed in the brain. Course will also discuss higher-level neural processing. Prerequisites: BIPN 100 or BIPN 140.", "prereqs": {"type": "one", "courses": ["BIPN 100", "BIPN 140"]}}
{"code": "BIPN 144", "title": "Developmental Neurobiology", "units": "4", "anchor": "bipn144", "description": "Molecular basis of neuronal cell fate determination, axon pathfinding, synaptogenesis experience-based refinement of connections, and learning in the brain will be examined. Prerequisites: upper-division standing."}
{"code": "BIPN 145", "title": "Neurobiology Laboratory", "units": "4", "anchor": "bipn145", "description": "Students will gain experience with an array of methods used in modern neurobiology, including electrophysiology, optogenetics, and big data analysis. This laboratory course begins with the electric and chemical underpinnings of the nervous system and then dives into innovative techniques that we can use to study and change it. Attendance at the first lecture/lab is required. Nonattendance may result in the student being dropped from the course roster. Material lab fee will apply. Prerequisites: BILD 2 and BILD 4 and MATH 11.", "prereqs": {"type": "all", "courses": ["BILD 2", "BILD 4", "MATH 11"]}}
{"code": "BIPN 146", "title": "Computational Cellular Neurobiology", "units": "4", "anchor": "bipn146", "description": "Biophysical models of neurons and small neural circuits, including ion channels, synapses, dendrites, and neuromodulators. Analysis of neurons as nonlinear dynamical systems. This course and BIPN 147 are taught in alternate years. Prerequisites: BILD 2 and MATH 10A or MATH 20A and MATH 10B or MATH 20B and MATH 11.", "prereqs": {"type": "all", "courses": ["BILD 2", {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}, {"type": "one", "courses": ["MATH 10B", "MATH 20B"]}, "MATH 11"]}}
{"code": "BIPN 147", "title": "Computational Systems Neurobiology", "units": "4", "anchor": "bipn147", "description": "Models of neural coding and computation in the olfactory, visual, auditory, and somatosensory systems. Models of the motor system including central pattern generators, reinforcement learning, and motor cortex. Models of memory systems including working memory, long term memory, and memory consolidation. This course and BIPN 146 are taught in alternate years. Prerequisites: BILD 2 and MATH 10A or MATH 20A and MATH 10B or MATH 20B and MATH 11.", "prereqs": {"type": "all", "courses": ["BILD 2", {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}, {"type": "one", "courses": ["MATH 10B", "MATH 20B"]}, "MATH 11"]}}
{"code": "BIPN 148", "title": "Cellular Basis of Learning and Memory", "units": "4", "anchor": "bipn148", "description": "Course will explore cellular and molecular mechanisms that underlie learning and memory. Topics will include synapse formation and synaptic plasticity, neurotransmitter systems and their receptors, mechanisms of synaptic modification, and effect of experience on neuronal connectivity, and gene expression. Prerequisites: BIPN 140.", "prereqs": "BIPN 140"}
{"code": "BIPN 150", "title": "Diseases of the Nervous System", "units": "4", "anchor": "bipn150", "description": "Course will be taught from a research perspective, highlighting the biological pathways impacted by different neurological diseases. Each disease covered will be used to illustrate a key molecular/cellular pathway involved in proper neurological function. Prerequisites: BICD 100 and BIBC 102 or CHEM 114B.", "prereqs": {"type": "all", "courses": ["BICD 100", {"type": "one", "courses": ["BIBC 102", "CHEM 114B"]}]}}
{"code": "BIPN 152", "title": "The Healthy and Diseased Brain", "units": "4", "anchor": "bipn152", "description": "Covers the clinical symptoms, treatment, and molecular mechanisms of neurological, neurodevelopmental, and neuropsychiatric disorders. Emphasis on understanding methods and developing the ability to read and evaluate the scientific literature. Prerequisites: BIPN 140.", "prereqs": "BIPN 140"}
{"code": "BIPN 154", "title": "Neurobiology of Stress and Mental Disorders", "units": "4", "anchor": "bipn154", "description": "This course will focus on the neurobiological mechanisms that mediate stress-induced behavioral change in animal models and in humans. Topics will range from the effects of stress hormones on brain function, to modern techniques for examining and treating stress-induced, long-lasting mental disorders such as depression and anxiety. Prerequisites: BIPN 140.", "prereqs": "BIPN 140"}
{"code": "BIPN 156", "title": "Glial Neurobiology", "units": "4", "anchor": "bipn156", "description": "Glia outnumber neurons in the nervous system and are increasingly recognized to play essential roles. This course addresses the different classes of glia, their functions, and their interactions with neurons that make them so important. Prerequisites: BENG 140A or BIPN 100 or BIPN 140.", "prereqs": {"type": "one", "courses": ["BENG 140A", "BIPN 100", "BIPN 140"]}}
{"code": "BIPN 160", "title": "Neuroanatomy", "units": "4", "anchor": "bipn160", "description": "The course will cover a broad anatomical and functional description of the human nervous system and explore evidence implicating key brain areas in specific functions. This course will discuss modern techniques and the use of model organisms for dissecting the anatomical organization of the brain. Prerequisites: BILD 1 and BILD 2.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 2"]}}
{"code": "BIPN 162", "title": "Neural Data Science", "units": "4", "anchor": "bipn162", "description": "Project-based course in which students will use computational notebooks to perform exploratory data analyses and to test hypotheses in large neuroscience data sets, including the differences between unique neuron types, leveraging text mining of the neuroscience literature, and human neuroimaging analyses. Prerequisites: MATH 11 and BIPN 140 and BILD 62 or COGS 18 or CSE 8A. Students will use their own laptop computers.", "prereqs": {"type": "all", "courses": ["MATH 11", "BIPN 140", {"type": "one", "courses": ["BILD 62", "COGS 18", "CSE 8A"]}]}}
{"code": "BIPN 164", "title": "Computational Models and Theories in Neuroscience", "units": "4", "anchor": "bipn164", "description": "This course covers mathematical models of neurons, synapses, and neural networks. We will introduce theoretical frameworks of brain activity and function to understand neural computation and control of behavior. We will discuss network dynamics, synaptic plasticity, learning and memory. Students will apply modeling approaches to address scientific questions and make predictions for experiments. Prerequisites: MATH 10A or MATH 20A and MATH 10B or MATH 20B and MATH 11.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 10A", "MATH 20A"]}, {"type": "one", "courses": ["MATH 10B", "MATH 20B"]}, "MATH 11"]}}
{"code": "BIPN 189", "title": "Brain, Behavior, and Evolution", "units": "4", "anchor": "bipn189", "description": "This course provides a survey of natural behaviors, including birdsong, prey capture, localization, electroreception and echolocation, and the neural systems that control them, emphasizing broad fundamental relationships between brain and behavior across species. Note: Students may not receive credit for PSYC 189 and BIPN 189. Prerequisites: BILD 2 or PSYC 102 or PSYC 106.", "prereqs": {"type": "one", "courses": ["BILD 2", "PSYC 102", "PSYC 106"]}}
{"code": "BIPN 194", "title": "Advanced Topics in Modern Biology: Physiology and Neuroscience", "units": "2", "anchor": "bipn194", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Students may receive credit in 194 courses a total of four times as topics vary. Students may not receive credit for the same topic. Prerequisites: BIPN 140.", "prereqs": "BIPN 140"}
{"code": "BISP 170", "title": "Bioscholars Seminar: From Bench to Bedside and Beyond", "units": "2", "anchor": "bisp170", "description": "Course will examine different aspects of a current topic in biology and will include several speakers. Each speaker will introduce the scientific foundation of the chosen theme (“bench”), describe practical applications of their subject (“bedside”), and consider social and ethical implications of the topic (“beyond”). The theme of the course will vary from year to year, and speakers will come from a variety of disciplines relevant to the theme. May be taken for credit three times. Prerequisites: BILD 1 and BILD 2.", "prereqs": {"type": "all", "courses": ["BILD 1", "BILD 2"]}}
{"code": "BISP 182", "title": "Cooperative Education and Analysis", "units": "2 or 4 or 6", "anchor": "bisp182", "description": "Students participating in the Biological Sciences Co-Op Program will meet with course instructors and fellow students to discuss their learning outcomes and progress of projects they are assigned at their co-op position with a life sciences company. At the end of the course, students will give a formal presentation outlining their co-op project and will complete a written assignment designed for course instructors to evaluate their co-op experience. Prerequisites: BILD 82.", "prereqs": "BILD 82"}
{"code": "BISP 191", "title": "Biology Transfers: Strategies for Success", "units": "1", "anchor": "bisp191", "description": "Course is designed to assist new transfers in making a smooth and informed transition from community college. Lectures focus on study skills, academic planning and using school and campus resources to help achieve academic, personal and professional goals. Exercises and practicums will develop the problem-solving skills needed to succeed in biology. Attention will be given to research possibilities. Intended for new transfers. Prerequisites: upper-division standing."}
{"code": "BISP 192", "title": "Senior Seminar in Biology", "units": "1", "anchor": "bisp192", "description": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in biology (at the upper-division level). Topics will vary from quarter to quarter. Senior Seminars may be taken for credit up to four times, with a change in topic and permission of the department. Enrollment is limited to twenty students, with preference given to seniors. Prerequisites: upper-division standing; department stamp and/or consent of instructor."}
{"code": "BISP 193", "title": "Biology Education Research", "units": "2 or 4", "anchor": "bisp193", "description": "Individual research on a problem in biology education by special arrangement with and under the direction of a faculty member. Projects are expected to involve novel research that examines issues in biology education such as the science of learning, evidence of effective teaching, and equity and inclusion in the classroom. P/PN grades only. May be taken for credit five times. Prerequisites: department approval required. Enrollment is via department approval only. Students must complete a special studies application as well as a research plan. Paperwork for a BISP 193 must be submitted to SIS by all published deadlines as listed on the biology web page."}
{"code": "BISP 194", "title": "Advanced Topics in Modern Biology", "units": "2", "anchor": "bisp194", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Students may receive credit in 194 courses a total of four times as topics vary. Students may not receive credit for the same topic. Prerequisites: BICD 100; upper-division standing.", "prereqs": "BICD 100"}
{"code": "BISP 195", "title": "Undergraduate Instructional Apprenticeship in Biological Sciences", "units": "4", "anchor": "bisp195", "description": "Under the supervision of an instructor, student apprentices will assist in the instruction of a biology course. The purpose of the apprenticeship is to learn the methodology of teaching biology, at the college level, through theory and actual practice in a regularly scheduled course. Limited to upper-division students with a 3.0 GPA or higher. Students must apply the quarter preceding the quarter in which BISP 195 will be completed. Applications are reviewed by instructors, and assignments are made based on school need. P/NP grades only. May be taken for credit two times. Prerequisites: school approval required. (Note: Students must apply to the school as an undergraduate instructional apprentice and be reviewed by instructors via the online system). This course may be counted toward upper-division electives for a biology major."}
{"code": "BISP 196", "title": "Honors Thesis in Biological Sciences", "units": "4", "anchor": "bisp196", "description": "Course for student participants in the senior Honors thesis research program. Students complete individual research on a problem by special arrangement with, and under the direction of, a faculty member. Projects are expected to involve primary, experimental/analytical approaches that augment training in basic biology and that echo the curricular focus of the School of Biological Sciences. P/NP grades only. May be taken for credit three times. Research to be approved by Honors thesis faculty adviser via application. Note: Students must apply to the school via the online system. For complete details, applications, and deadlines, please consult the School of Biological Sciences website. Application deadlines are strictly enforced. Prerequisites: students must have senior standing; 3.6 overall and major GPA or above. Research must be approved by Honors thesis faculty adviser. Enrollment in this course is for those students participating in the Honors Program in Biological Sciences and is via department approval only."}
{"code": "BISP 197", "title": "Biology Internship Program", "units": "2 or 4", "anchor": "bisp197", "description": "Individual research on a problem by special arrangement with, and under the direction of, a UC San Diego faculty member and a selected researcher in industry or at a research institution. Projects are expected to involve primary, experimental/analytical approaches that augment training in basic biology and that echo the curricular focus of the School of Biological Sciences. Application deadlines are strictly enforced. Consult the School of Biological Sciences website for deadlines. Students must comply with all risk management policies/procedures. P/NP grades only. May be taken for credit three times. Prerequisites: department approval required. Students must complete at least ninety units of credit and have a minimum GPA of 2.5. A completed and approved application/research plan/learning agreement is required for enrollment."}
{"code": "BISP 198", "title": "Directed Group Study", "units": "1 to 4", "anchor": "bisp198", "description": "Investigation of a topic in biological sciences through directed reading and discussion by a small group of students under the supervision of a faculty member. P/NP grades only. May be taken for credit two times. Prerequisites: department approval required. Enrollment is via department approval only. Students must complete a special studies application. Paperwork for a BISP 198 must be submitted to SIS by Friday of the eighth week of the quarter preceding the quarter in which the 198 will be completed."}
{"code": "BISP 199", "title": "Individual Research for Undergraduates", "units": "2 or 4", "anchor": "bisp199", "description": "Individual research on a problem by special arrangement with, and under the direction of, a faculty member. Projects are expected to involve primary, experimental/analytical approaches that augment training in basic biology and that echo the curricular focus of the School of Biological Sciences. P/NP grades only. May be taken for credit five times. Note: Students must apply to the school via the online system. For complete details, applications, and deadlines, please consult the School of Biological Sciences website. Application deadlines are strictly enforced. Prerequisites: department approval required. Students must complete at least ninety units of credit and have a minimum GPA of 2.5."}
{"code": "BGGN 200", "title": "Graduate School Fundamentals: Introduction to Graduate Studies in the School of Biological Sciences", "units": "2", "anchor": "bggn200", "description": "Course will cover fundamental issues in academia, including campus resources, research design, ethical issues in research, scientific publishing and review, grant preparation, etc. Required of all first-year doctoral students in the School of Biological Sciences. S/U grades only. Prerequisites: graduate (PhD) standing only; for students in the following major code BI77, or consent of instructor. (F)"}
{"code": "BGGN 201", "title": "Methods in Computational Neuroscience", "units": "3", "anchor": "bggn200", "description": "Introduction to the computational methods most frequently used in neuroscience research. Aimed at first-year graduate students in neuroscience and related disciplines. Minimal quantitative background will be assumed. Topics include Poisson processes, Markov Chains, auto- and cross-correlation analysis, Fourier/Spectral analysis, principal components/linear algebra, signal detection theory, information theory, Bayes Theorem, hypothesis testing. Nongraduate students may enroll with consent of instructor."}
{"code": "BGGN 202", "title": "Professional Development for Biologists", "units": "2", "anchor": "bggn200", "description": "Discussions cover professional preparation for future scientists. Topics include how to read/write/publish papers, to write grant and fellowship proposals, to give oral presentations, and how to apply for research positions. Behind-the-scenes look at reviewing papers, grant and fellowship proposals. Discussions of career options in biological sciences will be included. Scientific content is in the area of eukaryotic gene expression, but knowledge is applicable to all areas of biology. Undergraduate students with senior standing may enroll with consent of instructor."}
{"code": "BGGN 203", "title": "Topics in Ecology, Behavior, and Evolution", "units": "3", "anchor": "bggn200", "description": "The course teaches different topics on theory and key concepts in ecology, behavior, and evolution. Students will read materials in depth, attend weekly discussions, and explore relevant topics, theories, and models with advanced analytical tools. S/U grades only. May be taken for credit three times when topics vary."}
{"code": "BGGN 204", "title": "Topics in Community and Population Ecology", "units": "3", "anchor": "bggn200", "description": "This course teaches a different topic each quarter on the theoretical or conceptual side of community and population ecology. Students will read materials in depth, attend weekly discussions, and explore theories and models with statistical, analytical, and algorithmic tools of the trade. S/U grades only. Prerequisites: graduate standing or consent of instructor."}
{"code": "BGGN 205", "title": "Communicating Science", "units": "2", "anchor": "bggn200", "description": "Learn effective ways of communicating science in both written and verbal form. Develop an understanding of how to effectively present science for different audiences, including writing for grants and papers, figure generation, and oral presentations. S/U grades only. Prerequisites: graduate standing. Enrollment restricted to the following major codes: BI77 and BI78."}
{"code": "BGGN 206A", "title": "Concepts of Reasoning and Experimentation", "units": "CORE", "anchor": "bggn206a", "description": "This course focuses on key concepts and the methods and logic used to ask and answer challenging biological questions. Course work will be organized around fundamental topics in molecular and cell biology and focus on problem solving, research articles, and/or research seminars to examine best practices in making reasoned scientific arguments and using logical experimental design to tackle biological problems, particularly at the molecular and cellular level. Enrollment restricted to the following major codes: BI77 and BI78."}
{"code": "BGGN 206B", "title": "Concepts of Reasoning and Experimentation", "units": "CORE", "anchor": "bggn206b", "description": "This course focuses on key concepts and the methods and logic used to ask and answer challenging biological questions. Course work will be organized around fundamental topics in genetics and multicellular and population biology, with a focus on problem solving, research articles, and/or research seminars to examine best practices in making reasoned scientific arguments and using logical experimental design to tackle biological problems, particularly at the multicellular and organismal level. Letter grade only. Prerequisites: BGGN 206A. Enrollment restricted to the following major codes: BI77 and BI78.", "prereqs": "BGGN 206A"}
{"code": "BGGN 207", "title": "Scientific Ethics", "units": "1", "anchor": "bggn207", "description": "(Cross-listed with SOMI 226.) Lectures, reading, and discussions about the responsible conduct and reporting of research, working with others in science, and social responsibilities; the course is designed as an option for meeting current federal regulations. S/U grades only. Enrollment restricted to PhD students only in the following major codes: BI77 and BI78. Students should review the following web page prior to enrollment: https://ethics.ucsd.edu/courses/ethics/index.html. Biology PhD students should enroll during spring of year two."}
{"code": "BGGN 208", "title": "Biological Sciences Graduate Boot Camp", "units": "4", "anchor": "bggn207", "description": "Intensive lecture-, seminar-, and laboratory-based course for incoming first year students in the biological sciences doctoral program. Topics covered: evolution and quantitative biology, including biostatistics, image analysis, bioinformatics, genomics, evolution, analysis of DNA proteins. During the first two weeks in September, students commit to ten to fifteen hours per day. S/U grades only. Prerequisites: graduate (PhD) standing only; for students in the following major code BI77."}
{"code": "BGGN 209", "title": "Social Issues in Biology", "units": "2", "anchor": "bggn207", "description": "This discussion course covers historical and contemporary readings about controversial issues related to biology and social responsibility of scientists. S/U grades only."}
{"code": "BGGN 210", "title": "Neurobiology Boot Camp", "units": "4", "anchor": "bggn207", "description": "For incoming doctoral students in neurobiology, computational neurobiology, and neurosciences. During first two weeks in September, students commit to ten to fifteen hours per day in lectures and laboratories in electrophysiology, cellular anatomy, molecular biology, optical imaging, and computational neurobiology. Students also attend weekly seminars during fall quarter. Prerequisites: graduate standing; major codes BI77, BI79, NE75."}
{"code": "BGGN 211", "title": "Recent Advances and Experimental Approaches in Modern Biology", "units": "4", "anchor": "bggn207", "description": "Introduces students to advanced concepts of modern biology (e.g., molecular and cell biology, biochemistry, genomics, and epigenomics, etc.). Current experimental approaches (including high-throughput sequencing, microarray technology, RNAi, proteomic technologies, ChIP-seq) are discussed using primary research papers. The course provides training in critical analysis of scientific papers, data interpretation, scientific writing, and experimental design. Letter grades only. Enrollment restricted to MS students only in the following major code: BI84, BI87."}
{"code": "BGGN 212", "title": "Introduction to Quantitative Evolutionary Biology", "units": "4", "anchor": "bggn207", "description": "The goal of the course is to provide an introduction to modern evolutionary biology using quantitative approaches. The course will focus on mathematical modeling, experimental, and genomic approaches to study evolution."}
{"code": "BGGN 213", "title": "Foundations of Bioinformatics", "units": "4", "anchor": "bggn207", "description": "This course provides a hands-on introduction to the computer-based analysis of genomic and biomolecular data. Major topics include sequencing technologies, genome informatics, structural bioinformatics, and transcriptomics. Students completing this course will be able to evaluate new genomic and biomolecular information using existing software and will have experience in combining bioinformatic approaches to answer biological questions. Enrollment restricted to the following major codes: BI77, BI78, and BS75. Course limited to PhD level students."}
{"code": "BGGN 214", "title": "Introduction to Q-Biology", "units": "4", "anchor": "bggn207", "description": "The course goal is to discuss and work through examples where quantitative biology approaches were necessary to yield novel biological insights. Problems will be presented with a historic perspective to instill a philosophy for when, how, and why q-bio approaches are most effective. The course may also appeal to physics and engineering graduate students. Prerequisites: graduate standing or consent of instructor."}
{"code": "BGGN 215", "title": "Applied Bioinformatics Lab", "units": "4", "anchor": "bggn207", "description": "Genomics and other “-omics” approaches are key tools for biology and medicine. This course provides a hands-on introduction to the computer-based analysis of genomic and biomolecular data. Students completing this course will be able to apply existing software to real bioinformatic data sets and combine approaches to interpret data and answer specific biological questions. Enrollment restricted to MS students in the following major code: BI84, BI87. Students will use their own laptops."}
{"code": "BGGN 216", "title": "Graduate Biostatistics", "units": "4", "anchor": "bggn207", "description": "Fundamentals behind and practical application of biostatistics, including central tendency and variability, hypothesis testing, bootstrap methods, inferential techniques (parametric and nonparametric), correlation and regression, and multiple comparison correction. Training in the use of MATLAB, which students will use to demonstrate how experimental design, sample selection, and analysis methods impact validity and reproducibility of research. Enrollment restricted to the following major codes: BI77 and BI78. Students will use their own laptop computers."}
{"code": "BGGN 218", "title": "Principles of Drug Development and Pharmacology", "units": "4", "anchor": "bggn207", "description": "Introduction to core concepts in drug development along with principles of pharmacokinetics, systems pharmacology, and toxicology. Examples of additional topics include origin and history of pharmacology, advertising versus science, and political influence on access to drugs. Enrollment restricted to MS/PhD students only in the following major codes: BI84, BI87, BI77, BI78."}
{"code": "BGGN 220", "title": "Graduate Molecular Biology", "units": "4", "anchor": "bggn207", "description": "Provides a broad, advanced-level coverage of modern molecular biology for graduate students. Topics include gene structure and regulation, chromatin structure, mechanisms of transcription, RNA processing, translation, and turnover. The format includes lectures and discussion of selected papers. Letter grades only."}
{"code": "BGGN 222", "title": "Graduate Cell Biology", "units": "4", "anchor": "bggn207", "description": "Coverage of modern cell biology. Topics will be chosen from the following: the structure and function of membranes; endocytosis; protein targeting; intracellular organelles, including the nucleus, ER, Golgi; the cytoskeleton and molecular motors; mitosis and cell division; autophagy; cell death; cell signaling; cell-cell interactions. The course will include discussions on molecular approaches to cell biology as well as dissecting interconnections between cell biology and disease. Letter grades only."}
{"code": "BGGN 223", "title": "Graduate Genetics", "units": "4", "anchor": "bggn207", "description": "Advanced coverage of classical and cutting-edge genetic technologies in a wide variety of organisms—bacteria, plants, insects, worms, fish, and mammals. The power of genetic approaches to provide fundamental insights into important questions in development, physiology, behavior, medicine, and evolution. Course format centered on discussion of research papers with genetic analysis at their core. Emphasis on exploring essential genetic concepts, principles, and mechanisms throughout biology. Letter grades only."}
{"code": "BGGN 225", "title": "Graduate Immunology", "units": "4", "anchor": "bggn207", "description": "The course is devoted to immunology and is organized as a combined lecture-tutorial course stressing classical as well as current literature. Each week will compose an independent section. Topics will include cellular interactions involved in the immune response and the molecular biology unique to lymphoid factor and receptors. Prerequisites: open only to students enrolled in a graduate degree program. Letter grades only."}
{"code": "BGGN 226", "title": "Graduate Animal Virology", "units": "4", "anchor": "bggn207", "description": "This course consists of a review of fundamental concepts together with an in-depth analysis of the structure, genetics, multiplication and oncogenicity of animal viruses. Particular emphasis will be given to the DNA and RNA tumor viruses. The format of this section includes lectures and discussion of selected papers. Prerequisites: open only to students enrolled in a graduate degree program. Letter grades only."}
{"code": "BGGN 227", "title": "Graduate Topics in Plant Biology", "units": "4", "anchor": "bggn207", "description": "This course covers advanced topics in plant biology in the areas of molecular genetic developmental, and physiological biology. We will discuss plant-microbe interactions, transposable elements, protein trafficking, ion transport, and organ development. The format of this section includes lectures and discussion of selected papers. Prerequisites: open only to students enrolled in a graduate degree program. Letter grades only."}
{"code": "BGGN 228", "title": "Graduate Developmental Biology", "units": "4", "anchor": "bggn207", "description": "This course covers graduate level lectures on developmental biology, emphasizing the use of genetically tractable model systems. Discussion of recent research articles is an integral aspect of this course. Students are introduced to classical experiments and given detailed coverage of recent fundamental findings in developmental biology. Prerequisites: open only to students enrolled in a graduate degree program. Letter grades only."}
{"code": "BGGN 230", "title": "Graduate Signal Transduction", "units": "4", "anchor": "bggn207", "description": "The course will introduce students to a variety of signal transduction pathways and their function in the regulation of cellular processes. Special emphasis will be given to signaling cascades regulating immunological responses and alterations of signaling pathways during oncogenesis. Open only to students enrolled in a graduate degree program. Letter grades only."}
{"code": "BGGN 231", "title": "Current Concepts in Stem Cell Biology", "units": "4", "anchor": "bggn207", "description": "Research papers from all aspects of stem cell biology will be read, presented, and discussed. Papers will range from landmark to current studies, spanning many developmental organisms and cell types. Students will present one paper, provide relevant background, and lead discussions. Prerequisites: graduate standing or consent of instructor."}
{"code": "BGGN 232", "title": "Innate Immunity", "units": "4", "anchor": "bggn207", "description": "The course will discuss the current understanding of innate immunity, including in organisms such as plants and invertebrates. Through readings and weekly presentations, students will learn the basic concepts of innate immunity including how immunity can be disrupted by pathogen effectors. Recent findings in these rapidly advancing fields will be covered. The course will include weekly seminar-style presentations in which each student will present once during the quarter."}
{"code": "BGGN 234", "title": "Practical Histopathology and Mouse Models of Human Disease", "units": "2", "anchor": "bggn234", "description": "(Cross-listed with PATH 234, MED 234, BIOM 238.) This course is designed to train those who need to analyze mouse models of human disease that are an essential part of their research. Sessions will include hematology, chemistry, histology, and immunohistochemistry methods used in the phenotyping assays. (Quarter offered varies and course is not offered every year.) Prerequisites: standard undergraduate biology courses."}
{"code": "BGGN 236", "title": "Advanced Glycobiology", "units": "4", "anchor": "bggn234", "description": "(Cross-listed with BIOM 222, CMM 225, MED 225, CHEM 237.) Advanced elective for graduate/medical students who have had core courses in cell biology or biochemistry. Expert faculty will present a coordinated overview of the field of glycobiology, which explores the structure, synthesis, and functions of sugar chains in biological systems."}
{"code": "BGGN 237", "title": "Quantitative Methods in Genetics", "units": "4", "anchor": "bggn234", "description": "(Cross-listed with BIOM 262, CMM 262.) This advanced problem-oriented course will examine experimental design, laboratory methods, and quantitative analytical tools used in genetic and genomic research. Students will analyze supplied data using a variety of software packages. Prerequisites: BGGN 223, or BIOM 252 and BIOM 272, or equivalent.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["BGGN 223", "BIOM 252"]}, "BIOM 272"]}}
{"code": "BGGN 238A", "title": "Integrative Microbiology I", "units": "4", "anchor": "bggn234", "description": "To introduce students with structural and functional properties of microorganisms and with the role of microbes in the world. Course will emphasize the integrative aspects of microbiology. First course in series. Prerequisites: graduate standing."}
{"code": "BGGN 238B", "title": "Integrative Microbiology II", "units": "4", "anchor": "bggn234", "description": "To introduce students with structural and functional properties of microorganisms and with the role of microbes in the world. Course will emphasize the integrative aspects of microbiology. Second course in series. Prerequisites: graduate standing."}
{"code": "BGGN 240", "title": "Neural Data Science", "units": "4", "anchor": "bggn234", "description": "Project-based course in which students will use computational notebooks to perform exploratory data analyses and to test hypotheses in large neuroscience data sets, including the differences between unique neuron types, leveraging text mining of the neuroscience literature, and human neuroimaging analyses. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be coscheduled with BIPN 162."}
{"code": "BGGN 241", "title": "Genome Science", "units": "4", "anchor": "bggn234", "description": "Genomes are the immortal agents of evolution, passing from one individual to another in an unbroken line since the origin of life. This course explores the structure of genomes, the functions of its parts on a genome scale, the mechanisms of genome change, and the applications of genomic methods and knowledge. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be coscheduled with BIMM 172."}
{"code": "BGGN 245", "title": "Advanced Topics in Cancer Research and Therapy", "units": "2", "anchor": "bggn234", "description": "Lectures on basic and advanced concepts in cancer biology, will include defining outstanding contemporary questions and cutting-edge basic and translational research. Will rely on participants reading assigned literature prior to lectures. For doctoral or master’s students. Course will be held at the Salk Institute. S/U grades only. Prerequisites: graduate standing or consent of instructor."}
{"code": "BGGN 246A", "title": "Computational Neurobiology", "units": "2", "anchor": "bggn234", "description": "Students read classic and modern papers that form the basis of the undergraduate lectures (BIPN 146), which they are encouraged to attend. Students present these papers at weekly discussion sessions. The focus of 246A is cellular neuronal properties. S/U grades only. Prerequisites: graduate standing or consent of instructor."}
{"code": "BGGN 248", "title": "Molecular Mechanisms of Neural Development", "units": "4", "anchor": "bggn248", "description": "This course will cover the cellular and molecular basis of neural development. Focus is on primary research papers and topics include neural induction and neurogenesis, cell patterning, neuronal and glial differentiation, neuronal migration, axon pathfinding, synaptogenesis, neuronal cell death, regeneration, activity-dependent events, topographic maps, invertebrate and vertebrate model systems. Prerequisites: graduate standing or consent of instructor."}
{"code": "BGGN 249A-B-C", "title": ". Basic Neuroscience", "units": "4-4-4", "anchor": "bggn248", "description": "(Cross-listed with NEU 200A-B-C.) These courses are designed for graduate students in the neurosciences and other departments that are part of the interdisciplinary program (i.e., Biology, Cognitive Science). These courses have been designed to cover as much basic neuroscience as possible in three quarters of study. These are required courses for all first-year neurosciences graduate students. Prerequisites: graduate standing or consent of instructor."}
{"code": "BGGN 250", "title": "Developmental Neurobiology", "units": "4", "anchor": "bggn248", "description": "Molecular basis of neuronal cell fate determination, axon pathfinding, synaptogenesis experience-based refinement of connections, and learning in the brain will be examined. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be coscheduled with BIPN 144."}
{"code": "BGGN 251", "title": "Computational Cellular Neurobiology", "units": "4", "anchor": "bggn248", "description": "Biophysical models of neurons and small neural circuits, including ion channels, synapses, dendrites, and neuromodulators. Analysis of neurons as nonlinear dynamical systems. Enrollment restricted to MS students only in the following major code: BI84, BI87. This course and BGGN 252 are taught in alternate years. May be coscheduled with BIPN 146."}
{"code": "BGGN 252", "title": "Computational Systems Neurobiology", "units": "4", "anchor": "bggn248", "description": "Models of neural coding and computation in the olfactory, visual, auditory, and somatosensory systems. Models of the motor system including central pattern generators, reinforcement learning, and motor cortex. Models of memory systems including working memory, long-term memory, and memory consolidation. Enrollment restricted to MS students only in the following major code: BI84, BI87. This course and BGGN 251 are taught in alternate years. May be coscheduled with BIPN 147."}
{"code": "BGGN 253", "title": "Neurobiology of Stress and Mental Disorders", "units": "4", "anchor": "bggn248", "description": "This course will focus on the neurobiological mechanisms that mediate stress-induced behavioral change in animal models and in humans. Topics will range from the effects of stress hormones on brain function, to modern techniques for examining and treating stress-induced, long-lasting mental disorders such as depression and anxiety. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be coscheduled with BIPN 154."}
{"code": "BGGN 254", "title": "Neuroanatomy", "units": "4", "anchor": "bggn248", "description": "The course will cover a broad anatomical and functional description of the human nervous system and explore evidence implicating key brain areas in specific functions. This course will discuss modern techniques and the use of model organisms for dissecting the anatomical organization of the brain. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be coscheduled with BIPN 160."}
{"code": "BGGN 255", "title": "Systems and Circuits Neuroscience", "units": "4", "anchor": "bggn248", "description": "The course will cover a broad anatomical and functional description of interacting neural networks, or systems, in the brain responsible for sensory perception, internal state, and motor control. Course will discuss modern techniques and the use of model organisms for dissecting the anatomical and functional organization of the brain. Students will read current papers and are expected to participate in discussion of papers. Enrollment restricted to MS students in the following major code: BI84, BI87."}
{"code": "BGGN 257", "title": "BioClock Workshop", "units": "4", "anchor": "bggn248", "description": "BioClock workshop guides students to hone skills in scientific literature evaluation and science communication. Students work collaboratively to produce creative educational materials that will enhance understanding of circadian biology for general audiences. Course focuses on investigation and explanation of findings from primary literature in circadian biology as it relates to neurobiology, physiology, metabolism, agriculture, and ecology. Enrollment restricted to MS students only in the following major code: BI84, BI87. Products of the workshop will be distributed widely to enhance undergraduate curricula and public outreach."}
{"code": "BGGN 259", "title": "Quantitative Physiology", "units": "2", "anchor": "bggn248", "description": "This course focuses on quantitative biology above the single cell level, from multicellular interactions to organs, organisms, and their physiology. Topics to be addressed include collective cell migration, developmental biology, organ systems, the microbiome, microbial communities, and embryology. Quantitative methods for data collection and analysis will be considered, along with use of mathematical and biophysical modeling. S/U grades only. Enrollment restricted to PhD students in the following major codes: BI77, BI78, BI83, BS75, BS80, CH75, CH81, BE75, BE80, BF78, PY75, PY76, PY81. May be taken for credit up to two times."}
{"code": "BGGN 260", "title": "Neurodynamics", "units": "4", "anchor": "bggn248", "description": "Introduction to the nonlinear dynamics of neurons and simple neural systems through nonlinear dynamics, bifurcation theory, and chaotic motions. The dynamics of single cells is considered at different levels of abstraction, e.g., biophysical and “reduced” models for analysis of regularly spiking and bursting cells, their dynamical properties, and their representation in phase space. Laboratory exercises will accompany the lectures. Duplicate credit not allowed for cross-listed courses: BGGN 260, BENG 260, and PHYS 279. Prerequisites: graduate level or consent of instructor."}
{"code": "BGGN 262", "title": "3-D Cryo-Electron Microscopy of Macromolecules and Cells", "units": "4", "anchor": "bggn262", "description": "The resolution revolution in cryo-electron microscopy has made this a key technology for the high-resolution determination of structures of macromolecular complexes, organelles, and cells. The basic principles of transmission electron microscopy, modern cryo-electron microscopy, image acquisition, and 3-D reconstruction will be discussed. Examples from the research literature using this state-of-the-art technology will also be discussed. May be coscheduled with BIMM 162. Students may not receive credit for BGGN 262 and CHEM 265."}
{"code": "BGGN 266", "title": "Advanced Laboratory in Biophysical Techniques", "units": "6", "anchor": "bggn262", "description": "Experiments that emphasize biophysical principles through hands-on experience, with an emphasis on the blending of physical measurements with a clearly identified biological problem. Exercises include the use of optical tweezers to measure viscous forces at the level of cellular organelles, the characterization of sensorimotor control in the fly during visually guided flight, and the use of microscopic imaging techniques to characterize cell motility and organelle transport. Includes instruction in LabView. Students are encouraged to attend the PHYS 173 undergraduate lectures. Prerequisites: graduate standing or consent of instructor. PHYS 120A, BILD 1, and CHEM 6CL for undergraduates."}
{"code": "BGGN 267", "title": "Computational Models and Theories in Neuroscience", "units": "4", "anchor": "bggn262", "description": "This course covers mathematical models of neurons, synapses, and neural networks. We will introduce theoretical frameworks of brain activity and function to understand neural computation and control of behavior. We will discuss network dynamics, synaptic plasticity, learning and memory. Students will apply modeling approaches to address scientific questions and make predictions for experiments. Enrollment restricted to students only in the following major codes: BI77, BI78, BI80, BI81, BI82, BI83, BI84, BI85, BI86, BI87."}
{"code": "BGGN 270", "title": "Master of Science Fundamentals", "units": "2", "anchor": "bggn262", "description": "Course will cover fundamental issues in academia, including campus resources, research design, ethical issues in research, scientific publishing, and how to write and defend an MS thesis. Issues related to diversity and inclusion, science communication, mentorship, and possible career paths will also be discussed. This course will also offer opportunities for community building and networking among the current MS students and program alumni. S/U grades only. Enrollment restricted to MS students only in the following major codes: BI84, BI87."}
{"code": "BGGN 271", "title": "Advanced Experimental Methods in Biology", "units": "4–12", "anchor": "bggn262", "description": "Advanced laboratory and/or field experience in contemporary biological methodology. Open only to students enrolled in the integrated BS/MS program. Letter grades only. Open to students in the following major codes: BI84, BI87. May be taken for credit up to eight times. Prerequisites: consent of instructor and approval of school chair."}
{"code": "BGGN 272", "title": "Learning Theories", "units": "4", "anchor": "bggn262", "description": "Introduction to classic and contemporary research on learning in biology and related science, technology, engineering, and mathematics disciplines. Through discussion of primary literature, students will systematically examine research in learning theories from a wide range of perspectives, such as behavioral, cognitive, constructivist, sociocultural, critical, and other emerging perspectives. Enrollment restricted to BI87."}
{"code": "BGGN 280", "title": "Advanced Topics in Modern Biology: Biochemistry", "units": "2", "anchor": "bggn280", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be taken for credit up to four times. Students may receive credit only once for BGGN 280 on a given topic. May be coscheduled with BIBC 194. Students may not receive credit for BGGN 280 on the same topic taken previously as BIBC 194."}
{"code": "BGGN 281", "title": "Advanced Topics in Modern Biology: Cellular Development", "units": "2", "anchor": "bggn281", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be taken for credit up to four times. Students may receive credit only once for BGGN 281 on a given topic. May be coscheduled with BICD 194. Students may not receive credit for BGGN 281 on the same topic taken previously as BICD 194."}
{"code": "BGGN 282", "title": "Advanced Topics in Modern Biology: Ecology, Behavior, and Evolution", "units": "2", "anchor": "bggn282", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be taken for credit up to four times. Students may receive credit only once for BGGN 282 on a given topic. May be coscheduled with BIEB 194. Students may not receive credit for BGGN 282 on the same topic taken previously as BIEB 194."}
{"code": "BGGN 283", "title": "Advanced Topics in Modern Biology: Molecular Biology", "units": "2", "anchor": "bggn283", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be taken for credit up to four times. Students may receive credit only once for BGGN 283 on a given topic. May be coscheduled with BIMM 194. Students may not receive credit for BGGN 283 on the same topic taken previously as BIMM 194."}
{"code": "BGGN 284", "title": "Advanced Topics in Modern Biology: Physiology and Neuroscience", "units": "2", "anchor": "bggn284", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be taken for credit up to four times. Students may receive credit only once for BGGN 284 on a given topic. May be coscheduled with BIPN 194. Students may not receive credit for BGGN 284 on the same topic taken previously as BIPN 194."}
{"code": "BGGN 285", "title": "Advanced Topics in Modern Biology", "units": "2", "anchor": "bggn285", "description": "Course will vary in title and content. Students are expected to actively participate in course discussions, read, and analyze primary literature. Current descriptions and subtitles may be found on the Schedule of Classes and the School of Biological Sciences website. Enrollment restricted to MS students only in the following major code: BI84, BI87. May be taken for credit up to four times. Students may receive credit only once for BGGN 285 on a given topic. May be coscheduled with BISP 194. Students may not receive credit for BGGN 285 on the same topic taken previously as BISP 194."}
{"code": "BGGN 290", "title": "Advances in Cellular and Molecular Mechanisms", "units": "1", "anchor": "bggn290", "description": "Students present and discuss papers on recent discoveries involving basic mechanistic research into biological phenomena. Papers are selected by instructors from visiting seminar speaker’s research from the biological sciences and biochemistry seminar series. S/U grades only. Prerequisites: graduate (PhD) standing only; for students in the following major code BI77, or consent of instructor."}
{"code": "BGGN 292", "title": "Professional Pathways in Biological Sciences", "units": "1", "anchor": "bggn292", "description": "Students meet experienced science professionals from a wide variety of backgrounds, including academia, science industry, and allied roles. Through discussions with these professionals, students will refine and improve their professional skills, including communication and presentation expertise, and develop a personal career action plan. S/U grades only. Prerequisites: graduate (PhD) standing only; for students in the following major code BI77; or consent of instructor."}
{"code": "BGGN 293", "title": "Scientific Writing in Biology", "units": "4", "anchor": "bggn292", "description": "This course offers training in writing about students’ own research; presenting the background to their thesis, preparing a figure, analyzing, and discussing data in a written form. Using published literature on scientific writing, students will practice revising their own writing and providing constructive feedback to their peers. Letter grades only. Enrollment restricted to MS students only in the following major code: BI84, BI87."}
{"code": "BGGN 295", "title": "Scientific Presentation in Biology", "units": "4", "anchor": "bggn292", "description": "Students learn effective ways of presenting their research to biologists and to the general public. Examples of posters and research talks will be analyzed and discussed. Students will practice presentations of their research as well as write about their findings for grant reviewers and nonscientist audiences. As a final project, students will prepare and present a poster of their research in the Biological Sciences Student Research Showcase. Letter grades only. Enrollment restricted to MS students only in the following major code: BI84, BI87."}
{"code": "BGGN 297", "title": "Research Conference", "units": "1–3", "anchor": "bggn292", "description": "Group and individual discussion of research activities and of current literature. S/U grades only. Prerequisites: graduate standing."}
{"code": "BGGN 298", "title": "Laboratory Projects in Biology", "units": "3–12", "anchor": "bggn292", "description": "An introduction to contemporary laboratory techniques and research interests through independent, original projects under the direction of individual faculty members. S/U grades only. Open to students in the following major codes: BI77, BI78."}
{"code": "BGGN 299", "title": "Thesis Research in Biology", "units": "1–12", "anchor": "bggn292", "description": "Directed research on dissertation topic. S/U grades only. Open to students in the following major codes: BI77, BI78, BI80, BI81, BI82, BI83, BI85, BI86. Prerequisites: graduate standing."}
{"code": "BGGN 500", "title": "Introduction to College Biology Education", "units": "4", "anchor": "bggn292", "description": "Through interactive discussions, students will explore topics such as how people learn, evidence-based teaching practices, professional ethics, and equity and inclusion in the classroom. Students will also participate in apprentice teaching under mentorship of faculty. S/U grades only. Prerequisites: department approval required. Enrollment restricted to biological sciences graduate students."}
{"code": "BGJC 204", "title": "Cellular and Molecular Immunology", "units": "1", "anchor": "bggn292", "description": "Weekly presentations and discussions pertaining to research results reported in recently published literature. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGJC 207", "title": "Journal Club in Neurobiology", "units": "1", "anchor": "bggn292", "description": "Weekly presentations and discussions pertaining to research results reported in recently published literature. S/U grades only. May be taken for credit sixteen times. Prerequisites: graduate standing or consent of instructor."}
{"code": "BGJC 208", "title": "Journal Club in Plant Molecular Biology", "units": "1", "anchor": "bggn292", "description": "Weekly presentations and discussions pertaining to research results reported in recently published literature. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGJC 213", "title": "Journal Club in Computational Neurobiology", "units": "1", "anchor": "bggn292", "description": "Weekly presentations and discussions pertaining to research results reported in recently published literature. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGJC 215", "title": "Journal Club in Biology Education Research", "units": "1", "anchor": "bggn292", "description": "Weekly presentations and discussions pertaining to research results reported in recently published literature. S/U grades only. May be taken for credit up to five times."}
{"code": "BGRD 200", "title": "Research Discussion", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Undergraduates enrolled in BISP 193, 196, or 199 may be authorized to enroll."}
{"code": "BGRD 205", "title": "Research Discussion in Plant Membrane Biology", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 207", "title": "Research Discussion in Neuronal Pattern Generation", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 210", "title": "Research Discussion in Virology", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 211", "title": "Research Discussion in Developmental Cellular Neurobiology", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 212", "title": "Research Discussion in Behavior and Development of Simple Nervous Systems", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 213", "title": "Research Discussion in Golgi Structure and Function", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 216", "title": "Research Discussion in Molecular and Cell Biology", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 218", "title": "Research Discussion in Plant Molecular Genetics", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 221", "title": "Research Discussion in Behavioral Ecology", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 222", "title": "Research Discussion in Evolutionary Molecular Ecology", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199. "}
{"code": "BGRD 230", "title": "Research Discussion in Cell Signaling Pathways", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 231", "title": "Research Discussion in Nuclear Transport and Function", "units": "1", "anchor": "bggn292", "description": "Presentations of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGRD 234", "title": "Research Discussion in Cell Signaling in Drosophila", "units": "3", "anchor": "bggn292", "description": "Presentation of new research results and discussions of closely related published reports. All students are expected to report on their own research findings each quarter. S/U grades only. May be taken for credit sixteen times. Prerequisites: none for graduate students. Undergraduates must be seniors or enrolled in BISP 199."}
{"code": "BGSE 200", "title": "Seminar in Biology", "units": "1", "anchor": "bggn292", "description": "Invited speakers from the United States and abroad, who are leaders in various aspects of biological research, describe their current research. S/U grades only. Restricted to students in major codes BI84, BI87. Undergraduates must be seniors or enrolled in BISP 199. May be repeated for credit sixteen times."}
{"code": "BGSE 205", "title": "Graduate Research Seminar", "units": "1", "anchor": "bggn292", "description": "Discussions of recent research in various aspects of biological sciences conducted by doctoral students in the School of Biological Sciences. S/U grades only. Enrollment restricted to the following major codes: BI77, BI78, BI80, BI81, BI82, BI83, BI85, BI86. May be taken for credit up to twenty times."}
