{"code": "BIOM", "name": "Biomedical Sciences", "link": "https://catalog.ucsd.edu/courses/BIOM.html"}
{"code": "BIOM 200A", "title": "Molecules to Organisms: Concepts", "units": "6", "anchor": "biom200a", "description": "This course provides a systematic approach to current biomedical research, using analysis of selected topics to focus on the process of research discovery and its critical evaluation. The course progresses through five thematic modules that cover genes, building a cell, cellular responses, organogenesis, and the processes that allow survival in the world. Prerequisites: limited to BMS graduate students except by consent of instructor."}
{"code": "BIOM 200B", "title": "Molecules to Organisms: Approaches", "units": "2", "anchor": "biom200b", "description": "Students will critically evaluate classic and current research papers in biomedical research, in addition to being exposed to state-of-the-art technologies in research. Prerequisites: limited to BMS graduate students except by consent of instructor."}
{"code": "BIOM 201", "title": "Seminars in Biomedical Research", "units": "4", "anchor": "biom201", "description": "This course includes attendance at seminars in the biomedical sciences and is designed to provoke critical discussion of the presented findings and scientific approaches in a small-group setting. Prerequisites: limited to BMS graduate students except by consent of instructor."}
{"code": "BIOM 202", "title": "Biomedical Sciences Research Rotation", "units": "3", "anchor": "biom202", "description": "Laboratory rotations provide first-year students with experience in the various experimental methods used in biomedical sciences. Prerequisites: limited to BMS graduate students except by consent of instructor. (F,W,S)"}
{"code": "BIOM 209", "title": "Lipid Cell Signaling Genomics, Proteomics, and Metabolomics", "units": "2", "anchor": "biom209", "description": "Overview of new systems biology “omics” approaches to lipid metabolism and cell signaling including interrogating gene and lipid databases, techniques for lipidomics, and implications for profiling and biomarker discovery in blood and tissues relevant to inflammatory and other human diseases. Recommended: one quarter of undergraduate biochemistry. Prerequisites: none."}
{"code": "BIOM 218", "title": "Current Topics in Anthropogeny", "units": "1", "anchor": "biom218", "description": "Participation in the symposia held by CARTA three times a year. Students shadow one of the speakers during public and private symposia. Students meet after each symposium and each writes a summary of the speaker’s presentation and ensuring discussion. Prerequisites: graduate standing required."}
{"code": "BIOM 219", "title": "Ethics in Scientific Research", "units": "1", "anchor": "biom219", "description": "Overview of ethical issues in scientific research, conflicts of interest; national, statewide and campus issues and requirement; ethical issues in publications; authorship; retention of research records; tracing of research records; attribution; plagiarism; copyright considerations; primary, archival and meeting summary publications; ethical procedures and policies; NIH, NSF, California and UC San Diego; case studies and precedents in ethics. Prerequisites: consent of instructor."}
{"code": "BIOM 222", "title": "Essentials of Glycobiology", "units": "2", "anchor": "biom222", "description": "Advanced elective for graduate/medical students who have had core courses in cell biology or biochemistry. Expert faculty will present a coordinated overview of the field of glycobiology, which explores the structure, synthesis, and functions of sugar chains in biological systems."}
{"code": "BIOM 224", "title": "Topics in Cancer Research", "units": "2", "anchor": "biom224", "description": "Each quarter will focus on an important area of cancer research such as immunology (fall), growth regulation (winter), and cancer genetics (spring). One-hour lecture coordinated with a one-hour seminar with the opportunity to meet with the invited speaker. Prerequisites: limited to senior undergraduates, graduate students, and medical students. (W,S)"}
{"code": "BIOM 225", "title": "Introduction to Anthropogeny", "units": "2", "anchor": "biom225", "description": "An overview of the current state of research into human origins with illustration of the spatial and temporal scales: from million-year-old phylogenies to millisecond physiological processes, and from human societies dispersed across continents to cells and molecules. Prerequisites: graduate standing required."}
{"code": "BIOM 226", "title": "Hormone Action", "units": "3", "anchor": "biom226", "description": "The course covers recent advances in research into hormone action, molecular endocrinology, lipid, lipoprotein, and carbohydrate metabolism, and reproductive medicine. Prerequisites: BIOM 200A-B, 201. Limited to BMS graduate students except by consent of instructor.", "prereqs": {"type": "all", "courses": ["BIOM 200A", "BIOM 200B", "BIOM 201"]}}
{"code": "BIOM 227", "title": "Mouse Models of Human Disease", "units": "2", "anchor": "biom227", "description": "This course provides an overview of the use of mouse models in biomedical research. Sessions will cover general mouse biology, genetics, technologies for generating mutant mice and will focus on model selection, methodological approaches, data interpretation, experimental design, and ethics of animal research. Student participation and discussion will be encouraged. Prerequisites: graduate standing or consent of instructor."}
{"code": "BIOM 228", "title": "Modern Drug Discovery Technologies", "units": "2", "anchor": "biom228", "description": "Drug discovery is an emerging science available to academic investigators. This course provides an overview of these drug discovery techniques, including high through-put screening, cell-based screening, computational methods of lead compound discovery, and chemical methods of optimization. Prerequisites: graduate student status or consent of graduate program director."}
{"code": "BIOM 229", "title": "Advanced Anthropogeny", "units": "2", "anchor": "biom229", "description": "Advanced discussions following on “Introduction to Anthropogeny.” Online “Museum of Comparative Anthropogeny (MOCA)” will serve as major scaffold for this in-depth course. MOCA (http://carta.anthropogeny.org/content/about-moca) has over 500 topics addressing uniquely human traits across twenty-four domains of knowledge and scientific disciplines. Prerequisites: BIOM 225.", "prereqs": "BIOM 225"}
{"code": "BIOM 231", "title": "Contemporary Topics in Pharmacology", "units": "2", "anchor": "biom231", "description": "A selection of short courses in the biomedical and pharmacological sciences offered by resident experts. Topics will vary annually. Each short course will last one to two weeks, meeting five hours a week. Prerequisites: consent of instructor. (F,W,S)"}
{"code": "BIOM 232", "title": "In vivo Cellular and Molecular Imaging", "units": "1", "anchor": "biom232", "description": "Strategies such as positron emission tomography, magnetic resonance imaging, and ultrasound for nondestructively imaging molecular and cell biological events inside living animals and eventually human patients. Emphasis on detecting angiogenesis, apoptosis, and expression of tumor-specific genes. Prerequisites: upper-division or graduate courses in molecular and cell biology."}
{"code": "BIOM 233", "title": "Structural Biology in Cell Signaling and Drug Discovery", "units": "2", "anchor": "biom233", "description": "This class is taught by SBMRI program faculty, whose laboratories are actively involved in determining the three-dimensional structure of complex biological entities. The course covers basic principles of crystallization, cryo-electron microscopy, and NMR, and modern techniques for Ab-initio-structural analysis. Prerequisites: graduate standing status or consent of graduate program director."}
{"code": "BIOM 234", "title": "Practical Histopathology and Mouse Models of Human Diseases", "units": "2", "anchor": "biom234", "description": "The course is designed to introduce or reintroduce histology and histopathology of the various organ systems to those who need to analyze mouse tissues as an essential part of their research. Prerequisites: standard undergraduate biology courses."}
{"code": "BIOM 235", "title": "Pharmacogenomics", "units": "3", "anchor": "biom235", "description": "This course provides an understanding of the evolving area of human genomics and correlation between an individual’s or subpopulation’s genetic makeup and their response to drugs. The information provides the student the basis for select prescribing and/or targeting drug development to improve drug therapy outcomes and reduce adverse drug responses. Prerequisites: admission to Skaggs School of Pharmacy and Pharmaceutical Sciences or BMS Program (Major Code BS75) or consent of instructor."}
{"code": "BIOM 240", "title": "Critical Reading in Cell Biology", "units": "3", "anchor": "biom240", "description": "This course will focus on critical reading and understanding current areas in cell and molecular biology. The exact topic will vary, but will include such topics as protein trafficking, cell division, intracellular movement, cell interaction, and cell cycle."}
{"code": "BIOM 242", "title": "Seminar in Genetics", "units": "1", "anchor": "biom242", "description": "Intended for graduate students interested in principles of classical and molecular genetics. Will attend weekly genetics seminar and participate in didactic/discussion preparatory session. Prerequisites: consent of instructor."}
{"code": "BIOM 246", "title": "Current Literature in Glycobiology", "units": "1", "anchor": "biom246", "description": "Informal presentations on topics of current interest in glycobiology as represented in the current scientific literature. Prerequisites: consent of instructor."}
{"code": "BIOM 252", "title": "Genetics and Genomics", "units": "3", "anchor": "biom252", "description": "This course will examine the basic principles of genetics and genomics. We will focus on classic discoveries and examples of approaches to current experimental problems. Emphasis areas will vary but general topics include Mendelian inheritance, imprinting, cytogenetics, genome structure, genetic variation, linkage and recombination, complex traits, statistical genetics, population genetics, genomic tools and methodology, medical genetics, model organisms. Prerequisites: BIOM 200A-B, 201. Limited to BMS graduate students except by consent of instructor.", "prereqs": {"type": "all", "courses": ["BIOM 200A", "BIOM 200B", "BIOM 201"]}}
{"code": "BIOM 253", "title": "Pathogens and Host Defense", "units": "3", "anchor": "biom253", "description": "This course will examine the innate and adaptive immune responses of humans to microbial infection. In parallel, we will explore the virulence mechanisms through which certain medically important viruses, bacteria, fungi, and parasites subvert host defense to produce infectious disease. Emphasis will be placed on basic molecular genetic and cellular approaches to understanding microbial pathogenesis and host susceptibility, including progress toward novel antibiotic and immune stimulatory therapies. Prerequisites: BIOM 200A-B, 201. Limited to BMS graduate students except by consent of instructor.", "prereqs": {"type": "all", "courses": ["BIOM 200A", "BIOM 200B", "BIOM 201"]}}
{"code": "BIOM 254", "title": "Molecular and Cell Biology", "units": "3", "anchor": "biom254", "description": "This course will examine the basic principles of molecular and cellular biology and their impact on medicine focusing on classic discoveries and examples of approaches to current experimental problems. Emphasis areas will vary but will include genes and genomics, chromosome biology and nuclear structure, transcriptional regulation, RNA processing, cell cycle control, cell growth and death, cell differentiation and stem cell biology, molecular motors and motility, membrane trafficking and signaling. Prerequisites: BIOM 200A-B, 201. Limited to BMS graduate students except by consent of instructor.", "prereqs": {"type": "all", "courses": ["BIOM 200A", "BIOM 200B", "BIOM 201"]}}
{"code": "BIOM 255", "title": "Molecular Basis of Drug Action and Disease Therapy", "units": "3", "anchor": "biom255", "description": "Molecular basis of drug action; basis of disease; drug invention. Topics may include: basic principles, autonomic nervous system; CV, pulmonary, diabetes, cancer therapy, pharmacotherapy of CNS disease (depression, etc.) pain, infections (bacterial, viral, malarial). Students that have taken both 255A and 255B cannot take 255 for credit. Prerequisites: BIOM 200A-B, 201. Limited to BMS graduate students except by consent of instructor.", "prereqs": {"type": "all", "courses": ["BIOM 200A", "BIOM 200B", "BIOM 201"]}}
{"code": "BIOM 256", "title": "Molecular Pathology of Cancer", "units": "3", "anchor": "biom256", "description": "This course outlines a current understanding of genetic mechanisms that underlie carcinogenesis and their impact on cell proliferation, differentiation, angiogenesis, metastasis, and survival. The topics of tumor histopathology, the tumor stem cell phenotype, and cancer drug design are also addressed. Prerequisites: limited to BMS graduate students except by consent of instructor."}
{"code": "BIOM 262", "title": "Quantitative Methods in Genetics", "units": "4", "anchor": "biom262", "description": "This advanced problem-oriented course will examine experimental design, laboratory methods, and quantitative analytical tools used in genetic and genomic research. Students will analyze supplied data using a variety of software packages. Prerequisites: BGGN 223, or BIOM 252 and BIOM 272, or equivalent.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["BGGN 223", "BIOM 252"]}, "BIOM 272"]}}
{"code": "BIOM 264", "title": "Molecular and Cellular Basis of Disease", "units": "2", "anchor": "biom264", "description": "Lectures on the molecular and cellular mechanisms of pathogenesis. Topics will include Alzheimer’s disease, cell surface and unclear receptors in disease, signal transduction by oncogenes in cancer cells, AIDS, human diseases affecting glycosylation pathways, rheumatoid arthritis, and arteriosclerosis. Prerequisites: graduate students. (W)"}
{"code": "BIOM 266", "title": "Environmental and Molecular Toxicology", "units": "4", "anchor": "biom266", "description": "Molecular and cellular mechanisms underlie the actions of environmental toxicants. This course will investigate approaches to study the impact of environmental toxicants on human health. Other modern approaches that are being implemented to detect and remediate environmental toxicants will also be examined. BGGN 256, BIOM 266 and Chem 266 students will be required to complete an additional paper and/or exam beyond that expected of students in Chem 166 and BIMM 166. Prerequisites: Chem 114A and 114B required for Chem 166 and BIBC 100 and BIBC 102 required for BIMM 166. (S)", "prereqs": {"type": "all", "courses": ["BIBC 100", "BIBC 102"]}}
{"code": "BIOM 267", "title": "Drug Discovery, Development, and Commercialization", "units": "3", "anchor": "biom267", "description": "This elective is designed to increase knowledge of the drug discovery, development, regulatory, and commercialization process. Students will have an increased understanding of how an investigational agent eventually becomes an approved drug for patient use. Lectures and a student group project will be conducted for this elective. Prerequisites: open to SSPPS, SOM, graduate Biomedical Sciences Program students and Rady School of Management graduate students."}
{"code": "BIOM 272", "title": "Seminars in Genetics", "units": "2", "anchor": "biom272", "description": "This course includes attendance at seminars in genetics and is designed to provoke critical discussion of the presented findings and scientific approaches in a small group setting. Prerequisites: limited to BMS graduate students except by consent of instructor."}
{"code": "BIOM 273", "title": "Seminars in Microbiology", "units": "2", "anchor": "biom273", "description": "This course includes attendance at seminars in microbiology and is designed to provoke critical discussion of the presented findings and scientific approaches in a small group setting. Prerequisites: limited to BMS graduate students except by consent of instructor."}
{"code": "BIOM 274", "title": "Seminars in Molecular and Cell Biology", "units": "2", "anchor": "biom274", "description": "This course includes attendance at seminars in molecular and cell biology and is designed to provoke critical discussion of the presented findings and scientific approaches in a small group setting. Prerequisites: limited to BMS graduate students except by consent of instructor."}
{"code": "BIOM 275", "title": "Seminars in Pharmacology", "units": "2", "anchor": "biom275", "description": "This course includes attendance at seminars in pharmacology and is designed to provoke critical discussion of the presented findings and the scientific approaches in a small group setting. Prerequisites: limited to BMS graduate students except by consent of instructor."}
{"code": "BIOM 276", "title": "Seminars in Physiology", "units": "2", "anchor": "biom276", "description": "This course includes attendance at seminars in physiology and is designed to provoke critical discussion of the presented findings and scientific approaches in a small group setting. Prerequisites: limited to BMS graduate students except by consent of instructor."}
{"code": "BIOM 277", "title": "Seminars in Molecular Pathology", "units": "2", "anchor": "biom277", "description": "This course presents developments in cellular and molecular pathology research ongoing in the molecular pathology division of BMS. Each session comprises three fifteen-minute presentations from different faculty members. Discussion questions are fielded during or after each presentation. Prerequisites: limited to BMS graduate students except by consent of instructor."}
{"code": "BIOM 283", "title": "Supramolecular Structure Determination Laboratory", "units": "4", "anchor": "biom283", "description": "A laboratory course combining hands-on mass spectrometry and bioinformatics tools to explore the relationship between structure and function in macromolecules. Tools for peptide sequencing, analysis of post-translational modification, and fragmentation analysis by mass spectrometry are examples of experiments students will run. Prerequisites: consent of instructor. (F,W,S)"}
{"code": "BIOM 285", "title": "Statistical Inference in the Medical Sciences", "units": "2", "anchor": "biom285", "description": "An introduction to basic techniques used in biomedical literature: t tests, ANOVA, chi-square, linear and nonlinear regression. Emphasis will be on understanding the appropriate use and interpretation of the tests, rather than on the calculations."}
{"code": "BIOM 287", "title": "Tissue Engineering Laboratory", "units": "4", "anchor": "biom287", "description": "Students will learn to conduct tissue engineering and developmental biology experiments, microfabricate cell culture systems, engineer biopolymer materials, and develop and analyze quantitative models of transport, cell fate, and growth mechanics. The understanding and manipulation of multicellular processes that comprise development and growth involves specialized areas of biomechanics, developmental biology, biomaterials, and the tools of molecular biology, as well as the integration of theory and experiment. To fabricate functional tissues, it is important to establish underlying molecular and physical mechanisms, and then control and integrate these. Prerequisites: consent of instructor. (F,W,S)"}
{"code": "BIOM 294", "title": "Pharmacology and Molecular Biology Journal Club", "units": "0–1", "anchor": "biom294", "description": "Current literature in molecular pharmacology and molecular biology is reviewed. Two papers are chosen per week for oral presentation by students. Faculty critique the student presentations. Prerequisites: enrollment in PhD program at year two and above. (F,W,S)"}
{"code": "BIOM 295", "title": "Pharmacology Research Discussions", "units": "0–1", "anchor": "biom295", "description": "Student, faculty, and fellow discussion groups on research projects. Students are expected to present research findings to fellows, other PhD students, and faculty."}
{"code": "BIOM 296", "title": "Directed Reading", "units": "1–4", "anchor": "biom296", "description": "Reading of special topics under the direction of a faculty member. Exact subject matter to be arranged in individual cases. Prerequisites: consent of instructor."}
{"code": "BIOM 297", "title": "Progress in Signal Transduction", "units": "1", "anchor": "biom297", "description": "Papers describing recent progress in signal transduction from the cell-surface to the nucleus will be chosen from recent research literature. Two papers will be discussed and criticized in detail each week for one hour. Prerequisites: graduate-level biochemistry, cell biology, and molecular biology; registered as second-year and above graduate student in biomedical sciences, biology, or chemistry. (F,W,S)"}
{"code": "BIOM 298", "title": "Directed Study", "units": "1–12", "anchor": "biom298", "description": "Reading and laboratory study of special topics under the direction of a faculty member. Exact subject matter to be arranged in individual cases. (F,W,S)"}
{"code": "BIOM 299", "title": "Independent Study or Research", "units": "1–12", "anchor": "biom299", "description": "Independent study or research. Prerequisites: consent of instructor. (F,W,S)"}
