{"code": "CAT", "name": "Culture, Art, and Technology", "link": "https://catalog.ucsd.edu/courses/CAT.html"}
{"code": "CAT 1", "title": "Culture, Art, and Technology 1", "units": "4", "anchor": "cat1", "description": "A global historical overview of principles and patterns of human development, with emphasis on technology and the arts. Traces causes and consequences of cultural variation. Explores interactions of regional environments (geographic, climatic, biological) with social and cultural forces. Prerequisites: Sixth College students only; completion of UC Entry Level Writing requirement; must be taken for a letter grade to fulfill GE requirement."}
{"code": "CAT 2", "title": "Culture, Art, and Technology 2", "units": "6", "anchor": "cat2", "description": "Fundamental shifts in one area of endeavor can have a profound impact on whole cultures. Examines select events, technologies, and works of art that revolutionized ways of inhabiting the world. Intensive instructions in university-level writing: featured sections on information literacy. Prerequisites: Sixth College students only; CAT 1; must be taken for a letter grade to fulfill GE requirement.", "prereqs": "CAT 1"}
{"code": "CAT 3", "title": "Culture, Art, and Technology 3", "units": "6", "anchor": "cat3", "description": "Students engage with various interdisciplinary modes of apprehending the near future. Working in teams on community projects, they are challenged to listen and communicate across cultures and develop cogent technological and artistic responses to local problems. Writing and information literacy instruction. Prerequisites: Sixth College students only; CAT 2.", "prereqs": "CAT 2"}
{"code": "CAT 24", "title": "Introduction to Special Projects/Topics", "units": "2 or 4", "anchor": "cat24", "description": "Lower-division students are introduced to projects/topics exploring the interplay of culture, art, and technology. Topics and projects will vary. Prerequisites: department authorization required."}
{"code": "CAT 75", "title": "Experience Art!—Sixth College Seminar Series", "units": "1", "anchor": "cat87", "description": "Seminars are hands-on arts experiences (performances, exhibits, site visits, etc.). Students and faculty attend events together and have discussions before or after, often with guest speakers such as the artists, curators, and/or faculty/graduate students from UC San Diego arts departments. Successful completion of this seminar series satisfies one unit of art making for the Sixth College general education requirements. May be taken for credit two times. Prerequisites: Sixth College students only."}
{"code": "CAT 87", "title": "First-year Student Seminar", "units": "1", "anchor": "cat87", "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students with preference given to entering first-year students. Prerequisites: none."}
{"code": "CAT 98", "title": "Culture, Art, and Technology Lower-Division Group Study", "units": "2 or 4", "anchor": "cat98", "description": "Course designated for lower-division Sixth College students to have the opportunity to work together as a group or team on a project supervised by a faculty member in a specific department, not included in a regular curriculum, where group emphasis would be more beneficial and constructive then individual special studies. Prerequisites: lower-division standing; cumulative GPA of 3.0."}
{"code": "CAT 124", "title": "Sixth College Practicum", "units": "4", "anchor": "cat124", "description": "Students initiate, plan, and carry out community-based and/or research-based projects that connect classroom-based experiences and knowledge to the outlying community, and that explicitly explore the interplay of culture, art, and technology. Prerequisites: upper-division standing; department authorization required."}
{"code": "CAT 125", "title": "Public Rhetoric and Practical Communication", "units": "4", "anchor": "cat125", "description": "Upper-division composition course in public rhetoric and practical communication, including oral presentation, writing in print formats, and digital content creation. This course also focuses on how writing can support and extend experiential learning before, during or after students do their practicum project. Prerequisites: Sixth College students only; upper-division standing."}
{"code": "CAT 125GS", "title": "Public Rhetoric and Practical Communication Global Seminar", "units": "4", "anchor": "cat125gs", "description": "Upper-division composition course in public rhetoric and practical communication, including oral presentation, writing in print formats, and digital content-creation. This course also focuses on how writing can support and extend experiential learning before, during, or after students complete their practicum. Prerequisites: upper-division standing; department authorization required."}
{"code": "CAT 125R", "title": "Public Rhetoric and Practical Communication Online", "units": "4", "anchor": "cat125r", "description": "Online upper-division writing course in public rhetoric and practical communication. Students think critically about how technologies change how we communicate in a range of genres, media, and audiences. Faculty teach practical skills and strategies for writing and communicating in diverse digital environments via recorded videos. Prerequisites: upper-division standing."}
{"code": "CAT 192", "title": "Senior Seminar in Culture, Art, and Technology", "units": "1", "anchor": "cat192", "description": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in culture, art, and technology (at the upper-division level). Topics will vary from quarter to quarter. Senior seminars may be taken for credit up to four times with a change in topic and permission of the department. Enrollment is limited to twenty students, with preference given to seniors. Prerequisites: upper-division standing; department authorization required."}
{"code": "CAT 195", "title": "Apprentice Teaching", "units": "4", "anchor": "cat195", "description": "Undergraduate instructional assistance. Responsibilities in areas of learning and instruction. May collect course material and assist with course projects, digital workshops, and collection, organization, and analysis of formative assessment data. Prerequisites: upper-division standing; 3.0 cumulative GPA; department authorization required."}
{"code": "CAT 197", "title": "Culture, Art, and Technology Field Studies", "units": "4", "anchor": "cat197", "description": "Supervised community-based or industry-based fieldwork. Designated for Sixth College students to have the opportunity to work on a community-based or industry-based project supervised by a faculty member and community or industry mentor in which the subject or content of the project cannot be represented by a specific academic department. Students will submit written evaluations each week of their ongoing field study. Prerequisites: upper-division standing; completion of CAT 1, 2, and 3 or (for transfer students) completion of general-education requirements, including lower-division writing requirement.", "prereqs": {"type": "all", "courses": ["CAT 1", "CAT 2", "CAT 3"]}}
{"code": "CAT 198", "title": "Culture, Art, and Technology Directed Group Studies", "units": "4", "anchor": "cat198", "description": "Directed group studies or, in group, field studies of a creative project. Designated for Sixth College students to have the opportunity to work together as a group or team on a project supervised by a faculty member in a specific department, not included in a regular curriculum, where group emphasis would be more beneficial and constructive than individual special studies. Prerequisites: upper-division standing; completion of CAT 1, 2, and 3 or (for transfer students) completion of general-education requirements, including lower-division writing requirement.", "prereqs": {"type": "all", "courses": ["CAT 1", "CAT 2", "CAT 3"]}}
{"code": "CAT 199", "title": "Culture, Art, and Technology Independent Studies", "units": "4", "anchor": "cat199", "description": "Individual independent research or creative project. Designated for Sixth College students to have the opportunity to work on a project supervised by a faculty member in a specific department, where the subject or content of the project cannot be represented by the academic department of the faculty member. Prerequisites: upper-division standing; completion of CAT 1, 2, and 3 or (for transfer students) completion of general-education requirements, including lower-division writing requirement.", "prereqs": {"type": "all", "courses": ["CAT 1", "CAT 2", "CAT 3"]}}
