{"code": "CSE", "name": "Computer Science and Engineering", "link": "https://catalog.ucsd.edu/courses/CSE.html"}
{"code": "CSE 3", "title": "Fluency in Information Technology", "units": "4", "anchor": "cse3", "description": "Introduces the concepts and skills necessary to effectively use information technology. Includes basic concepts and some practical skills with computer and networks. Prerequisites: none."}
{"code": "CSE 4GS", "title": "Mathematical Beauty in Rome", "units": "4", "anchor": "cse4gs", "description": "Exploration of topics in mathematics and engineering as they relate to classical architecture in Rome, Italy. In depth geometrical analysis and computer modeling of basic structures (arches, vaults, domes), and on-site studies of the Colosseum, Pantheon, Roman Forum, and St. Peter’s Basilica. Prerequisites: MATH 10A or MATH 20A; department approval, and corequisite of CSE 6GS.", "prereqs": {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}, "coreqs": "CSE 6GS"}
{"code": "CSE 6GS", "title": "Mathematical Beauty in Rome Lab", "units": "4", "anchor": "cse6gs", "description": "Companion course to CSE 4GS where theory is applied and lab experiments are carried out “in the field” in Rome, Italy. For final projects, students will select a complex structure (e.g., the Colosseum, the Pantheon, St. Peter’s, etc.) to analyze and model, in detail, using computer-based tools. Prerequisites: MATH 10A or MATH 20A; department approval, and corequisite of CSE 4GS.", "prereqs": {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}, "coreqs": "CSE 4GS"}
{"code": "CSE 6R", "title": "Introduction to Computer Science and Object-Oriented Programming: Python", "units": "4", "anchor": "cse6r", "description": "An introduction to computer science and programming using the Python language. The course will cover topics such as basic data types (e.g., integer, float, string), loops and iteration, basic data structures (e.g., list, set, dictionary), memory models, conditional statements, recursion, basic algorithm time complexity analysis, class design, and inheritance."}
{"code": "CSE 8A", "title": "Introduction to Programming and Computational Problem-Solving I", "units": "4", "anchor": "cse8a", "description": "Introductory course for students interested in computer science and programming. Basics of programming including variables, conditionals, loops, functions/methods. Structured data storage such as arrays/lists and dictionaries, including data mutation. Hands-on experience with designing, writing, hand-tracing, compiling or interpreting, executing, testing, and debugging programs. Students solve relevant computational problems using a high-level programming language. CSE 8A is part of a two-course sequence (CSE 8A-B) that is equivalent to CSE 11. Students should take CSE 8B to complete the CSE 8A-B track. Students who have taken CSE 8B or CSE 11 may not take or receive credit for CSE 8A. Students may only receive credit for one of the following: BILD 62, COGS 18, CSE 8A, or CSE 6R. Recommended preparation: No prior programming experience is assumed, but comfort using computers is helpful. Students should consult the “CSE Course Placement Advice” web page for assistance in choosing which CSE course to take first. Prerequisites: restricted to undergraduates. Graduate students will be allowed as space permits."}
{"code": "CSE 8B", "title": "Introduction to Programming and Computational Problem-Solving II", "units": "4", "anchor": "cse8b", "description": "Introductory programming using an object-oriented approach with the Java programming language. Builds on basic programming constructs introduced in CSE 8A to introduce class design and use, interfaces, basic class hierarchies, recursion, event-based programming, error reporting with exceptions, and file I/O. Basics of command-line navigation for file management and running programs. Development, testing, and debugging of more complex programs. CSE 8B is part of a two-course sequence (CSE 8A-B) that is equivalent to CSE 11. No credit offered for CSE 8B if CSE 11 taken previously. Students may not receive credit for CSE 8B and CSE 11. Students should consult the “CSE Course Placement Advice” web page for assistance in choosing which CSE course to take first Prerequisites: CSE 8A; restricted to undergraduates. Graduate students will be allowed as space permits.", "prereqs": "CSE 8A"}
{"code": "CSE 11", "title": "Introduction to Programming and Computational Problem-Solving: Accelerated Pace", "units": "4", "anchor": "cse11", "description": "Accelerated introductory programming including an object-oriented approach. Covers basic programming topics from CSE 8A including variables, conditionals, loops, functions/methods, structured data storage, and mutation. Also covers topics from CSE 8B including the Java programming language, class design, interfaces, basic class hierarchies, recursion, event-based programming, and file I/O. Basics of command-line navigation for file management and running programs. Zero units of credit offered for CSE 11 if CSE 8B taken previously or concurrently. Recommended preparation: Significant prior programming experience (for example, high school AP CSA). Students should consult the “CSE Course Placement Advice” web page for assistance in choosing a first CSE course. Prerequisites: restricted to undergraduates. Graduate students will be allowed as space permits."}
{"code": "CSE 12", "title": "Basic Data Structures and Object-Oriented Design", "units": "4", "anchor": "cse12", "description": "Use and implementation of basic data structures including linked lists, stacks, and queues. Use of advanced structures such as binary trees and hash tables. Object-oriented design including interfaces, polymorphism, encapsulation, abstract data types, pre-/post-conditions. Recursion. Uses Java and Java Collections. Prerequisites: CSE 8B or CSE 11, and concurrent enrollment with CSE 15L; restricted to undergraduates. Graduate students will be allowed as space permits.", "prereqs": {"type": "one", "courses": ["CSE 8B", "CSE 11"]}, "coreqs": "CSE 15L"}
{"code": "CSE 15L", "title": "Software Tools and Techniques Laboratory", "units": "2", "anchor": "cse15l", "description": "Hands-on exploration of software development tools and techniques. Investigation of the scientific process as applied to software development and debugging. Emphasis is on weekly hands-on laboratory experiences, development of laboratory notebooking techniques as applied to software design. Prerequisites: CSE 8B or CSE 11, and concurrent enrollment with CSE 12; restricted to undergraduates. Graduate students will be allowed as space permits.", "prereqs": {"type": "one", "courses": ["CSE 8B", "CSE 11"]}, "coreqs": "CSE 12"}
{"code": "CSE 20", "title": "Discrete Mathematics", "units": "4", "anchor": "cse20", "description": "This course will introduce the ways logic is used in computer science: for reasoning, as a language for specifications, and as operations in computation. Concepts include sets, relations, functions, equivalence relations, partial orders, number systems, and proof methods (especially induction and recursion). Propositional and predicate logic will be introduced and applied to various computer science domains such as circuit design, databases, cryptography, and program correctness. Students who have completed MATH 109 may not receive credit for CSE 20. Credit not offered for both MATH 15A and CSE 20. Equivalent to MATH 15A. Prerequisites: CSE 11 or CSE 6R or CSE 8A or CSE 8B or ECE 15. Prerequisite courses must have been completed with a grade of C– or better; restricted to undergraduates. Graduate students will be allowed as space permits.", "prereqs": {"type": "one", "courses": ["CSE 11", "CSE 6R", "CSE 8A", "CSE 8B", "ECE 15"]}}
{"code": "CSE 21", "title": "Mathematics for Algorithms and Systems", "units": "4", "anchor": "cse21", "description": "This course will cover mathematical concepts used to model and analyze algorithms and computer systems. Topics include counting techniques (inclusion-exclusion; recursive counting; permutations and combinations), data representations, analysis of algorithms (order notation; time complexities; loop invariants), recurrence relations, graphs and trees (data structure representations; basic graph algorithms; special classes of graphs), and basic probability and its applications. Prerequisites: CSE 20 or MATH 15A or MATH 31CH; restricted to undergraduates. Graduate students will be allowed as space permits.", "prereqs": {"type": "one", "courses": ["CSE 20", "MATH 15A", "MATH 31CH"]}}
{"code": "CSE 30", "title": "Computer Organization and Systems Programming", "units": "4", "anchor": "cse30", "description": "Introduction to organization of modern digital computers—understanding the various components of a computer and their interrelationships. Study of a specific architecture/machine with emphasis on systems programming in C and Assembly languages in a UNIX environment. Prerequisites: CSE 12 and CSE 15L; restricted to undergraduates. Graduate students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 12", "CSE 15L"]}}
{"code": "CSE 42", "title": "Building and Programming Electronic Devices", "units": "2", "anchor": "cse42", "description": "This course allows students to use what they learned in introductory programming courses to make things happen in the real world. Working in teams, students will first learn to program Arduino-based devices. Teams of students will design a custom device and program it to do their bidding. This course is targeted to first-year students and sophomores in engineering and science disciplines who want to practice applying what they have learned in a programming class and to have the chance to program things other than computers. Program or materials fees may apply. Prerequisites: restricted to first-year and sophomore students; instructor approval required."}
{"code": "CSE 86", "title": "C++ for Java Programmers", "units": "2", "anchor": "cse86", "description": "Helps the Java programmer to be productive in the C++ programming environment. Topics include the similarities and differences between Java and C++ with special attention to pointers, operator overloading, templates, the STL, the preprocessor, and the C++ Runtime Environment. Prerequisites: CSE 12 or consent of instructor.", "prereqs": "CSE 12"}
{"code": "CSE 87", "title": "First-year Student Seminar", "units": "1", "anchor": "cse87", "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students. Prerequisites: none."}
{"code": "CSE 90", "title": "Undergraduate Seminar", "units": "1", "anchor": "cse90", "description": "A seminar providing an overview of a topic of current research interest to the instructor. The goal is to present a specialized topic in computer science and engineering students. May be taken for credit three times when topics vary. "}
{"code": "CSE 91", "title": "Perspectives in Computer Science and Engineering", "units": "2", "anchor": "cse91", "description": "A seminar format discussion led by CSE faculty on topics in central areas of computer science, concentrating on the relation among them, recent developments, and future directions. Prerequisites: majors only."}
{"code": "CSE 99", "title": "Independent Study in Computer Science and Engineering", "units": "4", "anchor": "cse99", "description": "Independent reading or research by special arrangement with a faculty member. Prerequisites: lower-division standing. Completion of thirty units at UC San Diego with a UC San Diego GPA of 3.0. Special Studies form required. Department stamp required. Consent of instructor and approval of the department."}
{"code": "CSE 100", "title": "Advanced Data Structures", "units": "4", "anchor": "cse100", "description": "High-performance data structures and supporting algorithms. Use and implementation of data structures like (un)balanced trees, graphs, priority queues, and hash tables. Also, memory management, pointers, recursion. Theoretical and practical performance analysis, both average case and amortized. Uses C++ and STL. Recommended preparation: background in C or C++ programming. Prerequisites: CSE 21 or MATH 154 or MATH 184 and CSE 12 and CSE 15L and CSE 30 or ECE 15; restricted to undergraduates. Graduate students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 21", "MATH 154", "MATH 184"]}, "CSE 12", "CSE 15L", {"type": "one", "courses": ["CSE 30", "ECE 15"]}]}}
{"code": "CSE 101", "title": "Design and Analysis of Algorithms", "units": "4", "anchor": "cse101", "description": "Design and analysis of efficient algorithms with emphasis of nonnumerical algorithms such as sorting, searching, pattern matching, and graph and network algorithms. Measuring complexity of algorithms, time and storage. NP-complete problems. Prerequisites: CSE 100; restricted to undergraduates. Graduate students will be allowed as space permits.", "prereqs": "CSE 100"}
{"code": "CSE 103", "title": "A Practical Introduction to Probability and Statistics", "units": "4", "anchor": "cse103", "description": "Distributions over the real line. Independence, expectation, conditional expectation, mean, variance. Hypothesis testing. Learning classifiers. Distributions over R^n, covariance matrix. Binomial, Poisson distributions. Chernoff bound. Entropy. Compression. Arithmetic coding. Maximal likelihood estimation. Bayesian estimation. CSE 103 is not duplicate credit for ECE 109, ECON 120A, or MATH 183. Prerequisites: MATH 20A-B and CSE 21 or MATH 154 or MATH 184 or MATH 184A; restricted to CS25, CS26, CS27, and CS28 majors. Other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["MATH 20A", "MATH 20B", {"type": "one", "courses": ["CSE 21", "MATH 154", "MATH 184", "MATH 184A"]}]}}
{"code": "CSE 105", "title": "Theory of Computability", "units": "4", "anchor": "cse105", "description": "An introduction to the mathematical theory of computability. Formal languages. Finite automata and regular expressions. Push-down automata and context-free languages. Computable or recursive functions: Turing machines, the halting problem. Undecidability. Prerequisites: CSE 12 and CSE 15L and CSE 20 or MATH 109 or MATH 15A or MATH 31CH and CSE 21 or MATH 100A or MATH 103A or MATH 154 or MATH 184 or MATH 184A; restricted to students with sophomore, junior, or senior standing. Graduate students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 12", "CSE 15L", {"type": "one", "courses": ["CSE 20", "MATH 109", "MATH 15A", "MATH 31CH"]}, {"type": "one", "courses": ["CSE 21", "MATH 100A", "MATH 103A", "MATH 154", "MATH 184", "MATH 184A"]}]}}
{"code": "CSE 106", "title": "Discrete and Continuous Optimization", "units": "4", "anchor": "cse106", "description": "One frequently deals with problems in engineering, data science, business, economics, and other disciplines for which algorithmic solutions that optimize a given quantity under constraints are desired. This course is an introduction to the models, theory, methods, and applications of discrete and continuous optimization. Topics include shortest paths, flows, linear, integer, and convex programming, and continuous optimization techniques such as steepest descent and Lagrange multipliers. Prerequisites: MATH 18 or MATH 31AH and MATH 20C or MATH 31BH and CSE 21 or DSC 40B or MATH 154 or MATH 184 or MATH 184A.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 31AH"]}, {"type": "one", "courses": ["MATH 20C", "MATH 31BH"]}, {"type": "one", "courses": ["CSE 21", "DSC 40B", "MATH 154", "MATH 184", "MATH 184A"]}]}}
{"code": "CSE 107", "title": "Introduction to Modern Cryptography", "units": "4", "anchor": "cse107", "description": "Topics include private and public-key cryptography, block ciphers, data encryption, authentication, key distribution and certification, pseudorandom number generators, design and analysis of protocols, zero-knowledge proofs, and advanced protocols. Emphasizes rigorous mathematical approach including formal definitions of security goals and proofs of protocol security. Prerequisites: (MATH 184 or CSE 21 or MATH 154) and CSE 101 and CSE 105; restricted to students within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 184", "CSE 21", "MATH 154"]}, "CSE 101", "CSE 105"]}}
{"code": "CSE 109", "title": "Introduction to Programming Contests", "units": "2", "anchor": "cse109", "description": "This course introduces the algorithms and concepts necessary to compete in programming contests like ACM International Collegiate Programming Contest (ICPC). The course requires weekly completion of short problem sets. Topics covered include standard library classes and data structures useful for programming contest problems, basic complexity analysis, dynamic programming, graph algorithms, number theory, combinatorics, computational geometry, combinatorial games, and contest strategy. Prerequisites: CSE 30.", "prereqs": "CSE 30"}
{"code": "CSE 110", "title": "Software Engineering", "units": "4", "anchor": "cse110", "description": "Introduction to software development and engineering methods, including specification, design, implementation, testing, and process. An emphasis on team development, agile methods, and use of tools such as IDE’s, version control, and test harnesses. Prerequisites: CSE 100; restricted to students with junior or senior standing within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 100"}
{"code": "CSE 112", "title": "Advanced Software Engineering", "units": "4", "anchor": "cse112", "description": "This course will cover software engineering topics associated with large systems development such as requirements and specifications, testing and maintenance, and design. Specific attention will be given to development tools and automated support environments. Prerequisites: CSE 110; restricted to students within the CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 110"}
{"code": "CSE 113", "title": "Errors, Defects, and Failures", "units": "4", "anchor": "cse113", "description": "Errors, resulting in defects and ultimately system failure, occur in engineering and also other areas such as medical care. The ways in which failures occur, and the means for their prevention, mitigation, and management, will be studied. Emphasis will be on software systems but also include the study of practice of other areas. Prerequisites: CSE 12 and CSE 21.", "prereqs": {"type": "all", "courses": ["CSE 12", "CSE 21"]}}
{"code": "CSE 118", "title": "Ubiquitous Computing", "units": "4", "anchor": "cse118", "description": "Explores emerging opportunities enabled by cheap sensors and networked computing devices. Small research projects will be conducted in teams, culminating in project presentations at the end of the term. Section will cover material relevant to the project, such as research methods, software engineering, teamwork, and project management. Prerequisites: any course from the following: CSE 131, CSE 132B, COGS 102C, COGS 121, COGS 184, COMT 111B, COMT 115, ECE 111, ECE 118, ECE 191, ECE 192, or ICAM 160B; or consent of instructor.", "prereqs": {"type": "one", "courses": ["CSE 131", "CSE 132B", "COGS 102C", "COGS 121", "COGS 184", "COMT 111B", "COMT 115", "ECE 111", "ECE 118", "ECE 191", "ECE 192", "ICAM 160B"]}}
{"code": "CSE 120", "title": "Principles of Computer Operating Systems", "units": "4", "anchor": "cse120", "description": "Basic functions of operating systems; basic kernel structure, concurrency, memory management, virtual memory, file systems, process scheduling, security and protection. Prerequisites: CSE 30 and CSE 101 and CSE 110; restricted to students within the CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 30", "CSE 101", "CSE 110"]}}
{"code": "CSE 123", "title": "Computer Networks", "units": "4", "anchor": "cse123", "description": "Introduction to concepts, principles, and practice of computer communication networks with examples from existing architectures, protocols, and standards with special emphasis on the internet protocols. Layering and the OSI model; physical and data link layers; local and wide area networks; datagrams and virtual circuits; routing and congestion control; internetworking. Transport protocols. Credit may not be received for both CSE 123 and ECE 158A. Prerequisites: CSE 30 and CSE 101 and CSE 110; restricted to students with sophomore, junior, or senior standing within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 30", "CSE 101", "CSE 110"]}}
{"code": "CSE 124", "title": "Networked Services", "units": "4", "anchor": "cse124", "description": "(Renumbered from CSE 123B.) The architecture of modern networked services, including data center design, enterprise storage, fault tolerance, and load balancing. Protocol software structuring, the Transmission Control Protocol (TCP), remote procedure calls, protocols for digital audio and video communication, overlay and peer-to-peer systems, secure communication. Credit may not be received for both CSE 124 and ECE 158B. Students may not receive credit for both CSE 123B and CSE 124. Prerequisites: CSE 30 and CSE 101 and CSE 110; restricted to students with sophomore, junior, or senior standing within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 30", "CSE 101", "CSE 110"]}}
{"code": "CSE 125", "title": "Software System Design and Implementation", "units": "4", "anchor": "cse125", "description": "Design and implementation of large, complex software systems involving multiple aspects of CSE curriculum. Emphasis is on software system design applied to a single, large group project with close interaction with instructor. Prerequisites: senior standing with substantial programming experience, and consent of instructor. Department stamp required."}
{"code": "CSE 127", "title": "Introduction to Computer Security", "units": "4", "anchor": "cse127", "description": "Topics include basic cryptography, security/threat analysis, access control, auditing, security models, distributed systems security, and theory behind common attack and defense techniques. The class will go over formal models as well as the bits and bytes of security exploits. Prerequisites: CSE 21 or MATH 154 or MATH 184 or MATH 184A and CSE 120 or CSE 123 or CSE 124; restricted to students with sophomore, junior, or senior standing within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 21", "MATH 154", "MATH 184", "MATH 184A"]}, {"type": "one", "courses": ["CSE 120", "CSE 123", "CSE 124"]}]}}
{"code": "CSE 130", "title": "Programming Languages: Principles and Paradigms", "units": "4", "anchor": "cse130", "description": "(Formerly CSE 173.) Introduction to programming languages and paradigms, the components that comprise them, and the principles of language design, all through the analysis and comparison of a variety of languages (e.g., Pascal, Ada, C++, PROLOG, ML.) Will involve programming in most languages studied. Prerequisites: CSE 12 and CSE 100 and CSE 105; restricted to students within the CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 12", "CSE 100", "CSE 105"]}}
{"code": "CSE 131", "title": "Compiler Construction", "units": "4", "anchor": "cse131", "description": "(Formerly CSE 131B.) Introduction to the compilation of programming languages, practice of lexical and syntactic analysis, symbol tables, syntax-directed translation, type checking, code generation, optimization, interpretation, and compiler structure. Students may receive repeat credit for CSE 131A and CSE 131B by completing CSE 131. Prerequisites: CSE 100 and CSE 105 and CSE 130; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 100", "CSE 105", "CSE 130"]}}
{"code": "CSE 132A", "title": "Database System Principles", "units": "4", "anchor": "cse132a", "description": "Basic concepts of databases, including data modeling, relational databases, query languages, optimization, dependencies, schema design, and concurrency control. Exposure to one or several commercial database systems. Advanced topics such as deductive and object-oriented databases, time allowing. Prerequisites: CSE 100; restricted to students with sophomore, junior, or senior standing within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 100"}
{"code": "CSE 132B", "title": "Database Systems Applications", "units": "4", "anchor": "cse132b", "description": "Design of databases, transactions, use of trigger facilities and datablades. Performance measuring, organization of index structures. Prerequisites: CSE 132A; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 132A"}
{"code": "CSE 132C", "title": "Database System Implementation", "units": "4", "anchor": "cse132c", "description": "This is a systems-focused course on the internals of a relational database management system (RDBMS). RDBMSs power large-scale structured data management in most digital applications. The topics span data storage, buffer management, indexing, sorting, relational operator implementations, query processing and optimization, parallel RDBMSs, and “Big Data” systems. Two C++ programming projects require implementation of a buffer manager and a B+ tree index using a given RDBMS skeleton. Recommended preparation: C++ programming knowledge is required; CSE 132B is recommended. Prerequisites: CSE 132A or DSC 102; restricted to students with sophomore, junior, or senior standing. All other students will be allowed as space permits.", "prereqs": {"type": "one", "courses": ["CSE 132A", "DSC 102"]}}
{"code": "CSE 134B", "title": "Web Client Languages", "units": "4", "anchor": "cse134b", "description": "Design and implementation of interactive World Wide Web clients using helper applications and plug-ins. The main language covered will be Java. Prerequisites: CSE 100; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 100"}
{"code": "CSE 135", "title": "Online Database Analytics Applications", "units": "4", "anchor": "cse135", "description": "Database, data warehouse, and data cube design; SQL programming and querying with emphasis on analytics; online analytics applications, visualizations, and data exploration; performance tuning. Prerequisites: CSE 100; restricted to students within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 100"}
{"code": "CSE 136", "title": "Enterprise-Class Web Applications", "units": "4", "anchor": "cse136", "description": "Design and implementation of very large-scale, web-based applications. Topics covered typically include modeling organizational needs, design and revision management, J2EE or similar software platforms, web server and application server functionality, reuse of object-oriented components, model-view-controller and other design patterns, clustering, load-balancing, fault-tolerance, authentication, and usage accounting. Prerequisites: CSE 135.", "prereqs": "CSE 135"}
{"code": "CSE 140", "title": "Components and Design Techniques for Digital Systems", "units": "4", "anchor": "cse140", "description": "Design of Boolean logic and finite state machines; two-level, multilevel combinational logic design, combinational modules and modular networks, Mealy and Moore machines, analysis and synthesis of canonical forms, sequential modules. Prerequisites: CSE 20 or MATH 109 or MATH 15A or MATH 31CH and CSE 30;  CSE 140L must be taken concurrently; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 20", "MATH 109", "MATH 15A", "MATH 31CH"]}, "CSE 30"]}, "coreqs": "CSE 140L"}
{"code": "CSE 140L", "title": "Digital Systems Laboratory", "units": "2", "anchor": "cse140l", "description": "Implementation with computer-aided design tools for combinational logic minimization and state machine synthesis. Hardware construction of a small digital system. Prerequisites: CSE 20 or MATH 109 or MATH 15A or MATH 31CH and CSE 30; CSE 140 must be taken concurrently; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 20", "MATH 109", "MATH 15A", "MATH 31CH"]}, "CSE 30"]}, "coreqs": "CSE 140"}
{"code": "CSE 141", "title": "Introduction to Computer Architecture", "units": "4", "anchor": "cse141", "description": "Introduction to computer architecture. Computer system design. Processor design. Control design. Memory systems. Two units of credit offered for CSE 141 if CSE 142 taken previously. Prerequisites: CSE 30 and CSE 140 and CSE 140L; CSE 141L should be taken concurrently; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 30", "CSE 140", "CSE 140L"]}, "coreqs": "CSE 141L"}
{"code": "CSE 141L", "title": "Project in Computer Architecture", "units": "2", "anchor": "cse141l", "description": "Hands-on computer architecture project aiming to familiarize students with instruction set architecture, and design of process. Control and memory systems. Prerequisites: CSE 30 and CSE 140 and CSE 140L; CSE 141 should be taken concurrently; restricted to CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 30", "CSE 140", "CSE 140L"]}, "coreqs": "CSE 141"}
{"code": "CSE 142", "title": "Introduction to Computer Architecture: A Software Perspective", "units": "4", "anchor": "cse142", "description": "This course covers the operation, structure, and programming interfaces of modern CPUs with an emphasis on exploiting processor features to improve software performance and efficiency. The topics covered in this course include performance, energy, x86 assembly, compiler optimizations, pipelining, instruction-level parallelism, caches, memory-level parallelism, multi-threading, multi-core processors, and SIMD. Two units of credit offered for CSE 142 if CSE 141 taken previously or concurrently. Prerequisites: CSE 30 and CSE 100; CSE 142L should be taken concurrently. Restricted to students within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 30", "CSE 100"]}, "coreqs": "CSE 142L"}
{"code": "CSE 142L", "title": "Software Project for Computer Architecture", "units": "2", "anchor": "cse142l", "description": "This course provides hands-on experience in using the features of modern CPUs to increase the performance and efficiency of programs. Prerequisites: CSE 30 and CSE 100; CSE 142 should be taken concurrently. Restricted to students within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 30", "CSE 100"]}, "coreqs": "CSE 142"}
{"code": "CSE 143", "title": "Microelectronic System Design", "units": "4", "anchor": "cse143", "description": "VLSI process technologies; circuit characterization; logic design styles; clocking strategies; computer-aided design tools; subsystem design; design case studies. System design project from hardware description, logic synthesis, physical layout to design verification. Prerequisites: CSE 140 or CSE 170A or ECE 81.", "prereqs": {"type": "one", "courses": ["CSE 140", "CSE 170A", "ECE 81"]}}
{"code": "CSE 145", "title": "Embedded System Design Project", "units": "4", "anchor": "cse145", "description": "Project class building an embedded computing system. Learn fundamental knowledge of microcontrollers, sensors, and actuators. Introduction to the hardware and software tools to build project in a team environment and end-to-end system building. Prerequisites: instructor approval required, by application only."}
{"code": "CSE 148", "title": "Advanced Processor Architecture Design Project", "units": "4", "anchor": "cse148", "description": "Students will use hardware description language tools to add advanced architectural features to a basic processor design. These features may include pipelining, superscalar execution, branch prediction, and advanced cache features. Designs will be implemented in programmable logic devices. Prerequisites: CSE 141 and CSE 141L; restricted to students with sophomore, junior, or senior standing. Graduate students will be allowed as space permits.", "prereqs": {"type": "all", "courses": ["CSE 141", "CSE 141L"]}}
{"code": "CSE 150A", "title": "Introduction to Artificial Intelligence: Probabilistic Reasoning and Decision-Making", "units": "4", "anchor": "cse150a", "description": "Introduction to probabilistic models at the heart of modern artificial intelligence. Specific topics to be covered include probabilistic methods for reasoning and decision-making under uncertainty; inference and learning in Bayesian networks; prediction and planning in Markov decision processes; applications to intelligent systems, speech and natural language processing, information retrieval, and robotics. Prerequisites: (CSE 12 or DSC 40B) and (CSE 15L or DSC 80) and (COGS 118D or CSE 103 or ECE 109 or ECON 120A or MATH 180A or MATH 183) and (MATH 20A) and (MATH 18 or MATH 31AH); restricted to students within the CS25, CS26, CS27, CS28, EC26, and DS25 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 12", "DSC 40B"]}, {"type": "one", "courses": ["CSE 15L", "DSC 80"]}, {"type": "one", "courses": ["COGS 118D", "CSE 103", "ECE 109", "ECON 120A", "MATH 180A", "MATH 183"]}, "MATH 20A", {"type": "one", "courses": ["MATH 18", "MATH 31AH"]}]}}
{"code": "CSE 150B", "title": "Introduction to Artificial Intelligence: Search and Reasoning", "units": "4", "anchor": "cse150b", "description": "The course will introduce important ideas and algorithms in search and reasoning and demonstrate how they are used in practical AI applications. Topics include A* search, adversarial search, Monte Carlo tree search, reinforcement learning, constraint solving and optimization, propositional and first-order reasoning. Prerequisites: (CSE 12 or DSC 40B) and (CSE 15L or DSC 80) and (COGS 118D or CSE 103 or ECE 109 or ECON 120A or MATH 180A or MATH 183) and (CSE 100); restricted to students within the CS25, CS26, CS27, CS28, EC26, and DS25 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 12", "DSC 40B"]}, {"type": "one", "courses": ["CSE 15L", "DSC 80"]}, {"type": "one", "courses": ["COGS 118D", "CSE 103", "ECE 109", "ECON 120A", "MATH 180A", "MATH 183"]}, "CSE 100"]}}
{"code": "CSE 151A", "title": "Introduction to Machine Learning", "units": "4", "anchor": "cse151a", "description": "Broad introduction to machine learning. The topics include some topics in supervised learning, such as k-nearest neighbor classifiers, decision trees, boosting, and perceptrons; and topics in unsupervised learning, such as k-means and hierarchical clustering. In addition to the actual algorithms, the course focuses on the principles behind the algorithms. Students may not receive credit for both CSE 151A and COGS 188, nor may they receive credit for both CSE 151A and CSE 151. Prerequisites: CSE 12 or DSC 40B and CSE 15L or DSC 80 and COGS 118D or CSE 103 or ECE 109 or ECON 120A or MATH 181A or MATH 183 and MATH 18 or MATH 31AH and MATH 20C or MATH 31BH; restricted to students within the CS25, CS26, CS27, CS28, EC26, and DS25 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 12", "DSC 40B"]}, {"type": "one", "courses": ["CSE 15L", "DSC 80"]}, {"type": "one", "courses": ["COGS 118D", "CSE 103", "ECE 109", "ECON 120A", "MATH 181A", "MATH 183"]}, {"type": "one", "courses": ["MATH 18", "MATH 31AH"]}, {"type": "one", "courses": ["MATH 20C", "MATH 31BH"]}]}}
{"code": "CSE 151B", "title": "Deep Learning", "units": "4", "anchor": "cse151b", "description": "(Formerly CSE 154.) This course covers the fundamentals of neural networks. We introduce linear regression, logistic regression, perceptrons, multilayer networks and back-propagation, convolutional neural networks, recurrent networks, and deep networks trained by reinforcement learning. Students may receive credit for one of the following: CSE 151B, CSE 154, or COGS 181. Prerequisites: MATH 20C or MATH 31BH and BENG 134 or COGS 118D or CSE 103 or ECE 109 or ECON 120A or MAE 108 or MATH 181A or MATH 183 or MATH 186; restricted to students with sophomore, junior, or senior standing within the CS25, CS26, CS27, CS28, EC26, and DS25 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 20C", "MATH 31BH"]}, {"type": "one", "courses": ["BENG 134", "COGS 118D", "CSE 103", "ECE 109", "ECON 120A", "MAE 108", "MATH 181A", "MATH 183", "MATH 186"]}]}}
{"code": "CSE 152A", "title": "Introduction to Computer Vision I", "units": "4", "anchor": "cse152a", "description": "This course provides a broad introduction to the foundations, algorithms, and applications of computer vision. It introduces classical models and contemporary methods, from image formation models to deep learning, to address problems of 3-D reconstruction and object recognition from images and video. Topics include filtering, feature detection, stereo vision, structure from motion, motion estimation, and recognition. Programming assignments will be in Python. Students may not receive credit for both CSE 152A and CSE 152. Prerequisites: MATH 18 or MATH 31AH and CSE 12 or DSC 30 and CSE 15L or DSC 80; Python programming experience recommended; restricted to students within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 31AH"]}, {"type": "one", "courses": ["CSE 12", "DSC 30"]}, {"type": "one", "courses": ["CSE 15L", "DSC 80"]}]}}
{"code": "CSE 152B", "title": "Introduction to Computer Vision II", "units": "4", "anchor": "cse152b", "description": "This course covers advanced topics needed to apply computer vision in industry or follow current research. Example topics include real-time systems for 3-D computer vision, machine learning tools such as support-vector machine (SVM) and boosting for image classification, and deep neural networks for object detection and semantic segmentation. Prerequisites: CSE 152A or CSE 152 or CSE166; Python programming experience recommended; restricted to students within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "one", "courses": ["CSE 152A", "CSE 152"]}}
{"code": "CSE 156", "title": "Statistical Natural Language Processing", "units": "4", "anchor": "cse156", "description": "Natural language processing (NLP) is a field of AI which aims to equip computers with the ability to intelligently process natural (human) language. This course will explore statistical techniques for the automatic analysis of natural language data. Specific topics covered include probabilistic language models, which define probability distributions over text passages; text classification; sequence models; parsing sentences into syntactic representations; and machine translation. Prerequisites: MATH 20C or MATH 31BH and MATH 18 or MATH 31AH and COGS 118A or CSE 150 or CSE 151; restricted to students with sophomore, junior, or senior standing within the CS25, CS26, CS27, CS28, and EC26 majors. All other students will be allowed as space permits.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 20C", "MATH 31BH"]}, {"type": "one", "courses": ["MATH 18", "MATH 31AH"]}, {"type": "one", "courses": ["COGS 118A", "CSE 150", "CSE 151"]}]}}
{"code": "CSE 158", "title": "Recommender Systems and Web Mining", "units": "4", "anchor": "cse158", "description": "Current methods for data mining and predictive analytics. Emphasis is on studying real-world data sets, building working systems, and putting current ideas from machine learning research into practice. Prerequisites: CSE 12 or DSC 40B and CSE 15L or DSC 80 and BENG 100 or BENG 134 or COGS 118D or CSE 103 or ECE 109 or ECON 120A or MATH 180A or MATH 181A or MATH 183 or MATH 186; restricted to students with sophomore, junior, or senior standing within the CS25, CS26, CS27, CS28, DS25, and EC26 majors. All other students will be allowed as space permits. May be coscheduled with CSE 258. Students may not receive credit for CSE 158 and CSE 158R or DSC 148.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 12", "DSC 40B"]}, {"type": "one", "courses": ["CSE 15L", "DSC 80"]}, {"type": "one", "courses": ["BENG 100", "BENG 134", "COGS 118D", "CSE 103", "ECE 109", "ECON 120A", "MATH 180A", "MATH 181A", "MATH 183", "MATH 186"]}]}}
{"code": "CSE 158R", "title": "Recommender Systems and Web Mining", "units": "4", "anchor": "cse158r", "description": "Current methods for data mining and predictive analytics. Emphasis is on studying real-world data sets, building working systems, and putting current ideas from machine learning research into practice. Prerequisites: CSE 12 or DSC 40B and CSE 15L or DSC 80 and BENG 100 or BENG 134 or COGS 118D or CSE 103 or ECE 109 or ECON 120A or MATH 180A or MATH 181A or MATH 183 or MATH 186; restricted to students with sophomore, junior, or senior standing within the CS25, CS26, CS27, CS28, DS25, and EC26 majors. All other students will be allowed as space permits. This will be a fully online class based on extensive educational materials and an online educational platform. May be coscheduled with CSE 258R. Students may not receive credit for CSE 158R and CSE 158 or DSC 148.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 12", "DSC 40B"]}, {"type": "one", "courses": ["CSE 15L", "DSC 80"]}, {"type": "one", "courses": ["BENG 100", "BENG 134", "COGS 118D", "CSE 103", "ECE 109", "ECON 120A", "MATH 180A", "MATH 181A", "MATH 183", "MATH 186"]}]}}
{"code": "CSE 160", "title": "Introduction to Parallel Computing", "units": "4", "anchor": "cse160", "description": "Introduction to high performance parallel computing: parallel architecture, algorithms, software, and problem-solving techniques. Areas covered: Flynn’s taxonomy, processor-memory organizations, shared and nonshared memory models: message passing and multithreading, data parallelism; speedup, efficiency and Amdahl’s law, communication and synchronization, isoefficiency and scalability. Assignments given to provide practical experience. Prerequisites: CSE 100; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits", "prereqs": "CSE 100"}
{"code": "CSE 163", "title": "Advanced Computer Graphics", "units": "4", "anchor": "cse163", "description": "Topics include an overview of many aspects of computer graphics, including the four main computer graphics areas of animation, modeling, rendering, and imaging. Programming projects in image and signal processing, geometric modeling, and real-time rendering. Prerequisites: CSE 167; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 167"}
{"code": "CSE 165", "title": "3-D User Interaction", "units": "4", "anchor": "cse165", "description": "This course focuses on design and evaluation of three-dimensional (3-D) user interfaces, devices, and interaction techniques. The course consists of lectures, literature reviews, and programming assignments. Students will be expected to create interaction techniques for several different 3-D interaction devices. Program or materials fees may apply. Prerequisites: CSE 167; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 167"}
{"code": "CSE 166", "title": "Image Processing", "units": "4", "anchor": "cse166", "description": "Principles of image formation, analysis, and representation. Image enhancement, restoration, and segmentation; stochastic image models. Filter design, sampling, Fourier and wavelet transforms. Selected applications in computer graphics and machine vision. Prerequisites: DSC 40B or MATH 18 or MATH 31AH and CSE 100 or DSC 80; restricted to sophomore, junior, and senior students.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["DSC 40B", "MATH 18", "MATH 31AH"]}, {"type": "one", "courses": ["CSE 100", "DSC 80"]}]}}
{"code": "CSE 167", "title": "Computer Graphics", "units": "4", "anchor": "cse167", "description": "Representation and manipulation of pictorial data. Two-dimensional and three-dimensional transformations, curves, surfaces. Projection, illumination, and shading models. Raster and vector graphic I/O devices; retained-mode and immediate-mode graphics software systems and applications. Students may not receive credit for both MATH 155A and CSE 167. Prerequisites: CSE 100; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 100"}
{"code": "CSE 168", "title": "Computer Graphics II: Rendering", "units": "4", "anchor": "cse168", "description": "Weekly programming assignments that will cover graphics rendering algorithms. During the course the students will learn about ray tracing, geometry, tessellation, acceleration structures, sampling, filtering, shading models, and advanced topics such as global illumination and programmable graphics hardware. Prerequisites: CSE 167; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 167"}
{"code": "CSE 169", "title": "Computer Animation", "units": "4", "anchor": "cse169", "description": "Advanced graphics focusing on the programming techniques involved in computer animation. Algorithms and approaches for both character animation and physically based animation. Particular subjects may include skeletons, skinning, key framing, facial animation, inverse kinematics, locomotion, motion capture, video game animation, particle systems, rigid bodies, clothing, and hair. Recommended preparation: An understanding of linear algebra. Prerequisites: CSE 167; restricted to CS25, CS26, CS27, and EC26 majors. All other students will be allowed as space permits.", "prereqs": "CSE 167"}
{"code": "CSE 170", "title": "Interaction Design", "units": "5", "anchor": "cse170", "description": "Introduces fundamental methods and principles for designing, implementing, and evaluating user interfaces. Topics include user-centered design, rapid prototyping, experimentation, direct manipulation, cognitive principles, visual design, social software, software tools. Learn by doing: Work with a team on a quarter-long design project. Students may not receive credit for COGS 120 and CSE 170. Recommended preparation: Basic familiarity with HTML. Prerequisites: COGS 108 or CSE 12 or DSC 30 and COGS 1 or COGS 10 or DSGN 1 or ENG 100D.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["COGS 108", "CSE 12", "DSC 30"]}, {"type": "one", "courses": ["COGS 1", "COGS 10", "DSGN 1", "ENG 100D"]}]}}
{"code": "CSE 175", "title": "Successful Entrepreneurship for Engineers", "units": "4", "anchor": "cse175", "description": "A foundation course teaching the basics of starting and running a successful new business. Students learn how to think like entrepreneurs, pivot their ideas to match customer needs, with financial, market, timeline feasibility inputs. The end goal is an investor pitch and a business plan. Provides experiential education, encouragement, and coaching (E3CE) that prepares students for successful careers at start-up as well as large companies. Prerequisites: instructor approval required to ensure sufficient project experience to be successful in the course. No credit offered for CSE 175 if ECE 150 taken previously or concurrently."}
{"code": "CSE 176A", "title": "Health Care Robotics", "units": "4", "anchor": "cse176a", "description": "Robotics has the potential to improve well-being for millions of people and support caregivers and to aid the clinical workforce. We bring together engineers, clinicians, and end users to explore this exciting new field. The course is project-based, interactive, and hands-on, and involves working closely with stakeholders to develop prototypes that solve real-world problems. Students will explore the latest research in health care robotics, human-robot teaming, and health design. Program or materials fees may apply. Prerequisites: CSE 110 or CSE 170 or COGS 120; restricted to sophomore, junior, and senior students.", "prereqs": {"type": "one", "courses": ["CSE 110", "CSE 170", "COGS 120"]}}
{"code": "CSE 176E", "title": "Robot Systems Design and Implementation", "units": "4", "anchor": "cse176e", "description": "End-to-end system design of embedded electronic systems including PCB design and fabrication, software control system development, and system integration. Program or materials fees may apply. May be coscheduled with CSE 276E. Prerequisites: restricted to junior and senior students; instructor approval required."}
{"code": "CSE 180", "title": "Biology Meets Computing", "units": "4", "anchor": "cse180", "description": "Topics include an overview of various aspects of bioinformatics and will simultaneously introduce students to programming in Python. The assessments in the course represent various programming challenges and include solving diverse biological problems using popular bioinformatics tools. Students may not receive credit for CSE 180 and CSE 180R. Prerequisites: BILD 1.", "prereqs": "BILD 1"}
{"code": "CSE 180R", "title": "Biology Meets Computing", "units": "4", "anchor": "cse180r", "description": "Topics include an overview of various aspects of bioinformatics and will simultaneously introduce students to programming in Python. The assessments in the course represent various programming challenges and include solving diverse biological problems using popular bioinformatics tools. This will be a fully online class based on extensive educational materials and online educational platform Stepik developed with HHMI, NIH, and ILTI support. Students may not receive credit for CSE 180 and CSE 180R. Prerequisites: BILD 1 or BILD 4 or CSE 3 or CSE 7 or CSE 8A or CSE 8B or CSE 11.", "prereqs": {"type": "one", "courses": ["BILD 1", "BILD 4", "CSE 3", "CSE 7", "CSE 8A", "CSE 8B", "CSE 11"]}}
{"code": "CSE 181", "title": "Molecular Sequence Analysis", "units": "4", "anchor": "cse181", "description": "This course covers the analysis of nucleic acid and protein sequences, with an emphasis on the application of algorithms to biological problems. Topics include sequence alignments, database searching, comparative genomics, and phylogenetic and clustering analyses. Pairwise alignment, multiple alignment, DNS sequencing, scoring functions, fast database search, comparative genomics, clustering, phylogenetic trees, gene finding/DNA statistics. Students may receive credit for one of the following: CSE 181, BIMM 181, or BENG 181. Prerequisites: CSE 100 and CSE 101 and BIMM 100 or CHEM 114C; restricted to BE28, BI34, CH37, and CS27 majors. Students may receive credit for one of the following: CSE 181, BIMM 181, or BENG 181.", "prereqs": {"type": "all", "courses": ["CSE 100", "CSE 101", {"type": "one", "courses": ["BIMM 100", "CHEM 114C"]}]}}
{"code": "CSE 182", "title": "Biological Databases", "units": "4", "anchor": "cse182", "description": "This course provides an introduction to the features of biological data, how those data are organized efficiently in databases, and how existing data resources can be utilized to solve a variety of biological problems. Object oriented databases, data modeling and description. Survey of current biological database with respect to above, implementation of a database on a biological topic. Students may receive credit for one of the following: CSE 182, BENG 182, or BIMM 182. Prerequisites: CSE 100; restricted to BE28, BI34, CH37, and CS27 majors.", "prereqs": "CSE 100"}
{"code": "CSE 184", "title": "Computational Molecular Biology", "units": "4", "anchor": "cse184", "description": "This advanced course covers the application of machine learning and modeling techniques to biological systems. Topics include gene structure, recognition of DNA and protein sequence patterns, classification, and protein structure prediction. Pattern discovery, Hidden Markov models/support victor machines/neural network/profiles. Protein structure prediction, functional characterization or proteins, functional genomics/proteomics, metabolic pathways/gene networks. Cross-listed with BIMM 184/BENG 184/CHEM 184. Prerequisites: BIMM 181 or BENG 181 or CSE 181, BENG 182 or BIMM 182 or CSE 182 or CHEM 182. Bioinformatics majors only.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["BIMM 181", "BENG 181", "CSE 181"]}, {"type": "one", "courses": ["BENG 182", "BIMM 182", "CSE 182", "CHEM 182"]}]}}
{"code": "CSE 185", "title": "Advanced Bioinformatics Laboratory", "units": "4", "anchor": "cse185", "description": "This course emphasizes the hands-on application of bioinformatics to biological problems. Students will gain experience in the application of existing software, as well as in combining approaches to answer specific biological questions. Topics include sequence alignment, fast database search, comparative genomics, expression analysis, computational proteomics, genome-wide association studies, next-generation sequencing, genomics, and big data. Students may not receive credit for CSE 185 and BIMM 185. Restricted to CS27, BI34, BE28, and CH37 majors. Prerequisites: CSE 11 or CSE 8B and CSE 12 and MATH 20C or MATH 31BH and BILD 1 and BIEB 123 or BILD 4 or BIMM 101 or CHEM 109.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 11", "CSE 8B"]}, "CSE 12", {"type": "one", "courses": ["MATH 20C", "MATH 31BH"]}, "BILD 1", {"type": "one", "courses": ["BIEB 123", "BILD 4", "BIMM 101", "CHEM 109"]}]}}
{"code": "CSE 190", "title": "Topics in Computer Science and Engineering", "units": "4", "anchor": "cse190", "description": "Topics of special interest in computer science and engineering. Topics may vary from quarter to quarter. May be repeated for credit with the consent of instructor. Prerequisites: consent of instructor. Department stamp required."}
{"code": "CSE 191", "title": "Seminar in CSE", "units": "1–4", "anchor": "cse191", "description": "A seminar course on topics of current interest. Students, as well as the instructor, will be actively involved in running the course/class. This course cannot be counted toward a technical elective. Prerequisites: consent of instructor. Department stamp required."}
{"code": "CSE 192", "title": "Senior Seminar in Computer Science and Engineering", "units": "1", "anchor": "cse192", "description": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in CSE (at the upper-division level). Topics will vary from quarter to quarter. Senior seminars may be taken for credit up to four times, with a change in topic, and permission of the department. Enrollment is limited to twenty students, with preference given to seniors. (P/NP grades only.) Prerequisites: upper-division standing; department stamp required and consent of instructor."}
{"code": "CSE 193", "title": "Introduction to Computer Science Research", "units": "4", "anchor": "cse193", "description": "Introduction to research in computer science. Topics include defining a CS research problem, finding and reading technical papers, oral communication, technical writing, and independent learning. Course participants apprentice with a CSE research group and propose an original research project. Prerequisites: consent of the department chair. Department stamp required."}
{"code": "CSE 194", "title": "Race, Gender, and Computing", "units": "4", "anchor": "cse194", "description": "This course explores the challenges of diversity, equity, and inclusion (DEI) in computing and technology through an introduction to and analysis of various social constructs and their impact on not only computing-related organizations, but also the technologies developed and the people affected by them. This course also introduces students to cultural competence in the context of computing. Prerequisites: CSE 12 or ECE 35 and CAT 3 or DOC 3 or HUM 2 or MCWP 50 or MCWP 50R or MMW 13 or SYN 2 or WCWP 10B.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 12", "ECE 35"]}, {"type": "one", "courses": ["CAT 3", "DOC 3", "HUM 2", "MCWP 50", "MCWP 50R", "MMW 13", "SYN 2", "WCWP 10B"]}]}}
{"code": "CSE 195", "title": "Teaching", "units": "4", "anchor": "cse195", "description": "Teaching and tutorial assistance in a CSE course under the supervision of the instructor. (P/NP grades only.) Prerequisites: consent of the department chair. Department stamp required."}
{"code": "CSE 197", "title": "Field Study in Computer Science and Engineering", "units": "4", "anchor": "cse197", "description": "Directed study accompanying full-time on-site computer science internships. (P/NP grades only.) Prerequisites: consent of the instructor and approval of the department. Restricted to CS25, CS26, CS27, and CS28 majors only."}
{"code": "CSE 198", "title": "Directed Group Study", "units": "2 or 4", "anchor": "cse198", "description": "Computer science and engineering topics whose study involves reading and discussion by a small group of students under the supervision of a faculty member. (P/NP grades only.) Prerequisites: consent of the instructor. Department stamp required."}
{"code": "CSE 199", "title": "Independent Study for Undergraduates", "units": "2 or 4", "anchor": "cse199", "description": "Independent reading or research by special arrangement with a faculty member. (P/NP grades only.) Prerequisites: consent of the instructor. Department stamp required."}
{"code": "CSE 199H", "title": "CSE Honors Thesis Research for Undergraduates", "units": "4", "anchor": "cse199h", "description": "Undergraduate research for completing an honors project under the supervision of a CSE faculty member. May be taken across multiple quarters. Students should enroll for a letter grade. May be taken for credit three times. Prerequisites: Admission to the CSE department honors program. Consent of the instructor. Department stamp required."}
{"code": "CSE 200", "title": "Computability and Complexity", "units": "4", "anchor": "cse200", "description": "Computability review, including halting problem, decidable sets, r.e. sets, many-one reductions; TIME(t(n)), SPACE(s(n)) and general relations between these classes; L, P, PSPACE, NP; NP—completeness; hierarchy theorems; RP, BPP. Prerequisites: CSE 105 or equivalent.", "prereqs": "CSE 105"}
{"code": "CSE 201A", "title": "Advanced Complexity", "units": "4", "anchor": "cse201a", "description": "Polynomial-time hierarchy (PH), BPP in second level of PH, Savitch’s theorem, NL=coNL, nonuniform and circuit complexity, some circuit lower bounds, IP=PSPACE, probabilistic proof checking (PCP), application of PCP to approximation hardness, complexity of proof systems, parallel complexity classes NC and AC, P-completeness. Recommended preparation: CSE 200. Prerequisites: graduate standing."}
{"code": "CSE 202", "title": "Algorithm Design and Analysis", "units": "4", "anchor": "cse202", "description": "The basic techniques for the design and analysis of algorithms. Divide-and-conquer, dynamic programming, data structures, graph search, algebraic problems, randomized algorithms, lower bounds, probabilistic analysis, parallel algorithms. Prerequisites: CSE 101 or equivalent.", "prereqs": "CSE 101"}
{"code": "CSE 203A", "title": "Advanced Algorithms", "units": "4", "anchor": "cse203a", "description": "Modern advances in design and analysis of algorithms. Exact syllabus varies. Topics include approximation, randomized algorithms, probabilistic analysis, heuristics, online algorithms, competitive analysis, models of memory hierarchy, parallel algorithms, number-theoretic algorithms, cryptanalysis, computational geometry, computational biology, network algorithms, VLSI CAD algorithms. Prerequisites: CSE 202.", "prereqs": "CSE 202"}
{"code": "CSE 203B", "title": "Convex Optimization Formulations and Algorithms", "units": "4", "anchor": "cse203b", "description": "We study the formulations and algorithms solving convex optimization problems. The topics include convex sets, functions, optimality conditions, duality concepts, gradient descent, conjugate gradient, interior-point methods, and applications. The objective of the course is to provide students the background and techniques for scientific computing and system optimization. Students cannot receive credit for CSE 203B if they have taken either ECE 273 or MATH 245B. Prerequisites: Linear Algebra is recommended."}
{"code": "CSE 205A", "title": "Logic in Computer Science", "units": "4", "anchor": "cse205a", "description": "(Formerly CSE 208D) Mathematical logic as a tool in computer science. Propositional logic, resolution, first-order logic, completeness and incompleteness theorems with computational viewpoint, finite model theory, descriptive complexity, logic programming, nonmonotonic reasoning, temporal logic. Applications to databases, automatic theorem proving, program verification, and distributed systems. Prerequisites: CSE 200 or consent of instructor.", "prereqs": "CSE 200"}
{"code": "CSE 206A", "title": "Lattice Algorithms and Applications", "units": "4", "anchor": "cse206a", "description": "(Formerly CSE 207C) Introduction to the algorithmic theory of point lattices (aka algorithmic geometry of numbers), and some of its most important applications in cryptography and cryptanalysis. Topics usually include LLL basis reduction algorithm, cryptanalysis of broadcast RSA, hardness of approximating lattice problems. Prerequisites: CSE 202, CSE 200, or concurrent.", "prereqs": {"type": "all", "courses": ["CSE 202", "CSE 200"]}}
{"code": "CSE 207", "title": "Modern Cryptography", "units": "4", "anchor": "cse207", "description": "Private and public key cryptography, introduction to reduction-based proofs of security, concrete security, block ciphers, pseudorandom functions and generators, symmetric encryption, asymmetric encryption, computational number theory, RSA and discrete log systems, message authentication, digital signatures, key distribution and key management. Prerequisites: CSE 202 or consent of instructor.", "prereqs": "CSE 202"}
{"code": "CSE 208", "title": "Advanced Cryptography", "units": "4", "anchor": "cse208", "description": "Zero-knowledge, secure computation, session-key distribution, protocols, electronic payment, one-way functions, trapdoor permutations, pseudorandom bit generators, hardcore bits. Prerequisites: CSE 202, CSE 200, and CSE 207 or consent of instructor.", "prereqs": {"type": "all", "courses": ["CSE 202", "CSE 200", "CSE 207"]}}
{"code": "CSE 209A", "title": "Topics/Seminar in Algorithms, Complexity, and Logic", "units": "1–4", "anchor": "cse209a", "description": "Topics of special interest in algorithms, complexity, and logic to be presented by faculty and students under faculty direction. Topics vary from quarter to quarter. May be repeated for credit. Prerequisites: consent of instructor."}
{"code": "CSE 209B", "title": "Topics/Seminar in Cryptography", "units": "1–4", "anchor": "cse209b", "description": "Topics of special interest in cryptography to be presented by faculty and students under faculty direction. Topics vary from quarter to quarter. May be repeated for credit. Prerequisites: consent of instructor."}
{"code": "CSE 210", "title": "Principles of Software Engineering", "units": "4", "anchor": "cse210", "description": "(Formerly CSE 264A.) General principles in modern software engineering. Both theoretical and practical topics are covered. Theoretical topics include proofs of correctness, programming language semantics, and theory of testing. Practical topics include structured programming, modularization techniques, design of languages for reliable programming, and software tools. Prerequisites: CSE 100, 131A, 120, or consent of instructor.", "prereqs": {"type": "all", "courses": ["CSE 100", "CSE 131A", "CSE 120"]}}
{"code": "CSE 211", "title": "Software Testing and Analysis", "units": "4", "anchor": "cse211", "description": "Survey of testing and analysis methods. Introduction to advanced topics in area as well as traditional production methods. Topics include inspections and reviews, formal analysis, verification and validation standards, nonstatistical testing, statistical-testing and reliability models, coverage methods, testing and analysis tools, and organization management and planning. Methods special to special development approaches such as object-oriented testing will also be described. Prerequisites: undergraduate major in computer science or extensive industrial experience."}
{"code": "CSE 216", "title": "Research Topics in Human-Computer Interaction", "units": "4", "anchor": "cse216", "description": "Prepares students to conduct original HCI research by reading and discussing seminal and cutting-edge research papers. Topics include design, social software, input techniques, mobile, and ubiquitous computing. Student pairs perform a quarter-long mini research project that leverages campus research efforts. Cross-listed with COGS 230. Prerequisites: none."}
{"code": "CSE 218", "title": "Advanced Topics in Software Engineering", "units": "4", "anchor": "cse218", "description": "This course will cover a current topic in software engineering in depth. Topics in the past have included software tools, impacts of programming language design, and software system structure. (S/U grades permitted.) Prerequisites: none."}
{"code": "CSE 219", "title": "Design at Large", "units": "1", "anchor": "cse219", "description": "New societal challenges, cultural values, and technological opportunities are changing design—and vice versa. The seminar explores this increased scale, real-world engagement, and disruptive impact. Invited speakers from UC San Diego and beyond share cutting-edge research on interaction, design, and learning. Cross-listed with COGS 229. (S/U grades only.) Prerequisites: none."}
{"code": "CSE 221", "title": "Operating Systems", "units": "4", "anchor": "cse221", "description": "Operating system structures, concurrent computation models, scheduling, synchronization mechanisms, address spaces, memory management protection and security, buffering, streams, data-copying reduction techniques, file systems, naming, caching, disk organization, mapped files, remote file systems, case studies of major operating systems. Prerequisites: CSE 120 and 121, or consent of instructor.", "prereqs": {"type": "all", "courses": ["CSE 120", "CSE 121"]}}
{"code": "CSE 222A", "title": "Computer Communication Networks", "units": "4", "anchor": "cse222a", "description": "(Formerly CSE 222.) Computer communication network concepts, protocols, and architectures, with an emphasis on an analysis of algorithms, protocols, and design methodologies. Topics will include layering, error control, flow control, congestion control, switching and routing, quality of service management, mobility, naming, security, and selected contemporary topics. Prerequisites: CSE 123A or consent of instructor.", "prereqs": "CSE 123A"}
{"code": "CSE 222B", "title": "Internet Algorithmics", "units": "4", "anchor": "cse222b", "description": "(Formerly CSE 228H.) Techniques for speeding up internet implementations, including system restructuring, new algorithms, and hardware innovations. Topics include models for protocols, systems and hardware; efficiency principles; applying these principles to deriving techniques for efficient implementation of common endnode and router functions. Prerequisites: CSE 123A or CSE 222A, or consent of instructor.", "prereqs": {"type": "one", "courses": ["CSE 123A", "CSE 222A"]}}
{"code": "CSE 223B", "title": "Distributed Computing and Systems", "units": "4", "anchor": "cse223b", "description": "Efficient primitives for distributed operating systems and high-performance network servers, including concurrent and event-driven server architectures, remote procedure calls, and load shedding. Distributed naming, directory, and storage services, replication for fault tolerance, and security in distributed systems. Prerequisites: CSE 221, CSE 222A, or consent of instructor.", "prereqs": {"type": "all", "courses": ["CSE 221", "CSE 222A"]}}
{"code": "CSE 224", "title": "Graduate Networked Systems", "units": "4", "anchor": "cse224", "description": "This course will provide a broad understanding of network design and implementation. Topics include techniques for building distributed applications, sockets programming, remote procedure calls (RPC), scale-out distributed directories, distributed consensus and state management, fault tolerance, networked storage, indirection, overlay networks, load balancing, and datacenter design. Prerequisites: graduate standing or consent of instructor. This course is intended for MS students. PhD students may only take the course if they are not in systems/networking concentrations."}
{"code": "CSE 227", "title": "Computer Security", "units": "4", "anchor": "cse227", "description": "Security and threat models, risk analysis, authentication and authorization, auditing, operating systems security, access control mechanisms, protection mechanisms, distributed systems/network security, security architecture, electronic commerce security mechanisms, security evaluation. Prerequisites: CSE 221 or consent of instructor.", "prereqs": "CSE 221"}
{"code": "CSE 229A", "title": "Topics/Seminar in Computer Systems", "units": "1–4", "anchor": "cse229a", "description": "Discussion on problems of current research interest in computer systems. Possible areas of focus include distributed computing, computational grid, operating systems, fault-tolerant computing, storage systems, system services for the World Wide Web. Topics to be presented by faculty and students under faculty direction. Topics vary from quarter to quarter. May be repeated for credit. Prerequisites: consent of instructor."}
{"code": "CSE 229C", "title": "Topics/Seminar in Computer Security", "units": "1–4", "anchor": "cse229c", "description": "Discussion on problems of current research interest in computer security. Topics to be presented by faculty and students under faculty direction. Topics vary from quarter to quarter. May be repeated for credit. Prerequisites: consent of instructor."}
{"code": "CSE 230", "title": "Principles of Programming Languages", "units": "4", "anchor": "cse230", "description": "(Formerly CSE 273.) Functional versus imperative programming. Type systems and polymorphism; the ML language. Higher order functions, lazy evaluation. Abstract versus concrete syntax, structural and well-founded induction. The lambda calculus, reduction strategies, combinators. Denotational semantics, elementary domain theory. Prerequisites: CSE 130 or equivalent, or consent of instructor.", "prereqs": "CSE 130"}
{"code": "CSE 231", "title": "Advanced Compiler Design", "units": "4", "anchor": "cse231", "description": "(Formerly CSE 264C.) Advanced material in programming languages and translator systems. Topics include compilers, code optimization, and debugging interpreters. Prerequisites: CSE 100, 131A–B, or consent of instructor.", "prereqs": {"type": "all", "courses": ["CSE 100", "CSE 131A", "CSE 131B"]}}
{"code": "CSE 232", "title": "Principles of Database Systems", "units": "4", "anchor": "cse232", "description": "(Formerly CSE 264D.) Database models including relational, hierarchic, and network approaches. Implementation of databases including query languages and system architectures. Prerequisites: CSE 100 or consent of instructor.", "prereqs": "CSE 100"}
{"code": "CSE 232B", "title": "Database System Implementation", "units": "4", "anchor": "cse232b", "description": "A hands-on approach to the principles of databases implementation. Algebraic rewriters/optimizers, query processors, triggers. Beyond centralized relational databases. Prerequisites: CSE 232.", "prereqs": "CSE 232"}
{"code": "CSE 233", "title": "Database Theory", "units": "4", "anchor": "cse233", "description": "Theory of databases. Theory of query languages, dependency theory, deductive databases, incomplete information, complex objects, object-oriented databases, and more. Connections to logic and complexity theory including finite model theory and descriptive complexity. Prerequisites: CSE 200.", "prereqs": "CSE 200"}
{"code": "CSE 237A", "title": "Introduction to Embedded Computing", "units": "4", "anchor": "cse237a", "description": "Embedded system technologies including processors, DSP, memory, and software. System interfacing basics, communication strategies, sensors, and actuators. Mobile and wireless technology in embedded systems. Using predesigned hardware and software components. Design case studies in wireless, multimedia, and/or networking domains. Prerequisites: basic courses in digital hardware, algorithms and data structures, elementary calculus, and probability; or consent of instructor."}
{"code": "CSE 237B", "title": "Software for Embedded Systems", "units": "4", "anchor": "cse237b", "description": "Embedded computing elements, device interfaces, time-critical IO handling. Embedded software design under size, performance, and reliability constraints. Software timing and functional validation. Programming methods and compilation for embeddable software. Embedded runtime systems. Case studies of real-time software systems. Prerequisites: CSE 237A; or basic courses in programming, algorithms and data structures, elementary calculus, discrete math, computer architecture; or consent of instructor.", "prereqs": "CSE 237A"}
{"code": "CSE 237C", "title": "Validation and Testing of Embedded Systems", "units": "4", "anchor": "cse237c", "description": "Embedded system building blocks including IP cores. Cosimulation. Formal verification using model checking. Verification environments. Test challenges in core integration: compliance, feature, random, and collision testing. Core access and test integration. Interface-based verification and standards. Prerequisites: CSE 237A; or basic courses in algorithms and data structures, elementary calculus, discrete math, symbolic logic, computer architecture; or consent of instructor.", "prereqs": "CSE 237A"}
{"code": "CSE 237D", "title": "Design Automation and Prototyping for Embedded Systems", "units": "4", "anchor": "cse237d", "description": "System representation and modeling. Abstract and language models. Simulation as a modeling activity. Computational and hw/sw system prototypes. System analysis using models. Constraint and interface modeling. Behavioral compilation and synthesis. Prerequisites: CSE 237A; or basic courses in digital logic design, algorithms and data structures, elementary calculus, discrete math, symbolic logic, computer architecture; or consent of instructor.", "prereqs": "CSE 237A"}
{"code": "CSE 239A", "title": "Topics/Seminar in Databases", "units": "1–4", "anchor": "cse239a", "description": "Discussion on problems of current research interest in databases. Possible areas of focus include core database issues, data management on the web, data integration, new database models and applications, formal methods in databases. Topics to be presented by faculty and students under faculty direction. Topics vary from quarter to quarter. May be repeated for credit. Prerequisites: consent of instructor."}
{"code": "CSE 239B", "title": "Topics/Seminar in Programming Languages", "units": "1–2", "anchor": "cse239b", "description": "Discussion on problems of current research interest in programming languages, formal methods, and software engineering. Possible areas of focus include program verification, program synthesis, language design and implementation, developer productivity tools, language-based security. Topics to be presented by faculty and students under faculty direction. Topics vary from quarter to quarter. May be taken for credit up to eighteen times for a maximum of eighteen units. Prerequisites: consent of instructor."}
{"code": "CSE 240A", "title": "Principles of Computer Architecture", "units": "4", "anchor": "cse240a", "description": "(Formerly CSE 240.) This course will cover fundamental concepts in computer architecture. Topics include instruction set architecture, pipelining, pipeline hazards, bypassing, dynamic scheduling, branch prediction, superscalar issue, memory-hierarchy design, advanced cache architectures, and multiprocessor architecture issues. Prerequisites: CSE 141 or consent of instructor.", "prereqs": "CSE 141"}
{"code": "CSE 240B", "title": "Parallel Computer Architecture", "units": "4", "anchor": "cse240b", "description": "This course covers advanced topics in parallel computer architecture, including on-chip and off-chip interconnection networks, cache coherence, cache consistency, hardware multithreading, multicore and tiled architectures. It incorporates the latest research and development on parallel architectures and compilation techniques for those architectures. CSE 240A recommended. Prerequisites: graduate standing."}
{"code": "CSE 240C", "title": "Advanced Microarchitecture", "units": "4", "anchor": "cse240c", "description": "This course covers advanced topics in computer architecture. It incorporates the latest research and development on topics such as branch prediction, instruction-level parallelism, cache hierarchy design, speculative multithreading, reliable architectures, and power-management techniques. CSE 240A recommended. Prerequisites: graduate standing."}
{"code": "CSE 241A", "title": "VLSI Integration of Computing Circuitry", "units": "4", "anchor": "cse241a", "description": "VLSI integrated-circuit building blocks of computing systems, and their implementation. Computer-aided design and performance simulations, design exercises and projects. Devices, standard cells and interconnects, clocking, power/ground distribution, arithmetic modules, memories. Methodologies and tradeoffs in system implementation. Prerequisites: layout (CSE 165 or ECE 260A) and logic design (CSE 140 or ECE 111), or consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["CSE 165", "ECE 260A"]}, {"type": "one", "courses": ["CSE 140", "ECE 111"]}]}}
{"code": "CSE 243A", "title": "Introduction to Synthesis Methodologies in VLSI CAD", "units": "4", "anchor": "cse243a", "description": "Hardware software codesign, architectural level synthesis, control synthesis and optimization, scheduling, binding, register and bus sharing, interconnect design, module selection, combinational logic optimization, state minimization, state encoding, and retiming. Prerequisites: none."}
{"code": "CSE 244A", "title": "VLSI Test", "units": "4", "anchor": "cse244a", "description": "Design for test, testing economics, defects, failures and faults, fault models, fault simulation, automatic test pattern generation, functional testing, memory, PLA, FPGA, microprocessor test, and fault diagnosis. Prerequisites: none."}
{"code": "CSE 245", "title": "Computer Aided Circuit Simulation and Verification", "units": "4", "anchor": "cse245", "description": "This course is about the computer algorithms, techniques, and theory used in the simulation and verification of electrical circuits. Prerequisites: CSE 241A or consent of instructor.", "prereqs": "CSE 241A"}
{"code": "CSE 248", "title": "Algorithmic and Optimization Foundations for VLSI CAD", "units": "4", "anchor": "cse248", "description": "Algorithmic techniques and optimization frameworks for large-scale, difficult optimizations. Primal-dual multicommodity flow approximations, approximations for geometric and graph Steiner formulations, continuous placement optimization, heuristics for Boolean satisfiability, multilevel methods, semidefinite programming, and application to other formulations (e.g., scheduling). Prerequisites: CSE 241A or CSE 242A, or consent of instructor.", "prereqs": {"type": "one", "courses": ["CSE 241A", "CSE 242A"]}}
{"code": "CSE 249A", "title": "Topics/Seminar in Computer Architecture", "units": "1–4", "anchor": "cse249a", "description": "Topics of special interest in computer architecture to be presented by faculty and students under faculty direction. Topics vary from quarter to quarter. May be repeated for credit. Prerequisites: consent of instructor."}
{"code": "CSE 249B", "title": "Topics/Seminar in VLSI", "units": "1–4", "anchor": "cse249b", "description": "Topics of special interest in VLSI to be presented by faculty and students under faculty direction. Topics vary from quarter to quarter. May be repeated for credit. Prerequisites: consent of instructor."}
{"code": "CSE 250A", "title": "Principles of Artificial Intelligence: Probabilistic Reasoning and Learning", "units": "4", "anchor": "cse250a", "description": "Methods based on probability theory for reasoning and learning under uncertainty. Content may include directed and undirected probabilistic graphical models, exact and approximate inference, latent variables, expectation-maximization, hidden Markov models, Markov decision processes, applications to vision, robotics, speech, and/or text. Recommended preparation: CSE 103 or similar course. Prerequisites: graduate standing in CSE or consent of instructor."}
{"code": "CSE 251A", "title": "Principles of Machine Learning: Learning Algorithms", "units": "4", "anchor": "cse251a", "description": "(Formerly CSE 250B.) Algorithms for supervised and unsupervised learning from data. Content may include maximum likelihood; log-linear models, including logistic regression and conditional random fields; nearest neighbor methods; kernel methods; decision trees; ensemble methods; optimization algorithms; topic models; neural networks; and backpropagation. Renumbered from CSE 250B. Students may not receive credit for CSE 251A and CSE 250B. Recommended preparation: CSE 103 or similar course. Prerequisites: graduate standing or consent of instructor."}
{"code": "CSE 251B", "title": "Principles of Machine Learning: Neural Networks for Pattern Recognition", "units": "4", "anchor": "cse251b", "description": "(Formerly CSE 253.) This course covers Hopfield networks, application to optimization problems layered perceptrons, recurrent networks, and unsupervised learning. Programming exercises explore model behavior with a final project or exam on a cognitive science, artificial intelligence, or optimization problem of the student’s choice. Renumbered from CSE 253. Students may not receive credit for CSE 251B and CSE 253. Recommended preparation: Knowledge of C. Prerequisites: graduate standing."}
{"code": "CSE 251C", "title": "Principles of Machine Learning: Machine Learning Theory", "units": "4", "anchor": "cse251c", "description": "(Formerly CSE 250C.) Theoretical foundations of machine learning. Topics include concentration of measure, the PAC model, uniform convergence bounds, and VC dimension. Possible topics include online learning, learning with expert advice, multiarmed bandits, and boosting. Renumbered from CSE 250C. Students may not receive credit for CSE 251C and CSE 250C. Recommended preparation: CSE 103 and CSE 101 or similar course. Prerequisites: graduate standing or consent of instructor."}
{"code": "CSE 252A", "title": "Computer Vision I", "units": "4", "anchor": "cse252a", "description": "Comprehensive introduction to computer vision providing broad coverage including low-level vision (image formation, photometry, color, image feature detection), inferring 3-D properties from images (shape-from shading, stereo vision, motion interpretation) and object recognition. Companion to CSE 252B covering complementary topics. Prerequisites: MATH 10D and MATH 20A–F or equivalent.", "prereqs": {"type": "all", "courses": ["MATH 10D", "MATH 20A", "MATH 20B", "MATH 20C", "MATH 20D", "MATH 20E", "MATH 20F"]}}
{"code": "CSE 252B", "title": "Computer Vision II", "units": "4", "anchor": "cse252b", "description": "Comprehensive introduction to computer vision providing focused coverage of multiview geometry, structure from motion, image segmentation, motion segmentation, texture analysis and recognition, object detection, and image-based rendering. Companion to CSE 252A covering complementary topics. Prerequisites: MATH 10D and MATH 20A–F or equivalent.", "prereqs": {"type": "all", "courses": ["MATH 10D", "MATH 20A", "MATH 20B", "MATH 20C", "MATH 20D", "MATH 20E", "MATH 20F"]}}
{"code": "CSE 252C", "title": "Selected Topics in Vision and Learning", "units": "1–4", "anchor": "cse252c", "description": "Selected topics in computer vision and statistical pattern recognition, with an emphasis on recent developments. Possible topics include grouping and segmentation, object recognition and tracking, multiple view geometry, kernel-based methods, dimensionality reduction, and mixture models. Prerequisites: CSE 252 or equivalent and CSE 250B or equivalent.", "prereqs": {"type": "all", "courses": ["CSE 252", "CSE 250B"]}}
{"code": "CSE 252D", "title": "Advanced Computer Vision", "units": "4", "anchor": "cse252d", "description": "This course covers advanced concepts in computer vision. Example topics include 3-D reconstruction, face recognition, object detection, semantic segmentation, action recognition, and domain adaptation. Consistent with recent developments, deep learning forms a significant fraction of the class. Lectures and assignments cover recent works on fundamental problems in computer vision, with the aim to prepare students for pursuing careers in the field. Recommended preparation: Completion of one of CSE 252A, 252B, 250A, or 250B is highly recommended. Prerequisites: graduate standing."}
{"code": "CSE 254", "title": "Statistical Learning", "units": "4", "anchor": "cse254", "description": "Learning algorithms based on statistics. Possible topics include minimum-variance unbiased estimators, maximum likelihood estimation, likelihood ratio tests, resampling methods, linear logistic regression, feature selection, regularization, dimensionality reduction, manifold detection. An upper-division undergraduate course on probability and statistics such as MATH 183 or 186, or any graduate course on statistics, pattern recognition, or machine learning is recommended. Prerequisites: graduate standing."}
{"code": "CSE 255", "title": "Data Mining and Predictive Analytics", "units": "4", "anchor": "cse255", "description": "Learning methods for applications. Content may include data preparation, regression and classification algorithms, support vector machines, random forests, class imbalance, overfitting, decision theory, recommender systems and collaborative filtering, text mining, analyzing social networks and social media, protecting privacy, A/B testing. Recommended preparation: CSE 103 or similar. Prerequisites: graduate standing or consent of instructor."}
{"code": "CSE 256", "title": "Statistical Natural Language Processing", "units": "4", "anchor": "cse256", "description": "An introduction to modern statistical approaches to natural language processing: part of speech tagging, word sense disambiguation and parsing, using Markov models, hidden Markov models, and probabilistic context-free grammars. Recommended preparation: LIGN 165, LIGN 245, CSE 151, CSE 250A, or CSE 254. Prerequisites: graduate standing or consent of instructor."}
{"code": "CSE 257", "title": "Search and Optimization", "units": "4", "anchor": "cse257", "description": "The course will cover core algorithms for sequential decision-making problems in autonomous systems. Topics include heuristic search, Monte Carlo search, deep reinforcement learning, nonlinear optimization, mixed-integer optimization, and stochastic optimization. Prerequisites: graduate standing or consent of instructor."}
{"code": "CSE 258", "title": "Recommender Systems and Web Mining", "units": "4", "anchor": "cse258", "description": "Current methods for data mining and predictive analytics. Emphasis is on studying real-world data sets, building working systems, and putting current ideas from machine learning research into practice. Recommended preparation: No previous background in machine learning is required, but students should be comfortable with programming (all example code will be in Python), and with basic optimization and linear algebra. Prerequisites: graduate standing."}
{"code": "CSE 258A", "title": "Cognitive Modeling", "units": "4", "anchor": "cse258a", "description": "Connectionist models and a sampling of other cognitive modeling techniques. Models of language processing, memory, sequential processes, and vision. Areas covered may vary depending on student and faculty interests. Can be repeated for credit. CSE 151 or CSE 250B or CSE 253 or CSE 254, or equivalent experience recommended. Prerequisites: graduate standing."}
{"code": "CSE 259", "title": "Seminar in Artificial Intelligence", "units": "1", "anchor": "cse259", "description": "A weekly meeting featuring local (and occasional external) speakers discussing their current research in artificial intelligence neural networks, and genetic algorithms. (S/U grades only.) Prerequisites: none."}
{"code": "CSE 260", "title": "Parallel Computation", "units": "4", "anchor": "cse260", "description": "(Formerly CSE 274A.) This course provides an overview of parallel hardware, algorithms, models, and software. Topics include Flynn’s taxonomy, interconnection networks, memory organization, a survey of commercially available multiprocessors, parallel algorithm paradigms and complexity criteria, parallel programming environments and tools for parallel debugging, language specification, mapping, performance, etc. Prerequisites: graduate standing or consent of instructor."}
{"code": "CSE 262", "title": "System Support for Applications of Parallel Computation", "units": "4", "anchor": "cse262", "description": "This course will explore design of software support for applications of parallel computation. Topics include programming languages, run time support, portability, and load balancing. The course will terminate in a project. Prerequisites: consent of instructor."}
{"code": "CSE 272", "title": "Advanced Image Synthesis", "units": "4", "anchor": "cse272", "description": "Computer graphics techniques for creating realistic images. Topics include ray tracing, global illumination, subsurface scattering, and participating media. CSE 168 or equivalent recommended."}
{"code": "CSE 274", "title": "Selected Topics in Graphics", "units": "2–4", "anchor": "cse274", "description": "Selected topics in computer graphics, with an emphasis on recent developments. Possible topics include computer animation, shape modeling and analysis, image synthesis, appearance modeling, and real-time rendering. CSE 168 or CSE 169 recommended. Prerequisites: graduate standing or consent of instructor."}
{"code": "CSE 276A", "title": "Introduction to Robotics", "units": "4", "anchor": "cse276a", "description": "This course provides an introduction to the fundamentals of robotics across kinematics, sensor systems, estimation, control, and planning. The contents include introduction to robotics in general, kinematics of robot systems, robot arm systems, sensors for robots, basic vision for robots, estimation methods, perception, robot localization and navigation, control of robot systems, robot motion planning, robot task planning, robot architectures, and evaluation of robot systems. It is expected that students have a solid understanding of linear algebra, can program in Python or C++, and have a basic understanding of methods for reasoning under uncertainty. Prerequisites: graduate standing."}
{"code": "CSE 276B", "title": "Human Robot Interaction", "units": "4", "anchor": "cse276b", "description": "Robots are entering human spaces. How do we make them functional, useful, and acceptable? This course explores the core computational, engineering, and experimental challenges in human-robot interaction. Course topics include shared autonomy, perception of people and context, coordination, collaboration, human-guided learning, robot design, and experimental robotics. Students will review seminal and recent papers in the field and engage in team-based projects with physical, mobile robots. This class requires expertise in software development. Prior exposure to robotics, computer vision, or machine learning is recommended. Students should be comfortable reading and analyzing scientific papers at the graduate level. Students may not receive credit for CSE 276B and CSE 291 (A00) taught winter 2017 with the same subtitle. Prerequisites: graduate standing."}
{"code": "CSE 276C", "title": "Mathematics for Robotics", "units": "4", "anchor": "cse276c", "description": "The course will provide a comprehensive introduction to the key mathematical concepts used for modeling, implementing, and evaluation of robot systems. The course will use small home assignments tasks and a larger robot project to exercise the topics covered in class. The students should have a basic knowledge of mathematics and know one or more programming languages such as Python or MATLAB for completion of homework assignments. Prerequisites: graduate standing."}
{"code": "CSE 276D", "title": "Healthcare Robotics", "units": "4", "anchor": "cse276d", "description": "Robotics has the potential to improve well-being for millions of people, support care givers, and aid the clinical workforce. This course brings together engineers, clinicians, and end users to explore this exciting new field. It is project-based, interactive, and hands on, and involves working closely with stakeholders to develop prototypes that solve real-world problems. Students will explore the latest research in healthcare robotics, human-robot teaming, and health design. JSOE students should be comfortable building and experimenting within their area of expertise (e.g., CSE, software development, MAE, rapid prototyping). Students with clinical backgrounds should be familiar with translational research methods. Students may not receive credit for CSE 276D and CSE 291 (H00) taught spring 2017 with the same subtitle. Program or materials fees may apply. Prerequisites: graduate standing."}
{"code": "CSE 276E", "title": "Robot Systems Design and Implementation", "units": "4", "anchor": "cse276e", "description": "End to end system design of embedded electronic systems including PCB design and fabrication, software control system development, and system integration. Program or materials fees may apply. May be coscheduled with CSE 176E. Prerequisites: instructor approval required to ensure sufficient programming and project experience to be successful in the course."}
{"code": "CSE 280A", "title": "Algorithms in Computational Biology", "units": "4", "anchor": "cse280a", "description": "(Formerly CSE 206B.) The course focuses on algorithmic aspects of modern bioinformatics and covers the following topics: computational gene hunting, sequencing, DNA arrays, sequence comparison, pattern discovery in DNA, genome rearrangements, molecular evolution, computational proteomics, and others. Prerequisites: CSE 202 preferred or consent of instructor.", "prereqs": "CSE 202"}
{"code": "CSE 282", "title": "Bioinformatics II: Sequence and Structure Analysis—Methods and Applications", "units": "4", "anchor": "cse282", "description": "(Formerly CSE 257A/BENG 202.) Introduction to methods for sequence analysis. Applications to genome and proteome sequences. Protein structure, sequence-structure analysis. Prerequisites: Pharm 201 or consent of instructor."}
{"code": "CSE 283", "title": "Bioinformatics III: Functional Genomics", "units": "4", "anchor": "cse283", "description": "Annotating genomes, characterizing functional genes, profiling, reconstructing pathways. Prerequisites: Pharm 201, BENG 202/CSE 282, or consent of instructor.", "prereqs": {"type": "one", "courses": ["BENG 202", "CSE 282"]}}
{"code": "CSE 284", "title": "Personal Genomics for Bioinformaticians", "units": "4", "anchor": "cse284", "description": "This course provides an introduction to bioinformatics techniques for analyzing and interpreting human genomes. Topics covered include an introduction to medical and population genetics, ancestry, finding and interpreting disease-causing variants, genome-wide association studies, genetic risk prediction, analyzing next-generation sequencing data, how to scale current genomics techniques to analyze hundreds of thousands of genomes, and the social impact of the personal genomics revolution. Programming experience, familiarity with the UNIX command line, and a basic course in probability and statistics are strongly recommended. Students may not receive credit for CSE 284 and CSE 291 (E00) taught winter 2017 with the same subtitle. Prerequisites: graduate standing."}
{"code": "CSE 290", "title": "Seminar in Computer Science and Engineering", "units": "1–4", "anchor": "cse290", "description": "(Formerly CSE 280A.) A seminar course in which topics of special interest in computer science and engineering will be presented by staff members and graduate students under faculty direction. Topics vary from quarter to quarter. May be repeated for credit. (S/U grades only.) Prerequisites: consent of instructor. (Offered as faculty resources permit.)"}
{"code": "CSE 291", "title": "Topics in Computer Science and Engineering", "units": "1–4", "anchor": "cse291", "description": "Topics of special interest in computer science and engineering. Topics may vary from quarter to quarter. May be taken for credit nine times with the consent of instructor. Prerequisites: consent of instructor. (S/U grades permitted.) (Offered as faculty resources permit.)"}
{"code": "CSE 292", "title": "Faculty Research Seminar", "units": "1", "anchor": "cse292", "description": "(Formerly CSE 282.) Computer science and engineering faculty will present one-hour seminars of the current research work in their areas of interest. Prerequisites: CSE graduate status."}
{"code": "CSE 293", "title": "Special Project in Computer Science and Engineering", "units": "1–12", "anchor": "cse293", "description": "The student will conceive, design, and execute a project in computer science under the direction of a faculty member. The project will typically include a large programming or hardware design task, but other types of projects are possible. Prerequisites: CSE graduate student status. (CS 75, 76, 77, 78, 79, 80, 81) (S/U grades only.)"}
{"code": "CSE 294", "title": "Research Meeting in CSE", "units": "2", "anchor": "cse294", "description": "Advanced study and analysis of active research in computer science and computer engineering. Discussion of current research and literature in the research specialty of the staff member teaching the course. Prerequisites: consent of instructor."}
{"code": "CSE 298", "title": "Independent Study", "units": "1–16", "anchor": "cse298", "description": "Open to properly qualified graduate students who wish to pursue a problem through advanced study under the direction of a member of the staff. (S/U grades only.) Prerequisites: consent of instructor."}
{"code": "CSE 299", "title": "Research", "units": "1–16", "anchor": "cse299", "description": "Research. Prerequisites: consent of faculty."}
{"code": "CSE 500", "title": "Teaching Assistantship", "units": "2–4", "anchor": "cse500", "description": "A course in which teaching assistants are aided in learning proper teaching methods by means of supervision of their work by the faculty: handling of discussions, preparation and grading of examinations and other written exercises, and student relations. May be used to meet teaching experience requirement for candidates for the PhD degree. Number of units for credit depends on number of hours devoted to class or section assistance. Prerequisites: graduate standing and consent of instructor."}
{"code": "CSE 599", "title": "Teaching Methods in Computer Science", "units": "2", "anchor": "cse599", "description": "Training in teaching methods in the field of computer science. This course examines theoretical and practical communication and teaching techniques particularly appropriate to computer science. Prerequisites: consent of faculty."}
