{"code": "ECON", "name": "Economics", "link": "https://catalog.ucsd.edu/courses/ECON.html"}
{"code": "ECON 1", "title": "Principles of Microeconomics", "units": "4", "anchor": "econ1", "description": "Introduction to the study of the economic system. Course will introduce the standard economic models used to examine how individuals and firms make decisions in perfectly competitive markets, and how these decisions affect supply and demand in output markets."}
{"code": "ECON 2", "title": "Market Imperfections and Policy", "units": "4", "anchor": "econ2", "description": "Analysis of monopoly and imperfectly competitive markets, market imperfections and the role of government. Prerequisites: ECON 1.", "prereqs": "ECON 1"}
{"code": "ECON 3", "title": "Principles of Macroeconomics", "units": "4", "anchor": "econ3", "description": "Introductory macroeconomics: unemployment, inflation, business cycles, monetary and fiscal policy. Prerequisites: ECON 1.", "prereqs": "ECON 1"}
{"code": "ECON 4", "title": "Financial Accounting", "units": "4", "anchor": "econ4", "description": "(Cross-listed with MGT 4.) Recording, organizing, and communicating financial information relating to business entities. Credit not allowed for both ECON 4 and MGT 4."}
{"code": "ECON 5", "title": "Data Analytics for the Social Sciences", "units": "4", "anchor": "econ5", "description": "(Cross-listed with POLI 5D.) Introduction to probability and analysis for understanding data in the social world. Students engage in hands-on learning with applied social science problems. Basics of probability, visual display of data, data collection and management, hypothesis testing, and computation. Students may receive credit for only one of the following courses: ECON 5, POLI 5, or POLI 5D."}
{"code": "ECON 87", "title": "First-year Student Seminar", "units": "1", "anchor": "econ87", "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students. May be repeated when course topics vary. (P/NP grades only.)"}
{"code": "ECON 100A", "title": "Microeconomics A", "units": "4", "anchor": "econ100a", "description": "Economic analysis of household determination of the demand for goods and services, consumption/saving decisions, and the supply of labor. Prerequisites: ECON 1 and MATH 10C or 20C or 31BH.", "prereqs": {"type": "all", "courses": ["ECON 1", {"type": "one", "courses": ["MATH 10C", "MATH 20C", "MATH 31BH"]}]}}
{"code": "ECON 100B", "title": "Microeconomics B", "units": "4", "anchor": "econ100b", "description": "Analysis of firms’ production and costs, the supply of output and demand factors of production. Analysis of perfectly competitive markets. Prerequisites: ECON 100A.", "prereqs": "ECON 100A"}
{"code": "ECON 100C", "title": "Microeconomics C", "units": "4", "anchor": "econ100c", "description": "Analysis of the effects of imperfect market structure, strategy, and imperfect information. Prerequisites: ECON 100B.", "prereqs": "ECON 100B"}
{"code": "ECON 100AH", "title": "Honors Microeconomics A", "units": "1", "anchor": "econ100ah", "description": "Honors sequence expanding on the material taught in ECON 100A. Major GPA of 3.5 or better required. May be taken concurrently with ECON 100A or after successful completion of ECON 100A with A– or better or consent of instructor. Priority enrollment given to majors in the department. Prerequisites: department approval required."}
{"code": "ECON 100BH", "title": "Honors Microeconomics B", "units": "1", "anchor": "econ100bh", "description": "Honors sequence expanding on the material taught in ECON 100B. Major GPA of 3.5 or better required. May be taken concurrently with ECON 100B or after successful completion of ECON 100B with A– or better or consent of instructor. Priority enrollment given to majors in the department. Prerequisites: department approval required."}
{"code": "ECON 100CH", "title": "Honors Microeconomics C", "units": "1", "anchor": "econ100ch", "description": "Honors sequence expanding on the material taught in ECON 100C. Major GPA of 3.5 or better required. May be taken concurrently with ECON 100C or after successful completion of ECON 100C with A– or better or consent of instructor. Priority enrollment given to majors in the department. Prerequisites: department approval required."}
{"code": "ECON 101", "title": "International Trade", "units": "4", "anchor": "econ101", "description": "Examines theories of international trade in goods and services and relates the insights to empirical evidence. Explains international trade at the level of industries and firms and analyzes the consequences of trade for resource allocation, welfare, and the income distribution. Discusses sources of comparative advantage, motives for trade policies, and the effects of trade barriers and trading blocs on welfare and incomes. Prerequisites: ECON 100B or 102.", "prereqs": {"type": "one", "courses": ["ECON 100B", "ECON 102"]}}
{"code": "ECON 102", "title": "Globalization", "units": "4", "anchor": "econ102", "description": "Presents theories of global economic integration, grounded in the principle of comparative advantage. Investigates patterns of trade when trade is balanced and capital flows when trade is not balanced. Assesses the consequences of global economic integration and economic policies for industry location, incomes, welfare and economic growth, and studies goods, services and sovereign debt markets. Prerequisites: ECON 1 or 100B and 2 or 3 or MATH 20C.", "prereqs": {"type": "one", "courses": [{"type": "all", "courses": [{"type": "one", "courses": ["ECON 1", "ECON 100B"]}, {"type": "one", "courses": ["ECON 2", "ECON 3"]}]}, "MATH 20C"]}}
{"code": "ECON 102T", "title": "Advanced Topic in Globalization", "units": "2", "anchor": "econ102t", "description": "This course presents a selection of empirical applications and advanced topics that build on the material covered in ECON 102, Globalization. Students have the opportunity to analyze global trade and capital market data and to prepare a presentation and brief paper on a specific topic. Prerequisites: department approval required. May be taken concurrently with ECON 102 or after completion of ECON 102."}
{"code": "ECON 103", "title": "International Monetary Relations", "units": "4", "anchor": "econ103", "description": "Analyzes exchange rates and the current account. Relates their joint determination to financial markets and the real-side macroeconomy using international macroeconomic models and presents empirical regularities. Discusses macroeconomic policies under different exchange rate regimes and implications for financial stability and current account sustainability. Prerequisites: ECON 102 or 110B or 173A.", "prereqs": {"type": "one", "courses": ["ECON 102", "ECON 110B", "ECON 173A"]}}
{"code": "ECON 105", "title": "Industrial Organization and Firm Strategy", "units": "4", "anchor": "econ105", "description": "Theory of monopoly and oligopoly pricing, price discrimination, durable goods pricing, cartel behavior, price wars, strategic entry barriers, mergers, pro- and anticompetitive restraints on business. Prerequisites: ECON 100C.", "prereqs": "ECON 100C"}
{"code": "ECON 106", "title": "International Economic Agreements", "units": "4", "anchor": "econ106", "description": "Examines reasons for international economic agreements, their design, the strategic interactions that determine how the agreements are implemented and sustained, and consequences for global welfare and inequality. Draws on international economics, game theory, law and economics, and political economy to understand international economic agreements. These tools are used to understand multilateral trade and investment agreements, such as NAFTA, and international organizations, such as the WTO. Prerequisites: ECON 100B and 102.", "prereqs": {"type": "all", "courses": ["ECON 100B", "ECON 102"]}}
{"code": "ECON 107", "title": "Economic Regulation and Antitrust Policy", "units": "4", "anchor": "econ107", "description": "Detailed treatment of antitrust policy: Sherman Act, price fixing, collusive practices, predatory pricing, price discrimination, double marginalization, exclusive territories, resale price maintenance, refusal to deal, and foreclosure. Theory of regulation and regulatory experience in electrical utilities, oil, telecommunications, broadcasting, etc. Prerequisites: ECON 2 or 100B; and MATH 10C or 20C or 31BH.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["ECON 2", "ECON 100B"]}, {"type": "one", "courses": ["MATH 10C", "MATH 20C", "MATH 31BH"]}]}}
{"code": "ECON 109", "title": "Game Theory", "units": "4", "anchor": "econ109", "description": "Introduction to game theory. Analysis of people’s decisions when the consequences of the decisions depend on what other people do. This course features applications in economics, political science, and law. Prerequisites: ECON 100C or MATH 31CH or MATH 109 or (CSE 20 and MATH 20 C).", "prereqs": {"type": "one", "courses": ["ECON 100C", "MATH 31CH", "MATH 109", {"type": "all", "courses": ["CSE 20", "MATH 20"]}]}}
{"code": "ECON 109T", "title": "Advanced Topics in Game Theory", "units": "2", "anchor": "econ109t", "description": "This course presents a selection of applications and advanced topics that build on the material covered in the ECON 109. Game Theory course. Prerequisites: department approval required. May be taken concurrently with ECON 109 or after completion of ECON 109."}
{"code": "ECON 110A", "title": "Long Run Macroeconomics", "units": "4", "anchor": "econ110a", "description": "Analysis of the determination of long run growth and models of the determination of output, interest rates, and the price level. Analysis of inflation, unemployment, and monetary and fiscal policy. Prerequisites: ECON 1 and ECON 3 and MATH 10C or MATH 20C or MATH 31BH.", "prereqs": {"type": "all", "courses": ["ECON 1", "ECON 3", {"type": "one", "courses": ["MATH 10C", "MATH 20C", "MATH 31BH"]}]}}
{"code": "ECON 110B", "title": "Short Run Macroeconomics", "units": "4", "anchor": "econ110b", "description": "Analysis of the determination of consumption spending at the aggregate level; extension of the basic macro model to include exchange rates and international trade; the aggregate money supply, and the business cycle. Prerequisites: ECON 1 and ECON 3 and MATH 10C or MATH 20C or MATH 31BH.", "prereqs": {"type": "all", "courses": ["ECON 1", "ECON 3", {"type": "one", "courses": ["MATH 10C", "MATH 20C", "MATH 31BH"]}]}}
{"code": "ECON 110AH", "title": "Honors Macroeconomics A", "units": "1", "anchor": "econ110ah", "description": "Honors sequence expanding on the material taught in ECON 110A. Major GPA of 3.5 or better required. May be taken concurrently with ECON 110A or after successful completion of ECON 110A with A–or better or consent of instructor. Priority enrollment given to majors in the department. Prerequisites: department approval required."}
{"code": "ECON 110BH", "title": "Honors Macroeconomics B", "units": "1", "anchor": "econ110bh", "description": "Honors sequence expanding on the material taught in ECON 110B. Major GPA of 3.5 or better required. May be taken concurrently with ECON 110B or after successful completion of ECON 110B with A– or better or consent of instructor. Priority enrollment given to majors in the department. Prerequisites: department approval required."}
{"code": "ECON 111", "title": "Monetary Economics", "units": "4", "anchor": "econ111", "description": "Financial structure of the US economy. Bank behavior. Monetary control. Prerequisites: ECON 110B.", "prereqs": "ECON 110B"}
{"code": "ECON 112", "title": "Macroeconomic Data Analysis", "units": "4", "anchor": "econ112", "description": "Examines time series methods for data analysis with an emphasis on macroeconomic applications. Students are provided with an overview of fundamental time series techniques, hands-on experience in applying them to real-world macroeconomic data, and expertise in performing empirical tests of policy-relevant macroeconomic theories, such as the permanent income hypothesis, the Keynesian fiscal multiplier, and the Phillips curve. Prerequisites: ECON 110B and ECON 120B or MATH 181B. Enrollment limited to majors in the Department of Economics and MA33 only.", "prereqs": {"type": "all", "courses": ["ECON 110B", {"type": "one", "courses": ["ECON 120B", "MATH 181B"]}]}}
{"code": "ECON 113", "title": "Mathematical Economics", "units": "4", "anchor": "econ113", "description": "Mathematical concepts and techniques used in advanced economic analysis; applications to selected aspects of economic theory. Prerequisites: ECON 100C or MATH 140A or MATH 142A and MATH 18 or MATH 31AH.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["ECON 100C", "MATH 140A", "MATH 142A"]}, {"type": "one", "courses": ["MATH 18", "MATH 31AH"]}]}}
{"code": "ECON 116", "title": "Economic Development", "units": "4", "anchor": "econ116", "description": "Introduction to the economics of less developed countries, covering their international trade, human resources, urbanization, agriculture, income distribution, political economy, and environment. Prerequisites: ECON 2 or 100B.", "prereqs": {"type": "one", "courses": ["ECON 2", "ECON 100B"]}}
{"code": "ECON 117", "title": "Economic Growth", "units": "4", "anchor": "econ117", "description": "Basic economic dynamics, consumption versus growth with fixed or growing populations, the Harrod-Domar growth model, the neoclassical growth model, optimal growth, the Golden Rule, money and economic growth, technological progress and economic growth, human capital and endogenous economic growth, and alternative theories of growth and distribution. Prerequisites: ECON 100A.", "prereqs": "ECON 100A"}
{"code": "ECON 118", "title": "Law and Economics: Torts, Property, and Crime", "units": "4", "anchor": "econ118", "description": "Uses economic theory to evaluate the economic effects of US law in several legal fields, including tort law (accidents), products liability law, property law, criminal law (law enforcement), and litigation. Also considers risk bearing and why people buy insurance. Prerequisites: ECON 2 or 100A; and MATH 10A or 20A.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["ECON 2", "ECON 100A"]}, {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}]}}
{"code": "ECON 119", "title": "Law and Economics: Contracts and Corporations", "units": "4", "anchor": "econ119", "description": "This course asks how firms are organized and why the corporate form dominates, how corporations are governed and the distortions that result, when firms borrow and how they deal with financial distress and bankruptcy. The course will present basic legal doctrines in corporate law, contract law, debtor-creditor law, and bankruptcy, and use economic models to analyze whether and when these doctrines promote economically efficient behavior. Prerequisites: ECON 2 or 100A and MATH 10A or 20A.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["ECON 2", "ECON 100A"]}, {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}]}}
{"code": "ECON 120A", "title": "Econometrics A", "units": "4", "anchor": "econ120a", "description": "Probability and statistics used in economics. Probability and sampling theory, statistical inference, and use of spreadsheets. Credit not allowed for ECON 120A after ECE 109, MAE 108, MATH 180A, MATH 183, or MATH 186. Prerequisites: ECON 1; and MATH 10C or 20C or 31BH.", "prereqs": {"type": "all", "courses": ["ECON 1", {"type": "one", "courses": ["MATH 10C", "MATH 20C", "MATH 31BH"]}]}}
{"code": "ECON 120B", "title": "Econometrics B", "units": "4", "anchor": "econ120b", "description": "Basic econometric methods, including the linear regression, hypothesis testing, quantifying uncertainty using confidence intervals, and distinguishing correlation from causality. Credit not allowed for both ECON 120B after MATH 181B. Prerequisites: ECON 120A or ECE 109 or MAE 108 or MATH 180A or MATH 183 or MATH 186.", "prereqs": {"type": "one", "courses": ["ECON 120A", "ECE 109", "MAE 108", "MATH 180A", "MATH 183", "MATH 186"]}}
{"code": "ECON 120C", "title": "Econometrics C", "units": "4", "anchor": "econ120c", "description": "Advanced econometric methods: estimation of linear regression models with endogeneity, economic methods designed for panel data sets, estimation of discrete choice models, time series analysis, and estimation in the presence of autocorrelated and heteroskedastic errors. Prerequisites: ECON 120B or MATH 181B.", "prereqs": {"type": "one", "courses": ["ECON 120B", "MATH 181B"]}}
{"code": "ECON 120AH", "title": "Honors Econometrics A", "units": "1", "anchor": "econ120ah", "description": "Honors sequence expanding on the material taught in ECON 120A. Major GPA of 3.5 or better required. May be taken concurrently with ECON 120A or after successful completion of ECON 120A with A– or better or consent of instructor. Priority enrollment given to majors in the department. Prerequisites: department approval required."}
{"code": "ECON 120BH", "title": "Honors Econometrics B", "units": "1", "anchor": "econ120bh", "description": "Honors sequence expanding on the material taught in ECON 120B. Major GPA of 3.5 or better required. May be taken concurrently with ECON 120B or after successful completion of ECON 120B with A– or better or consent of instructor. Priority enrollment given to majors in the department. Prerequisites: department approval required."}
{"code": "ECON 120CH", "title": "Honors Econometrics C", "units": "1", "anchor": "econ120ch", "description": "Honors sequence expanding on the material taught in ECON 120C. Major GPA of 3.5 or better required. May be taken concurrently with ECON 120C or after successful completion of ECON 120C with A– or better or consent of instructor. Priority enrollment given to majors in the department. Prerequisites: department approval required."}
{"code": "ECON 121", "title": "Applied Econometrics and Data Analysis", "units": "4", "anchor": "econ121", "description": "Theoretically develops extensions to the standard econometric toolbox, studies their application in scientific research, and applies them to data. Emphasis is on using techniques, and on understanding and critically assessing others’ use of them. Requires practical work on the computer using a range of data from around the world. Topics include advanced regression analysis, limited dependent variables, nonparametric methods, and new methods for causal inference. Prerequisites: ECON 120C.", "prereqs": "ECON 120C"}
{"code": "ECON 122", "title": "Econometric Theory", "units": "4", "anchor": "econ122", "description": "Detailed study of the small sample and asymptotic properties of estimators commonly used in applied econometric work: multiple linear regression, instrumental variables, generalized method of moments, and maximum likelihood. Econometric computation using MATLAB. Recommended preparation: ECON 120C. Prerequisites: ECON 120B or MATH 181B and MATH 18 or MATH 31AH.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["ECON 120B", "MATH 181B"]}, {"type": "one", "courses": ["MATH 18", "MATH 31AH"]}]}}
{"code": "ECON 125", "title": "Demographic Analysis and Forecasting", "units": "4", "anchor": "econ125", "description": "Interaction between economic forces and demographic changes are considered, as are demographic composition and analysis; fertility, mortality, and migration processes and trends. Course emphasizes the creation, evaluation, and interpretation of forecasts for states, regions, and subcounty areas. ECON 178 is recommended. Prerequisites: ECON 120B or MATH 181B.", "prereqs": {"type": "one", "courses": ["ECON 120B", "MATH 181B"]}}
{"code": "ECON 129", "title": "Cities, Inequality, Innovation", "units": "4", "anchor": "econ129", "description": "Explores the dual role of cities as places of innovation and job creation but also places of great economic inequality and segregation over the last century. Studies the experience of American cities, identifying fundamental forces that made them prosper or decline. Connect cities to observed aggregate trends in innovation, job creation, and economic inequality. Practices use of GIS software to organize and analyze spatial data. Prerequisites: ECON 110A and (ECON 120A or ECE 109 or MAE 108 or MATH 180A or MATH 183 or MATH 186).", "prereqs": {"type": "all", "courses": ["ECON 110A", {"type": "one", "courses": ["ECON 120A", "ECE 109", "MAE 108", "MATH 180A", "MATH 183", "MATH 186"]}]}}
{"code": "ECON 130", "title": "Public Policy", "units": "4", "anchor": "econ130", "description": "Course uses basic microeconomic tools to discuss a wide variety of public issues, including the war on drugs, global warming, natural resources, health care and safety regulation. Appropriate for majors who have not completed ECON 100A-B-C and students from other departments. Prerequisites: ECON 2 or 100A.", "prereqs": {"type": "one", "courses": ["ECON 2", "ECON 100A"]}}
{"code": "ECON 131", "title": "Economics of the Environment", "units": "4", "anchor": "econ131", "description": "Environmental issues from an economic perspective. Relation of the environment to economic growth. Management of natural resources, such as forest and fresh water. Policies on air, water, and toxic waste pollution. International issues such as ozone depletion and sustainable development. Prerequisites: ECON 2 or 100A.", "prereqs": {"type": "one", "courses": ["ECON 2", "ECON 100A"]}}
{"code": "ECON 132", "title": "Energy Economics", "units": "4", "anchor": "econ132", "description": "Energy from an economic perspective. Fuel cycles for coal, hydro, nuclear, oil, and solar energy. Emphasis on efficiency and control of pollution. Comparison of energy use across sectors and across countries. Global warming. Role of energy in the international economy. Prerequisites: ECON 1 and (ECON 2 or 3 or 100A or 131 or ESYS 103 or MAE 124) and MATH 10C or 20C or 31BH.", "prereqs": {"type": "all", "courses": ["ECON 1", {"type": "one", "courses": ["ECON 2", "ECON 3", "ECON 100A", "ECON 131", "ESYS 103", "MAE 124"]}, {"type": "one", "courses": ["MATH 10C", "MATH 20C", "MATH 31BH"]}]}}
{"code": "ECON 134", "title": "The US Social Safety Net", "units": "4", "anchor": "econ134", "description": "Examines major issues relating to the US social safety net, including Social Security, low-income assistance, unemployment and disability insurance, distributional and efficiency effects of the tax system, and the relation of these issues to the overall US government budget. Prerequisites: ECON 100A. Enrollment limited to majors in the Department of Economics and MA33 only.", "prereqs": "ECON 100A"}
{"code": "ECON 135", "title": "Urban Economics", "units": "4", "anchor": "econ135", "description": "(Cross-listed with USP 102.) Economic analysis of why cities develop, patterns of land use in cities, why cities suburbanize, and the pattern of urban commuting. The course also examines problems of urban congestion, air pollution, zoning, poverty, crime, and discusses public policies to deal with them. Credit not allowed for both ECON 135 and USP 102. Prerequisites: ECON 2 or 100A; and MATH 10A or 20A.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["ECON 2", "ECON 100A"]}, {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}]}}
{"code": "ECON 136", "title": "Human Resources", "units": "4", "anchor": "econ136", "description": "A practical yet theory-based study of the firm’s role in managing workers, including issues related to hiring, education and training, promotions, layoffs and buyouts, and the overarching role that worker compensation plays in all of these. Prerequisites: ECON 100B.", "prereqs": "ECON 100B"}
{"code": "ECON 137", "title": "Corruption", "units": "4", "anchor": "econ137", "description": "This course examines corruption in developing countries today, with the aims of understanding why it occurs, what the consequences are, and what can or should be done about it. In the process, we will endeavor to build practical problem-solving and communication skills. As such, the course is designed for future leaders in business, nonprofit, and public service settings who seek to develop their ability to map high-quality research into pragmatic enterprise decision making. Prerequisites: ECON 100C and 120C. Enrollment limited to majors in the Department of Economics and MA33 only; department approval required.", "prereqs": {"type": "all", "courses": ["ECON 100C", "ECON 120C"]}}
{"code": "ECON 138", "title": "Economics of Discrimination", "units": "4", "anchor": "econ138", "description": "This course will investigate differences in economic outcomes on the basis of race, gender, ethnicity, religion, and sexual orientation. We will study economic theories of discrimination, empirical work testing those theories, and policies aimed at alleviating group-level differences in economic outcomes. Prerequisites: ECON 1.", "prereqs": "ECON 1"}
{"code": "ECON 139", "title": "Labor Economics", "units": "4", "anchor": "econ139", "description": "Theoretical and empirical analysis of labor markets. Topics include labor supply, labor demand, human capital investment, wage inequality, labor mobility, immigration, labor market discrimination, labor unions and unemployment. Prerequisites: ECON 2 or 100B.", "prereqs": {"type": "one", "courses": ["ECON 2", "ECON 100B"]}}
{"code": "ECON 140", "title": "Economics of Health Producers", "units": "4", "anchor": "econ140", "description": "Provides an overview of the physician, hospital, and pharmaceutical segments of the health sector. Uses models of physician behavior, for-profit and nonprofit institutions to understand the trade-offs facing health-sector regulators and the administrators of public and private insurance arrangements. Prerequisites: ECON 2 or 100B.", "prereqs": {"type": "one", "courses": ["ECON 2", "ECON 100B"]}}
{"code": "ECON 141", "title": "Economics of Health Consumers", "units": "4", "anchor": "econ141", "description": "Demand for health care and health insurance, employer provision of health insurance and impact on wages and job changes. Cross-country comparisons of health systems. Prerequisites: ECON 100C.", "prereqs": "ECON 100C"}
{"code": "ECON 142", "title": "Behavioral Economics", "units": "4", "anchor": "econ142", "description": "Course will study economic models in which standard economic rationality assumptions are combined with psychologically plausible assumptions on behavior. We consider whether the new models improve ability to predict and understand phenomena including altruism, trust and reciprocity, procrastination, and self-control. Prerequisites: ECON 109.", "prereqs": "ECON 109"}
{"code": "ECON 143", "title": "Experimental Economics", "units": "4", "anchor": "econ143", "description": "Explore use of experiments to study individual and interactive (strategic) decision making. Topics may include choice over risky alternatives, altruism and reciprocity, allocation and information aggregation in competitive markets, cooperation and collusion, bidding in auctions, strategy in coordination and “outguessing” games. Prerequisites: ECON 100C. Enrollment limited to majors in the Department of Economics and MA33 only.", "prereqs": "ECON 100C"}
{"code": "ECON 144", "title": "Economics of Conservation", "units": "4", "anchor": "econ144", "description": "Examines conservation of biodiversity from an economic perspective. Topics include valuing biodiversity, defining successful conservation, and evaluating the cost effectiveness of policies such as conservation payments, ecotourism, and privatization. Emphasis on forests, coral reefs, elephants, tigers, and sea turtles. Prerequisites: ECON 2 or 100A.", "prereqs": {"type": "one", "courses": ["ECON 2", "ECON 100A"]}}
{"code": "ECON 145", "title": "Economics of Ocean Resources", "units": "4", "anchor": "econ145", "description": "Economic issues associated with oceans. Economics of managing renewable resources in the oceans, with an emphasis on fisheries, economics of conservation and biodiversity preservation for living marine resources, with an emphasis on whales, dolphins, sea turtles, and coral reefs. Prerequisites: ECON 2 or 100A.", "prereqs": {"type": "one", "courses": ["ECON 2", "ECON 100A"]}}
{"code": "ECON 146", "title": "Economic Stabilization", "units": "4", "anchor": "econ146", "description": "Theory of business cycles and techniques used by governments to stabilize an economy. Discussion of recent economic experience. Prerequisites: ECON 110B.", "prereqs": "ECON 110B"}
{"code": "ECON 147", "title": "Economics of Education", "units": "4", "anchor": "econ147", "description": "Examination of issues in education using theoretical and empirical approaches from economics. Analysis of decisions to invest in education. Consideration of various market structures in education, including school choice and school finance programs. Prerequisites: ECON 2 or 100A; and ECON 120B or MATH 181B.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["ECON 2", "ECON 100A"]}, {"type": "one", "courses": ["ECON 120B", "MATH 181B"]}]}}
{"code": "ECON 150", "title": "Public Economics: Taxation", "units": "4", "anchor": "econ150", "description": "Overview of the existing national tax structure in the United States, its effects on individual and firm decisions, and the resulting efficiency costs and distributional consequences. The course concludes with an examination of several commonly-proposed tax reforms. Prerequisites: ECON 100C.", "prereqs": "ECON 100C"}
{"code": "ECON 151", "title": "Public Economics: Expenditures I", "units": "4", "anchor": "econ151", "description": "Overview of the public sector in the United States and the scope of government intervention in economic life. Theory of public goods and externalities. Discussion of specific expenditure programs such as education and national defense. Prerequisites: ECON 100C.", "prereqs": "ECON 100C"}
{"code": "ECON 152", "title": "Public Economics: Expenditures II", "units": "4", "anchor": "econ152", "description": "Overview of the public sector in the United States and the justifications for government intervention in economic life. Theory of income redistribution and social insurance. Applications to current policy in such areas as health insurance, welfare, unemployment insurance, and Social Security. Prerequisites: ECON 100C.", "prereqs": "ECON 100C"}
{"code": "ECON 158", "title": "Economic History of the United States I", "units": "4", "anchor": "econ158", "description": "(Cross-listed with HIUS 140.) The United States as a raw materials producer, as an agrarian society, and as an industrial nation. Emphasis on the logic of the growth process, the social and political tensions accompanying expansion, and nineteenth- and early twentieth-century transformations of American capitalism. Credit not allowed for both ECON 158 and HIUS 140. Prerequisites: upper-division standing."}
{"code": "ECON 159", "title": "Economic History of the United States II", "units": "4", "anchor": "econ159", "description": "(Cross-listed with HIUS 141.) The United States as a modern industrial nation. Emphasis on the logic of the growth process, the social and political tensions accompanying expansion, and twentieth-century transformations of American capitalism. Credit not allowed for both ECON 159 and HIUS 141. Prerequisites: upper-division standing."}
{"code": "ECON 162", "title": "Economics of Mexico", "units": "4", "anchor": "econ162", "description": "Survey of the Mexican economy. Topics such as economic growth, business cycles, saving-investment balance, financial markets, fiscal and monetary policy, labor markets, industrial structure, international trade, and agricultural policy. Prerequisites: ECON 1 and 3.", "prereqs": {"type": "all", "courses": ["ECON 1", "ECON 3"]}}
{"code": "ECON 164", "title": "The Indian Economy", "units": "4", "anchor": "econ164", "description": "Survey of the Indian economy. Historical overview and perspective; political economy; democracy and development; economic growth; land, labor, and credit markets; poverty and inequality; health, education, and human development; technology and development; institutions and state capacity; contemporary policy issues and debates. Prerequisites: ECON 1 and 3.", "prereqs": {"type": "all", "courses": ["ECON 1", "ECON 3"]}}
{"code": "ECON 164T", "title": "Advanced Topics in the Indian Economy", "units": "2", "anchor": "econ164t", "description": "ECON 164T will cover topics in more depth than in ECON 164 with more extensive readings and discussion. The class will meet in a seminar format where students will be expected to actively participate in discussions based on the readings and write a short paper at the end of the quarter. Prerequisites: department approval required. May be taken concurrently with ECON 164 or after completion of ECON 164."}
{"code": "ECON 165", "title": "Middle East Economics", "units": "4", "anchor": "econ165", "description": "Socioeconomic development in the Arab world, Iran, and Turkey. Historical perspective; international trade and fuel resources; education, health, and gender gaps; unemployment and migration; population and environment; Islam and democracy. Prerequisites: ECON 1 and 3.", "prereqs": {"type": "all", "courses": ["ECON 1", "ECON 3"]}}
{"code": "ECON 165T", "title": "Advanced Topics in Middle East Economics", "units": "2", "anchor": "econ165t", "description": "This course will cover certain country experiences and certain topics in more depth than in ECON 165. Students will also have the opportunity to choose countries and topics of particular interest to them for further reading and as subjects for a presentation and brief paper. Prerequisites: department approval required. May be taken concurrently with ECON 165 or after completion of ECON 165."}
{"code": "ECON 167", "title": "Economics of China", "units": "4", "anchor": "econ167", "description": "Survey of the Chinese economy. Topics such as economic growth, China’s transition to a market economy, international trade, financial markets, labor markets, and industrial structure. Prerequisites: ECON 1 and 3.", "prereqs": {"type": "all", "courses": ["ECON 1", "ECON 3"]}}
{"code": "ECON 168", "title": "Economics of Modern Israel", "units": "4", "anchor": "econ168", "description": "This course explores economic processes that shape the Israeli economy. Topics include biblical economics, economics of religion, economic growth, income inequality and consumer protests, employment, globalization, inflation, the high-tech sector, terrorism, and education. Prerequisites: ECON 1 and 3.", "prereqs": {"type": "all", "courses": ["ECON 1", "ECON 3"]}}
{"code": "ECON 169", "title": "Economics of Korea", "units": "4", "anchor": "econ169", "description": "This course covers long-run economic development and current economic issues of South Korea. Topics include examination of major policy changes (e.g., shifts toward export promotion, heavy and chemical industries promotion); Korea’s industrial structure, including the role of large enterprises (chaebol); role of government; and links between Korea and other countries. Prerequisites: ECON 3 and 100A.", "prereqs": {"type": "all", "courses": ["ECON 3", "ECON 100A"]}}
{"code": "ECON 171", "title": "Decisions Under Uncertainty", "units": "4", "anchor": "econ171", "description": "Decision making when the consequences are uncertain. Decision trees, payoff tables, decision criteria, expected utility theory, risk aversion, sample information. Prerequisites: ECON 100A and ECON 120A or ECE 109 or MATH 180A or MATH 183 or MATH 186.", "prereqs": {"type": "all", "courses": ["ECON 100A", {"type": "one", "courses": ["ECON 120A", "ECE 109", "MATH 180A", "MATH 183", "MATH 186"]}]}}
{"code": "ECON 172A", "title": "Operations Research A", "units": "4", "anchor": "econ172a", "description": "Linear and integer programming, elements of zero-sum, two-person game theory, and specific combinatorial algorithms. Credit not allowed for both ECON 172A and MATH 171A. Prerequisites: ECON 100A; and ECON 120A or ECE 109 or MATH 180A or MATH 183 or MATH 186; and MATH 18 or 31AH.", "prereqs": {"type": "all", "courses": ["ECON 100A", {"type": "one", "courses": ["ECON 120A", "ECE 109", "MATH 180A", "MATH 183", "MATH 186"]}, {"type": "one", "courses": ["MATH 18", "MATH 31AH"]}]}}
{"code": "ECON 172B", "title": "Operations Research B", "units": "4", "anchor": "econ172b", "description": "Nonlinear programming, deterministic and stochastic dynamic programming, queuing theory, search models, and inventory models. Credit not allowed for both ECON 172B and MATH 171B. Prerequisites: ECON 172A or MATH 171A.", "prereqs": {"type": "one", "courses": ["ECON 172A", "MATH 171A"]}}
{"code": "ECON 173A", "title": "Financial Markets", "units": "4", "anchor": "econ173a", "description": "Financial market functions, institutions and instruments: stocks, bonds, cash instruments, derivatives (options), etc. Discussion of no-arbitrage arguments, as well as investors’ portfolio decisions and the basic risk-return trade-off established in market equilibrium. Prerequisites: ECON 100A and ECON 120B or MATH 181B; and MATH 18 or 31AH.", "prereqs": {"type": "all", "courses": ["ECON 100A", {"type": "one", "courses": ["ECON 120B", "MATH 181B"]}, {"type": "one", "courses": ["MATH 18", "MATH 31AH"]}]}}
{"code": "ECON 173B", "title": "Corporate Finance", "units": "4", "anchor": "econ173b", "description": "Introduces the firm’s capital budgeting decision, including methods for evaluation and ranking of investment projects, the firm’s choice of capital structure, dividend policy decisions, corporate taxes, mergers and acquisitions. Prerequisites: ECON 4 or MGT 4; and ECON 173A.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["ECON 4", "MGT 4"]}, "ECON 173A"]}}
{"code": "ECON 174", "title": "Financial Risk Management", "units": "4", "anchor": "econ174", "description": "Risk measures, hedging techniques, value of risk to firms, estimation of optimal hedge ratio, risk management with options and futures. ECON 171 is recommended. Prerequisites: ECON 173A.", "prereqs": "ECON 173A"}
{"code": "ECON 176", "title": "Marketing", "units": "4", "anchor": "econ176", "description": "Role of marketing in the economy. Topics such as buyer behavior, marketing mix, promotion, product selection, pricing, and distribution. Concurrent enrollment in ECON 120C is permitted. Prerequisites: ECON 120C.", "prereqs": "ECON 120C"}
{"code": "ECON 178", "title": "Economic and Business Forecasting", "units": "4", "anchor": "econ178", "description": "Survey of theoretical and practical aspects of statistical and economic forecasting. Such topics as long-run and short-run horizons, leading indicator analysis, econometric models, technological and population forecasts, forecast evaluation, and the use of forecasts for public policy. Prerequisites: ECON 120C. Enrollment limited to majors in the Department of Economics and MA33 only.", "prereqs": "ECON 120C"}
{"code": "ECON 181", "title": "Topics in Economics", "units": "4", "anchor": "econ181", "description": "Selected topics in economics. May be taken for credit up to three times. Prerequisites: ECON 1 and ECON 3.", "prereqs": {"type": "all", "courses": ["ECON 1", "ECON 3"]}}
{"code": "ECON 182", "title": "Topics in Microeconomics", "units": "4", "anchor": "econ182", "description": "Selected topics in microeconomics. Prerequisites: ECON 100C.", "prereqs": "ECON 100C"}
{"code": "ECON 183", "title": "Topics in Macroeconomics", "units": "4", "anchor": "econ183", "description": "May be taken for credit up to three times. Prerequisites: ECON 110B.", "prereqs": "ECON 110B"}
{"code": "ECON 191A", "title": "Senior Essay Seminar A", "units": "4", "anchor": "econ191a", "description": "Senior essay seminar for students with superior records in department majors. Students must complete ECON 191A and ECON 191B in consecutive quarters. Prerequisites: department stamp required."}
{"code": "ECON 191B", "title": "Senior Essay Seminar B", "units": "4", "anchor": "econ191b", "description": "Senior essay seminar for students with superior records in department majors. Students must complete ECON 191A and ECON 191B in consecutive quarters. Prerequisites: department stamp required."}
{"code": "ECON 195", "title": "Introduction to Teaching Economics", "units": "4", "anchor": "econ195", "description": "Introduction to teaching economics. Each student will be responsible for a class section in one of the lower-division economics courses. Limited to advanced economics majors with at least a 3.5 GPA in upper-division economics work. (P/NP grades only.) Students may not earn more than eight units credit in 195 courses. Prerequisites: consent of the department."}
{"code": "ECON 198", "title": "Directed Group Study", "units": "2 or 4", "anchor": "econ198", "description": "Directed study on a topic or in a group field not included in regular department curriculum by special arrangement with a faculty member. Prerequisites: upper-division standing and consent of instructor. May be repeated up to three times when course topics vary. (P/NP grades only.)"}
{"code": "ECON 199", "title": "Independent Study", "units": "2 or 4", "anchor": "econ199", "description": "Independent reading or research under the direction of and by special arrangement with a Department of Economics faculty member. (P/NP grades only.) Prerequisites: consent of instructor and department approval."}
{"code": "ECON 200A", "title": "Microeconomics A", "units": "4", "anchor": "econ200a", "description": "Modern consumer and producer theory. Preferences, utility maximization, demand, choice under uncertainty, intertemporal choice. Production, cost, profit maximization and supply. Comparative statics, duality. Prerequisites: none. Enrollment limited to Economics PhD students (EN75) or Rady PhD students (RS79); or consent of instructor."}
{"code": "ECON 200B", "title": "Microeconomics B", "units": "4", "anchor": "econ200b", "description": "Arrow-Debreu model of general economic equilibrium and welfare economics. Axiomatic theory of the firm and household. Existence of general economic equilibrium. First and Second Fundamental Theorems of Welfare Economics. Futures and contingent commodity markets. Core and core convergence. Prerequisites: ECON 200A. Enrollment limited to Economics PhD students (EN75) or Rady PhD students (RS79); or consent of instructor.", "prereqs": "ECON 200A"}
{"code": "ECON 200C", "title": "Microeconomics C", "units": "4", "anchor": "econ200c", "description": "Information economics: static and dynamic games of incomplete information, signaling, screening, and lemons. Institutional analysis: social choice, mechanism design, cooperative bargaining, contracts, strategic theory of the firm. Prerequisites: ECON 200B. Enrollment limited to Economics PhD students (EN75) or Rady PhD students (RS79); or consent of instructor.", "prereqs": "ECON 200B"}
{"code": "ECON 201", "title": "Advanced Economic Theory", "units": "4", "anchor": "econ201", "description": "An intensive examination of selected topics in economic theory. Course topic nonrepetitive in a three-year cycle. Prerequisites: ECON 207 and 213.", "prereqs": {"type": "all", "courses": ["ECON 207", "ECON 213"]}}
{"code": "ECON 202A-B-C", "title": ". Workshop in Economic Theory", "units": "0–4/0–4/0–4", "anchor": "econ202c", "description": "An examination of recent research in economic theory, including topics in general equilibrium, welfare economics, duality, and social choice; development of related research topics by both graduate students and faculty. Course may be repeated an unlimited number of times. (S/U grades only.) Prerequisites: ECON 207 or consent of instructor.", "prereqs": "ECON 207"}
{"code": "ECON 204", "title": "Contract Theory", "units": "4", "anchor": "econ204", "description": "This course reviews the theoretical foundations for the analysis of contractual interaction, and it covers a selection of game-theoretic models and applications. The course is intended to provide a foundation for theoretical research on contracts as well as applied research on topics in behavioral/experimental, development, environmental, international, and labor economics, law and economics, and macroeconomics. Prerequisites: ECON 200A-B-C.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C"]}}
{"code": "ECON 205", "title": "Mathematics for Economists", "units": "4", "anchor": "econ205", "description": "Advanced calculus review for new graduate students. Prerequisites: none. Enrollment limited to Economics PhD students (EN75) or Rady PhD students (RS79); or consent of instructor."}
{"code": "ECON 206", "title": "Decisions", "units": "4", "anchor": "econ206", "description": "Further topics in consumer and producer theory, intertemporal optimization, and decision making under uncertainty. (Previously numbered ECON 200D.) Prerequisites: ECON 200A-B-C or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C"]}}
{"code": "ECON 208", "title": "Games and Information", "units": "4", "anchor": "econ208", "description": "Further topics in game theory and the economics of information. Prerequisites: ECON 200A-B-C or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C"]}}
{"code": "ECON 210A", "title": "Macroeconomics A", "units": "4", "anchor": "econ210a", "description": "Dynamic optimization: Lagrangian methods and recursive methods. The neoclassical growth model: social planner, competitive equilibrium, first and second welfare theorems, steady state analysis, dynamic analysis, shocks, heterogeneity and aggregation, applications. Prerequisites: none. Enrollment limited to Economics PhD students (EN75); or consent of instructor."}
{"code": "ECON 210B", "title": "Macroeconomics B", "units": "4", "anchor": "econ210b", "description": "Models of the household’s intertemporal consumption/saving decision, and implications for risk aversion, basic portfolio allocation, and asset pricing. Models with heterogeneous agents—overlapping generations, incomplete markets, precautionary saving. Implications of labor market frictions for equilibrium employment. Prerequisites: ECON 210A. Enrollment limited to Economics PhD students (EN75); or consent of instructor.", "prereqs": "ECON 210A"}
{"code": "ECON 210C", "title": "Macroeconomics C", "units": "4", "anchor": "econ210c", "description": "Basic facts and time series for macroeconomics. Modern theories of short-run fluctuations: sources of business cycle and the evolution of income, employment, interest rate, and prices. Monetary and fiscal policy theories in the presence of real and nominal rigidities. Prerequisites: ECON 210B. Enrollment limited to Economics PhD students (EN75); or consent of instructor.", "prereqs": "ECON 210B"}
{"code": "ECON 210D", "title": "Monetary Economics and Business Cycles", "units": "4", "anchor": "econ210d", "description": "Study of the determinants of economic fluctuations, inflation, and interest rates with particular focus on the effects of monetary policy. Overview of key methods and findings of empirical research in macroeconomics. Recommended preparation: ECON 220D. Prerequisites: graduate standing and ECON 210A-B-C.", "prereqs": {"type": "all", "courses": ["ECON 210A", "ECON 210B", "ECON 210C"]}}
{"code": "ECON 211", "title": "Advanced Macroeconomics", "units": "4-4-4", "anchor": "econ211", "description": "Covers various topics in macroeconomics at the frontiers of research, including theory, computation, and empirical work. Emphasis depends on the instructor. Students will read the latest working papers and publications in the covered areas. Prerequisites: graduate standing and ECON 210A-B-C or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 210A", "ECON 210B", "ECON 210C"]}}
{"code": "ECON 212A-B-C", "title": ". Workshop in Macroeconomics", "units": "0–4/0–4/0–4", "anchor": "econ212c", "description": "Examination of recent research in macroeconomics; development of own research by graduate students and faculty. Course may be repeated an unlimited number of times. (S/U grades only.) Prerequisites: ECON 210C.", "prereqs": "ECON 210C"}
{"code": "ECON 213", "title": "Advanced Macroeconomic Theory", "units": "4", "anchor": "econ213", "description": "This course develops purely theoretical models for problems in macroeconomics. Topics include dynamic general equilibrium, asset market equilibrium, and economic growth and distribution. Prerequisites: ECON 210A-B-C or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 210A", "ECON 210B", "ECON 210C"]}}
{"code": "ECON 214", "title": "Applied Macroeconomics", "units": "4", "anchor": "econ214", "description": "This course focuses on applied macroeconomics, including econometric testing of macroeconomic theories and empirical measurement guided by theoretical insights. Topics will vary from year to year depending on the latest developments in research. Students will complete the course with a broader understanding of a number of leading topics in macroeconomics as well as a toolkit of estimation and simulation programs. Recommended preparation: ECON 220D. Prerequisites: graduate standing and ECON 210A-B-C or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 210A", "ECON 210B", "ECON 210C"]}}
{"code": "ECON 215", "title": "Macroeconomic Policy", "units": "4", "anchor": "econ215", "description": "This course focuses on theoretical models and empirical analysis aimed at understanding and directing macroeconomic policy, including monetary, fiscal, and structural policies. Prerequisites: ECON 210A-B-C or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 210A", "ECON 210B", "ECON 210C"]}}
{"code": "ECON 216", "title": "Computation for Macroeconomics", "units": "4", "anchor": "econ216", "description": "This course covers advanced computation techniques that are widely used in macroeconomics, finance, and other fields. Students will learn a range of numerical methods for handling systems of equations, integration, optimization, and other problems. Prerequisites: ECON 210A-B-C or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 210A", "ECON 210B", "ECON 210C"]}}
{"code": "ECON 217", "title": "Real Frictions and Financial Frictions", "units": "4", "anchor": "econ217", "description": "While understanding how the macro economy behaves in the ideal, frictionless setting is indispensable; most of the interesting issues in macro arise as a consequence of some sort of friction or missing market. In this course, we will study some models based on real frictions and financial frictions. Topics covered include convex and nonconvex adjustment costs, housing markets and investment decisions, and financial crises. Prerequisites: ECON 210A-B-C or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 210A", "ECON 210B", "ECON 210C"]}}
{"code": "ECON 219", "title": "Readings in Macroeconomics", "units": "4", "anchor": "econ219", "description": "This course will cover numerical analysis of dynamic macroeconomic models. Topics include numerical techniques, dynamic programming, linear systems, solution algorithms, and applications to dynamic general equilibrium. Prerequisites: graduate standing or consent of instructor."}
{"code": "ECON 220A", "title": "Econometrics A", "units": "4", "anchor": "econ220a", "description": "An introduction to probability and statistics for graduate students in economics. Topics include random variables, sampling distributions, the law of large numbers, the central limit theorem, maximum likelihood estimation, hypothesis testing. Knowledge of multivariable calculus and linear algebra is assumed. Prerequisites: graduate standing; enrollment limited to Economics PhD students (EN75) or Rady PhD students (RS79); or consent of instructor."}
{"code": "ECON 220B", "title": "Econometrics B", "units": "4", "anchor": "econ220b", "description": "Introduction to regression analysis and other estimation methods. Topics covered include ordinary and generalized least squares, asymptotic approximations, specification testing, two-stage least squares, generalized method of moments, and maximum likelihood estimation. Prerequisites: ECON 220A, graduate standing; Enrollment limited to Economics PhD students (EN75) or Rady PhD students (RS79); or consent of instructor.", "prereqs": "ECON 220A"}
{"code": "ECON 220C", "title": "Econometrics C", "units": "4", "anchor": "econ220c", "description": "This course focuses on econometric analysis of panel data and cross-section data. Topics covered include static/dynamic panel data models, discrete choice models, censored and truncated regression models, sample selection models, and evaluation of treatment effects. Theory of extreme estimators is used to study the specification, estimation, and testing of these models. Prerequisites: ECON 220B, graduate standing; enrollment limited to Economics PhD students (EN75) or Rady PhD students (RS79); or consent of instructor.", "prereqs": "ECON 220B"}
{"code": "ECON 220D", "title": "Econometrics D", "units": "4", "anchor": "econ220d", "description": "Examines modern time series econometrics, extending methods from ECON 220A-C to dependent data. Topics covered include spectral density theory, HAC estimation, vector autoregressions, nonstationary econometrics, filtering. Prerequisites: ECON 220C, graduate standing; enrollment limited to Economics PhD students (EN75) or Rady PhD students (RS79); or consent of instructor.", "prereqs": "ECON 220C"}
{"code": "ECON 220E", "title": "Econometrics E", "units": "4", "anchor": "econ220e", "description": "Identification of economic models. Topics include rank and order conditions for identification in linear simultaneous equations systems; identification in nonlinear models; likelihood-based identification criteria; nonparametric identification; identification in models with multiple equilibria. Prerequisites: ECON 220D, graduate standing; enrollment limited to Economics PhD students (EN75) or Rady PhD students (RS79); or consent of instructor.", "prereqs": "ECON 220D"}
{"code": "ECON 220F", "title": "Econometrics F", "units": "4", "anchor": "econ220f", "description": "This course focuses on the application of econometric techniques to issues in microeconomics and macroeconomics. The major emphasis in the class is on the completion of an empirical project. Prerequisites: ECON 220E, graduate standing; enrollment limited to Economics PhD students (EN75) or Rady PhD students (RS79); or consent of instructor.", "prereqs": "ECON 220E"}
{"code": "ECON 221", "title": "Advanced Econometrics", "units": "4", "anchor": "econ221", "description": "Advanced topics in econometrics. Topics may vary from year to year, covering areas such as cross section, time series, panel, limited dependent variables, conditional quantile estimation, bootstrapping, and large- and small-sample distribution theory. Prerequisites: graduate standing and ECON 220A, 220B, 220C, 220D, and 220E or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 220A", "ECON 220B", "ECON 220C", "ECON 220D", "ECON 220E"]}}
{"code": "ECON 222A-B-C", "title": ". Workshop in Econometrics", "units": "4-4-4", "anchor": "econ222c", "description": "Examination of recent econometric research; development of own research by students and faculty. Course may be repeated an unlimited number of times. (S/U grades only.)"}
{"code": "ECON 225", "title": "Forecasting", "units": "4", "anchor": "econ225", "description": "Topics include testing for rationality of forecasts, Mincer-Zarnowitz regressions, asymmetric loss functions, tests for equal (superior) predictive ability, multivariate forecasting. Prerequisites: graduate standing and ECON 220A, 220B, 220C, 220D, and 220E or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 220A", "ECON 220B", "ECON 220C", "ECON 220D", "ECON 220E"]}}
{"code": "ECON 226", "title": "Bayesian and Numerical Methods", "units": "4", "anchor": "econ226", "description": "Topics include Bayesian inference and decision theory, loss functions, estimation of dynamic stochastic general equilibrium models, nonlinear time series, state-space models, spatial-temporal models, and high-frequency data. Prerequisites: graduate standing and ECON 220A, 220B, 220C, 220D, and 220E or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 220A", "ECON 220B", "ECON 220C", "ECON 220D", "ECON 220E"]}}
{"code": "ECON 227", "title": "Nonparametric and Semiparametric Models", "units": "4", "anchor": "econ227", "description": "Topics include neural networks, kernels, series, splines, estimation of densities and spectra, smoothing parameter selection, semiparametric models, efficiency and adaptation, forecasting with nonlinear models, over-fit, computation, and interpretation. Prerequisites: graduate standing and ECON 220A, 220B, 220C, 220D, and 220E or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 220A", "ECON 220B", "ECON 220C", "ECON 220D", "ECON 220E"]}}
{"code": "ECON 228", "title": "Nonstandard Inference", "units": "4", "anchor": "econ228", "description": "Topics include weak instruments, unit roots, break tests, switching models, set-based inference, maximum likelihood estimation and meaning of misspecified models, consistency, asymptotic normality, consistent covariance matrix estimation, and tests of model misspecification. Prerequisites: graduate standing and ECON 220A, 220B, 220C, 220D, and 220E or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 220A", "ECON 220B", "ECON 220C", "ECON 220D", "ECON 220E"]}}
{"code": "ECON 230", "title": "Public Economics: Taxation", "units": "4", "anchor": "econ230", "description": "Exploration of existing theoretical literature evaluating the efficiency and distribution effects of income and commodity taxes. Characterization of an “optimal” tax structure, and examination of problems faced in tax administration. Scrutiny of behavioral responses to existing tax structures. Prerequisites: ECON 200A-B-C and ECON 220A-B-C.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C", "ECON 220A", "ECON 220B", "ECON 220C"]}}
{"code": "ECON 231", "title": "Public Economics: Public Goods and Externalities", "units": "4", "anchor": "econ231", "description": "Justifications for government intervention in the context of public goods and externalities. Exploration of normative and positive models of government behavior. Lessons from fiscal federalism for federal, state, and local roles. Applications to specific expenditure programs, such as national defense and education. Prerequisites: graduate standing and ECON 200A-B-C and ECON 220A-B-C.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C", "ECON 220A", "ECON 220B", "ECON 220C"]}}
{"code": "ECON 232", "title": "Public Economics: Redistribution and Social Insurance", "units": "4", "anchor": "econ232", "description": "The objective of this course is to provide an understanding of the role of government intervention in the economy in two broad areas of expenditure—redistribution and social insurance—from both a theoretical and an empirical perspective. The emphasis will be on learning techniques that can be applied to produce original research and to critically analyze existing research in the field. Prerequisites: graduate standing and ECON 200A-B-C and ECON 220A-B-C.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C", "ECON 220A", "ECON 220B", "ECON 220C"]}}
{"code": "ECON 233", "title": "Public Economics of Health Care", "units": "4", "anchor": "econ233", "description": "The objective of this course is to provide an understanding of the role of government in the health sector. Key applications include insurance markets, physician and hospital objective functions, payment models, health system design, and medical innovation. All topics are considered from both a theoretical and an empirical perspective. The emphasis will be on learning techniques that can be applied to produce original research and to critically analyze existing research in the field. Prerequisites: graduate standing and ECON 200A-B-C and ECON 220A-B-C.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C", "ECON 220A", "ECON 220B", "ECON 220C"]}}
{"code": "ECON 235A-B-C", "title": ". Workshop in Applied Economics", "units": "0–4/0–4/0–4", "anchor": "econ235c", "description": "Examination of recent research in applied economics; development of own research by graduate students and faculty. Course may be repeated an unlimited number of times. (S/U grades only.)"}
{"code": "ECON 237", "title": "Political Economy: Microeconomic Perspectives", "units": "4", "anchor": "econ237", "description": "Governments serve functions key to economic development, including correcting market failures, raising taxes, delivering services, and protecting property rights. Correspondingly, research in development economics is increasingly focused on how institutions affect development. Generally, the aim of the course is to provide PhD students a complete introduction to the growing literature in this area. Students may not receive credit for ECON 237 and POLI 231E. Prerequisites: graduate standing."}
{"code": "ECON 241", "title": "Microeconomics of Development", "units": "4", "anchor": "econ241", "description": "Course introduces the household as a decision-making unit, and the contracts and institutions that emerge to compensate for imperfect markets. Emphasis is placed on data and identification strategies that can be used to measure the impact of policy interventions. Prerequisites: graduate standing or consent of instructor."}
{"code": "ECON 242", "title": "Macroeconomics of Development", "units": "4", "anchor": "econ242", "description": "This course covers development accounting, growth accounting, human capital accumulation, skill-biased technological change, multisector growth models, structural transformation, urban-rural migration, misallocation, informality, technology adoption and diffusion, and other related topics. Prerequisites: graduate standing or consent of instructor."}
{"code": "ECON 243", "title": "Organizational Economics of Development", "units": "4", "anchor": "econ243", "description": "The study of organizational effectiveness, in both the private and public sectors, bridges the gap between microeconomic analysis of individual and household behavior and macroeconomic analysis of economic aggregates such as capital and output. Topics covered include organizational capacity, leadership and management, staffing, incentives, contracting, finance, learning, market structure, regulations, and politics. Prerequisites: graduate standing or consent of instructor."}
{"code": "ECON 245", "title": "International Trade", "units": "4", "anchor": "econ245", "description": "This course covers the determinants of the pattern and volume of trade in goods and services, the interaction of international trade with income distribution and economic growth, and commercial policy. The emphasis is on theory, with some empirical illustration and motivation. Prerequisites: consent of instructor."}
{"code": "ECON 246", "title": "International Macroeconomics", "units": "4", "anchor": "econ246", "description": "This course presents open-economy macroeconomics and international finance. Topics include theories of the exchange rate, foreign-exchange regimes, current account adjustments, and international portfolio investments. The course examines real and monetary explanations, and implications of international capital market integration. Prerequisites: consent of instructor."}
{"code": "ECON 247", "title": "Empirical Topics in International Economics", "units": "4", "anchor": "econ247", "description": "This course examines the empirical work in international trade or international macroeconomics. International trade topics include empirical tests of theories of international trade and international capital movements. International macroeconomic topics include empirical studies of exchange rate and relative price adjustments. Prerequisites: consent of instructor."}
{"code": "ECON 249A", "title": "International Development Workshop I", "units": "1–4", "anchor": "econ249a", "description": "Presentation of recent research in international and development economics by faculty and graduate students, covering micro and macroeconomic aspect of both areas. Regular attendance is required. Prerequisites: graduate standing or consent of instructor."}
{"code": "ECON 249C", "title": "International Development Workshop III", "units": "1–4", "anchor": "econ249c", "description": "Presentation of recent research in international and development economics by faculty and graduate students, covering micro and macroeconomic aspect of both areas. Regular attendance is required. Prerequisites: graduate standing or consent of instructor."}
{"code": "ECON 250", "title": "Labor Economics", "units": "4", "anchor": "econ250", "description": "Theoretical and empirical issues in labor economics. (Previously numbered ECON 236A-B.) Prerequisites: consent of instructor."}
{"code": "ECON 260", "title": "Industrial Organization: Firms", "units": "4", "anchor": "econ260", "description": "This course covers theory and empirical applications in the following areas of industrial organization: dynamic pricing, price discrimination, collusion, market power, discrete choice demand modeling, entry, asymmetric information, and search. Prerequisites: ECON 220C. Enrollment by completion of prerequisites or by consent of instructor.", "prereqs": "ECON 220C"}
{"code": "ECON 261", "title": "Industrial Organization: Markets", "units": "4", "anchor": "econ261", "description": "This course covers theory and empirical applications in the following areas of industrial organization: mergers, vertical integration, and innovation. Optional topics include network effects, technology adoption, and regulation. Prerequisites: ECON 200C and 220C. Enrollment by completion of prerequisites or by consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 200C", "ECON 220C"]}}
{"code": "ECON 262", "title": "Behavioral Game Theory", "units": "4", "anchor": "econ262", "description": "This course is intended to give students an introduction to the study of strategic interaction through a behavioral lens. We will review game theory experiments and analyze which theoretical predictions are validated and which are violated in practice. We will characterize the systematic violations of the theory that come from experiments and study how these behavioral regularities can be incorporated into new equilibrium concepts. Prerequisites: graduate standing and ECON 200A-B-C.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C"]}}
{"code": "ECON 263", "title": "Modeling Behavioral Economics", "units": "4", "anchor": "econ263", "description": "Covers various models in behavioral economics including self-control, bounded memory, belief manipulation, framing effects, and behavioral game theory. The course will also discuss their role in industrial organization, finance, and political economy, and their implications for welfare. Prerequisites: graduate standing and ECON 200A-B-C.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C"]}}
{"code": "ECON 264", "title": "Experimental Economics", "units": "4", "anchor": "econ264", "description": "Design and interpretation of controlled experiments using human subjects. (Previously numbered ECON 207.) Prerequisites: consent of instructor."}
{"code": "ECON 265", "title": "Alternative Choice Theory", "units": "4", "anchor": "econ265", "description": "Experimental findings by economists and psychologists of systematic departures from the classical model of decision making under risk and uncertainty. Issues of dynamic consistency in choice. Development, formal analysis and application of alternative models of risk preferences and beliefs. Prerequisites: graduate standing and ECON 200A-B-C.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C"]}}
{"code": "ECON 266", "title": "Economics of Natural Resources", "units": "4", "anchor": "econ266", "description": "Theoretical and empirical issues in natural resource economics. (Previously numbered ECON 242.) Prerequisites: consent of instructor."}
{"code": "ECON 267", "title": "Topics in Environmental and Resource Economics", "units": "4", "anchor": "econ267", "description": "The course will cover any of a variety of topics in environmental and resource economics, including climate change, exhaustible and renewable resources, international environmental agreements, nonmarket valuation, energy economics, and water allocation. Prerequisites: graduate standing."}
{"code": "ECON 268", "title": "Energy and Environmental Economics", "units": "4", "anchor": "econ267", "description": "Designed to prepare graduate students for original research in environmental or energy economics. Topics include theory and empirical study of economic regulation, energy markets, technological change, pollution and other externalities, energy efficiency, and climate change. Emphasis on empirical applications. Prerequisites: graduate standing and ECON 200A-B-C or consent of instructor.", "prereqs": {"type": "all", "courses": ["ECON 200A", "ECON 200B", "ECON 200C"]}}
{"code": "ECON 270", "title": "Finance—Core Asset Pricing", "units": "4", "anchor": "econ267", "description": "Theoretical and empirical issues in finance. (Previously numbered ECON 214A.)"}
{"code": "ECON 272", "title": "Finance—Theory and Testing of Intertemporal Asset Pricing Models", "units": "4", "anchor": "econ267", "description": "Theoretical and empirical issues in finance. (Previously numbered ECON 214C.)"}
{"code": "ECON 280", "title": "Computation", "units": "2", "anchor": "econ267", "description": "Introduction to computing for economists. Prerequisites: enrollment limited to economics PhD students (EN75)."}
{"code": "ECON 281", "title": "Special Topics in Economics", "units": "4", "anchor": "econ267", "description": "Lecture course at an advanced level on a special topic. May be repeated for credit if topic differs. (Previously numbered ECON 267.) Prerequisites: consent of instructor."}
{"code": "ECON 284", "title": "Becoming an Economist", "units": "2", "anchor": "econ267", "description": "This course provides students with a framework and a range of practical skills to navigate the transition from being full-time students to being independent researchers. Topics and issues covered will include research design, peer review, portfolio management, co-authorship and collaboration, well-being and life balance, and the meta-system. (S/U grades only.)"}
{"code": "ECON 285", "title": "Precandidacy Presentation", "units": "2", "anchor": "econ267", "description": "This course is a workshop in which students make formal presentations on the literature and on their own projects and receive input from other students and the instructor. Prerequisites: graduate standing."}
{"code": "ECON 286", "title": "Graduate Research Presentation Workshop", "units": "3", "anchor": "econ286", "description": "The aim of the course is to train students to present their research effectively to a broad audience. Students are required to prepare a formal presentation, and then to provide feedback on the presentations made by other students. Depending on student demand, meetings may be divided into multiple sections, based on field interests. Prerequisites: graduate standing, ECON 285.", "prereqs": "ECON 285"}
{"code": "ECON 291", "title": "Advanced Field Advising", "units": "4", "anchor": "econ286", "description": "Controlled reading and discussion with adviser; literature survey. May be repeated for credit. (S/U grades only.)"}
{"code": "ECON 296", "title": "Original Research Paper", "units": "1–12", "anchor": "econ286", "description": "In this course, students are guided toward the formulation of an original research idea and the writing of an original paper. Students receive support and input through group discussion and also through interaction with the instructor. Prerequisites: graduate standing."}
{"code": "ECON 297", "title": "Independent Study", "units": "1–5", "anchor": "econ286", "description": "(S/U grades only.)"}
{"code": "ECON 299", "title": "Research in Economics for Dissertation", "units": "1–12", "anchor": "econ286", "description": "(S/U grades only.)"}
{"code": "ECON 500A-B-C", "title": ". Teaching Methods in Economics", "units": "4-4-4", "anchor": "econ286", "description": "The study and development of effective pedagogical materials and techniques in economics. Students who hold appointments as teaching assistants must enroll in this course, but it is open to other students as well. (S/U grades only.)"}
