{"code": "EDS", "name": "Education Studies Program", "link": "https://catalog.ucsd.edu/courses/EDS.html"}
{"code": "EDS 20S", "title": "Introduction to Principles of Learning", "units": "4", "anchor": "eds20s", "description": "Students will study discipline-specific principles of effective learning, including critical thinking, problem solving, collaboration, and group communication. Laboratory and hypothesis testing, library research and writing skills, and self-assessment. Students will explore concepts and procedures in mathematics, science, and economics. Prerequisites: Summer Bridge participation. Department approval required."}
{"code": "EDS 21S", "title": "Writing and Learning—Triton Transition", "units": "4", "anchor": "eds21s", "description": "Reading, writing, and speaking exercises will introduce students to the teaching conventions and learning expectations of American universities. Students will use writing as a means of academic inquiry to explore the culture of higher education in the United States and will gain practice with appropriate style, structure, and mechanics. P/NP grades only. Prerequisites: department approval required."}
{"code": "EDS 22", "title": "Education in Cuba: Institutional Structures, History, and Culture", "units": "2", "anchor": "eds22", "description": "Cuba’s educational system achieves higher outcomes than any other country in Latin America, and compared to the United States, it represents a very different institutional structure. Cuban education serves as an explicit vehicle for the transmission of Cuban culture and historical consciousness. This course examines Cuba’s emphasis on educational achievement following the triumph of its revolution in 1959, including institutional structures, pedagogy, and content. Prerequisites: Summer Bridge participation, instructor approval required."}
{"code": "EDS 22S", "title": "Education in Cuba—Field Experience", "units": "4", "anchor": "eds22s", "description": "This course provides a combination of seminar work and intensive field experience after the end of the spring quarter, during special summer session. Topics are introduced and analyzed in seminars and reinforced and expanded upon in field visits to historic and cultural sites in Cuba. Additional fees may be required for travel expenses. Prerequisites: students must be participants in the OASIS Learning Communities Program. Enrollment by instructor approval only. Due to expenses of field experience, enrollment will be limited to students who have completed EDS 22 and attended planning meetings with the instructor to discuss cost and travel requirements."}
{"code": "EDS 23", "title": "Success and Satisfaction in the Second Year of Higher Education: Research Trends and Conclusions", "units": "2", "anchor": "eds23", "description": "Course focuses on challenges that confront college students in their second year of higher education and solutions. Emphasis on historically underrepresented students of color with more complex adjustment to college. Analysis of national trends from research including High Impact Practices. This course includes the essential role of utilizing undergraduate tutors to help foster academic and social community within the context of higher education. Prerequisites: department approval required. This course is a collaboration with Student Affairs “2 Excel Program.” Enrollees should only be program participants."}
{"code": "EDS 24", "title": "Thriving in College", "units": "2", "anchor": "eds24", "description": "This course will introduce students to campus systems that are critical for their success and will provide them with the opportunity to learn about how to make the most out of their college experience. Prerequisites: department/instructor approval required. This course is intended for first-year students who completed OASIS Summer Bridge Program."}
{"code": "EDS 25", "title": "American Higher Education and the Collegiate Experience", "units": "4", "anchor": "eds25", "description": "This course is designed to help students think critically about multicultural issues in higher education, as well as the purpose of higher education within the larger context of society. Topics include American higher education history, organization, policy, curricula, and access."}
{"code": "EDS 30", "title": "Introduction to Math Teaching", "units": "2", "anchor": "eds30", "description": "Revisit students’ learning difficulties in mathematics in more depth to prepare students to make meaningful observations of how K–12 teachers deal with these difficulties. Explore how instruction can use students’ knowledge to pose problems that stimulate students’ intellectual curiosity."}
{"code": "EDS 31", "title": "Introduction to Teaching Science", "units": "2", "anchor": "eds31", "description": "Explores routine challenges and exceptional difficulties students often have in learning science. Prepares students to make meaningful observations of how K–12 teachers deal with difficulties. Explores strategies that teachers may use to pose problems that stimulate students’ intellectual curiosity."}
{"code": "EDS 38", "title": "Explorations in Education", "units": "2", "anchor": "eds38", "description": "Undergraduate students are placed in local schools and other educational settings within the community. Students work on educational activities with K–12 students a minimum of twenty hours/quarter. If taken for the EDS major, must be taken for a letter grade. Prerequisites: department approval required."}
{"code": "EDS 39", "title": "Explorations in Secondary STEM Education", "units": "2", "anchor": "eds39", "description": "Undergraduate students explore current practices and issues in public education focusing on STEM secondary education (grades 6–12) through readings, guest speakers, seminars, and observations in math, science, and computer science classrooms at local schools. Prerequisites: department approval required."}
{"code": "EDS 50", "title": "Chancellor’s Associates Scholars Program First-year Student Introductory Course", "units": "1", "anchor": "eds50", "description": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking, organizational, interpersonal, and wellness skills. Prerequisites: Open to Chancellor’s Associates Scholars Program first-year students only."}
{"code": "EDS 87", "title": "First-year Student Seminar in Education Studies", "units": "1", "anchor": "eds87", "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. Topics vary from quarter to quarter. P/NP grades only. Prerequisites: Enrollment priority will be given to first-year students."}
{"code": "EDS 102", "title": "Introduction to Qualitative Methods in Education Research", "units": "4", "anchor": "eds102", "description": "Introductory course addressing topics in qualitative research method and analytic approaches, including methods such as case studies, video analysis, interviews, observations, and ethnography. Concepts explore the practice and philosophical underpinnings of specified qualitative research approach and examples of qualitative studies. If taken for EDS major, must be taken for a letter grade. Prerequisites: ED25 major and upper-division standing."}
{"code": "EDS 103", "title": "Introduction to Quantitative Methods in Education Research", "units": "4", "anchor": "eds103", "description": "Introduction to quantitative fundamentals of statistical inference in education research. Emphasis on applying statistical concepts, selecting appropriate techniques, using techniques, and examining assumptions to interpret analytic results and summarize findings. Hands-on practice will be integral to the course. If taken for EDS major, must be taken for a letter grade. Prerequisites: ED25 major and upper-division standing."}
{"code": "EDS 105", "title": "Teaching and Learning Physics", "units": "4", "anchor": "eds105", "description": "How people learn and understand key concepts in physics. Readings in physics, physics education research, and cognitive science. Useful for students interested in teaching and learning physical sciences. Prerequisites: PHYS 1A or PHYS 2A or PHYS 4A and PHYS 1B or PHYS 2B or PHYS 4C and PHYS 1C or PHYS 2C or PHYS 2D or PHYS 4B.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["PHYS 1A", "PHYS 2A", "PHYS 4A"]}, {"type": "one", "courses": ["PHYS 1B", "PHYS 2B", "PHYS 4C"]}, {"type": "one", "courses": ["PHYS 1C", "PHYS 2C", "PHYS 2D", "PHYS 4B"]}]}}
{"code": "EDS 110R", "title": "Early Learning Environments for Diverse Learners", "units": "4", "anchor": "eds110r", "description": "In this online course, students examine the diverse contexts in which children develop. They will explore theories of child development and how they intersect with traditional learning theories. From these foundational concepts we will explore how to develop lessons and learning activities to support the needs of diverse learners. Prerequisites: upper-division standing."}
{"code": "EDS 111", "title": "Child, Family, and Community Partnerships with Schools", "units": "4", "anchor": "eds111", "description": "This course examines how early education programs collaborate with socioculturally diverse families to support child development. Theories will examine social learning, family socialization, risk and resilience, and community engagement and how these theories are enacted in schools, communities, and families. Course assignments will support undergraduates to utilize families’ beliefs, strengths, and resources to support children’s learning with opportunities to engage with them. Students may not receive credit for both EDS 111 and EDS 111GS. Prerequisites: upper-division standing."}
{"code": "EDS 111GS", "title": "Child, Family, and Community Partnerships with Schools", "units": "4", "anchor": "eds111gs", "description": "This course examines how early education programs collaborate with socioculturally diverse families to support child development. Theories will examine social learning, family socialization, risk and resilience, and community engagement and how these theories are enacted in schools, communities, and families. This course is offered in Quito, Ecuador. It will integrate field experiences from excursions and individual student experiences. Program or materials fee may apply. Students may not receive credit for both EDS 111GS and EDS 111. Prerequisites: department approval. Students must apply and be accepted to the Global Seminar Program in order to enroll."}
{"code": "EDS 112", "title": "Urban Education in the United States", "units": "4", "anchor": "eds112", "description": "Students will read, discuss, and analyze past and present urban education demographics, resources, policies, practices, and outcomes to deepen their knowledge and critique of issues in urban education. Prerequisites: upper-division standing."}
{"code": "EDS 113", "title": "Chicanas/os and Latinos in Education: Policy, Practice, and Challenges to Equity", "units": "4", "anchor": "eds113", "description": "An overview of the experiences, challenges, and opportunities for educating Chicano/Latino students. This course unpacks the socioeconomic and systematic factors that underlie these data. Further, to understand this persistent phenomenon and explore approaches to altering the current pathway of this group, this course will provide a comprehensive overview of Chicana/o-Latina/o students at every state in the P–20 education continuum. Prerequisites: upper-division standing."}
{"code": "EDS 114", "title": "Cognitive Development and Interactive Computing Environments", "units": "4", "anchor": "eds114", "description": "Development and learning are increasingly supported by interactive computing environments. This course will explore technology-supported learning environments, looking at the ways they can be used to promote effective development, learning, and teaching. Prerequisites: upper-division standing."}
{"code": "EDS 115", "title": "Cognitive Development and Education", "units": "4", "anchor": "eds115", "description": "This course examines the development of cognition, thinking, and language from infancy to adolescence with implications for education. Topics include learning theories, executive function, memory and language, as well as impacts of technology, poverty, diversity, and bilingualism. Course content focuses on addressing achievement gaps. Students may not receive credit for both EDS 115 and EDS 115GS. Prerequisites: upper-division or graduate majors ED 78 or ED 76 standing or consent of instructor."}
{"code": "EDS 115GS", "title": "Cognitive Development and Education", "units": "4", "anchor": "eds115s", "description": "This course examines the development of cognition, thinking, and language from infancy to adolescence with implications for education. Topics include learning theories, executive function, memory and language, as well as impacts of technology, poverty, diversity, and bilingualism. Course content focuses on addressing achievement gaps. This course is offered in Quito, Ecuador. It will integrate field experiences gained through organized class excursions and individual experiences of students. Program or materials fees may apply. Students may not receive credit for both EDS 115GS and EDS 115. Prerequisites: department approval. Students must apply and be accepted to the Global Seminar Program in order to enroll."}
{"code": "EDS 116", "title": "Equity-Minded Education", "units": "4", "anchor": "eds116", "description": "This course introduces the foundational historical and theoretical issues for the critical study of higher education diversity work and student affairs. This course integrates questions of identity with those of social justice and requires a strong commitment to understanding self and other. The role of mentoring, advising, and counseling will also be examined. Prerequisites: department approval (consent of instructor) required."}
{"code": "EDS 117", "title": "Language, Culture, and Education", "units": "4", "anchor": "eds117", "description": "(Same as SOCI 117) The mutual influence of language, culture, and education will be explored; explanations of students’ school successes and failures that employ linguistic and cultural variables will be considered; bilingualism and cultural transmission through education. Students may not receive credit for EDS 117 and SOCI 117 and EDS 117GS. Prerequisites: upper-division standing."}
{"code": "EDS 117GS", "title": "Language, Culture, and Education", "units": "4", "anchor": "eds117gs", "description": "The mutual influence of language, culture, and education will be explored; explanations of students’ school successes and failures that employ linguistic and cultural variables will be considered; bilingualism and cultural transmission through education. This course is offered in Quito, Ecuador. It will integrate field experiences gained through organized class excursions and individual experiences of students. Program or materials fees may apply. Students may not receive credit for EDS 117GS and EDS 117 and SOCI 117. Prerequisites: department approval. Students must apply and be accepted to the Global Seminar Program in order to enroll."}
{"code": "EDS 118", "title": "Adolescent Development and Education", "units": "4", "anchor": "eds118", "description": "This course introduces prospective secondary teachers to the cognitive, social, and emotional development of adolescents, including developmental learning theory, the teaching/learning process, effective learning environments, and cross-cultural variation in development. Implications for classroom practice are drawn."}
{"code": "EDS 119", "title": ". First and Second Language Learning: From Childhood through Adolescence", "units": "4", "anchor": "lign119", "description": "An examination of how human language learning ability develops and changes over the first two decades of life, including discussion of factors that may affect this ability. Prerequisites: upper-division standing or consent of instructor."}
{"code": "EDS 120", "title": "Introduction to Design-Based Educational Research: A Field Experience for Improving San Diego Schools", "units": "4", "anchor": "eds120", "description": "The course engages students in field research aimed at supporting education reform efforts in local schools. Students are introduced to a design-based, applied orientation to educational research on equity and diversity. In collaboration with local school leaders, students conduct qualitative research projects on a range of issues that impact youth in schools. Students will examine research on educational equity, theories of education reform, and qualitative research principles and methods. Students are required to travel to school sites. Prerequisites: upper-division standing and HIUS 180 or HIUS 136 or HITO 156 or HITO 136 or EDS 126 or EDS 136 or USP 129 or SOCI 139 or SOCI 127 or SOCI 126 or POLI 108 or POLI 100Q or POLI 100O or POLI 100H or LTCS 130 or HILD 7C or HILD 7B or HILD 7A or ETHN 3 or ETHN 2 or ANTH 131 or ANTH 21 or ANTH 23 or DOC 1 or DOC 100D or EDS 112 or EDS 113 or EDS 117 or SOCI 117 or EDS 125.", "prereqs": {"type": "one", "courses": ["HIUS 180", "HIUS 136", "HITO 156", "HITO 136", "EDS 126", "EDS 136", "USP 129", "SOCI 139", "SOCI 127", "SOCI 126", "POLI 108", "POLI 100Q", "POLI 100O", "POLI 100H", "LTCS 130", "HILD 7C", "HILD 7B", "HILD 7A", "ETHN 3", "ETHN 2", "ANTH 131", "ANTH 21", "ANTH 23", "DOC 1", "DOC 100D", "EDS 112", "EDS 113", "EDS 117", "SOCI 117", "EDS 125"]}}
{"code": "EDS 121A", "title": "Foundations of Teaching and Learning Mathematics I", "units": "4", "anchor": "eds121a", "description": "Develop teachers’ knowledge base (knowledge of mathematics content, pedagogy, and student learning) in the context of advanced mathematics. This course builds on the previous courses where these components of knowledge were addressed exclusively in the context of high-school mathematics. Prerequisites: EDS 30/MATH 95, and Calculus 10C or 20C.", "prereqs": {"type": "one", "courses": ["EDS 30", "MATH 95"]}}
{"code": "EDS 121B", "title": "Foundations of Teaching and Learning Math II", "units": "4", "anchor": "eds121b", "description": "Examine how learning theories can consolidate observations about conceptual development with the individual student as well as the development of knowledge in the history of mathematics. Examine how teaching theories explain the effect of teaching approaches addressed in the previous courses. Prerequisites: EDS 121A/MATH 121A.", "prereqs": {"type": "one", "courses": ["EDS 121A", "MATH 121A"]}}
{"code": "EDS 122", "title": "Foundations of Teaching and Learning Science", "units": "4", "anchor": "eds122", "description": "Examine theories of learning and how they are important in the science classroom. Conceptual development in the individual student, as well as the development of knowledge in the history of science. Key conceptual obstacles in science will be explored. Prerequisites: EDS 31/CHEM 87: Introduction to Teaching Science, Chemistry 6C.", "prereqs": {"type": "one", "courses": ["EDS 31", "CHEM 87"]}}
{"code": "EDS 123", "title": "Capstone Seminar in Science Education", "units": "4", "anchor": "eds123", "description": "In the lecture and observation format, students continue to explore the theories of learning in the science classroom. Conceptual development is fostered, as well as continued development of knowledge of science history. Students are exposed to the science of teaching science in actual practice. Prerequisites: EDS 122/CHEM 187.", "prereqs": {"type": "one", "courses": ["EDS 122", "CHEM 187"]}}
{"code": "EDS 124A", "title": "Teaching Computation in the Digital World", "units": "4", "anchor": "eds124a", "description": "Develop educators’ knowledge base around aspects of the Digital World (e.g., digital devices, systems, networks; data and analysis) and their impacts (social, ethical, legal issues) and contributions to society. Projects introduce novice programming framework(s) and/or other online interfaces to explore and model issues. Prior programming experience is not required. Students may not receive credit for EDS 124A and EDS 124AR. Prerequisites: upper-division standing."}
{"code": "EDS 124AR", "title": "Teaching Computation in the Digital World", "units": "4", "anchor": "eds124ar", "description": "This online course develops educators’ knowledge base around aspects of the Digital World (e.g., digital devices, systems, networks; data and analysis) and their impacts (social, ethical, legal issues) and contributions to society. Projects introduce novice programming framework(s) and/or other online interfaces to explore and model issues. Prior programming experience is not required. Students may not receive credit for EDS 124AR and EDS 124A. Prerequisites: upper-division standing."}
{"code": "EDS 124BR", "title": "Teaching Computational Thinking for Everyone", "units": "4", "anchor": "eds124br", "description": "Examine issues in computing education (e.g., access and equity). Conceptual and skill development with core programming concepts (flow of control, abstraction, algorithms) using a novice programming framework. Computer science teaching and assessment methods for deep understanding. Prerequisites: upper-division standing."}
{"code": "EDS 125", "title": "History, Politics, and Theory of Bilingual Education", "units": "4", "anchor": "eds125", "description": "This course provides a historical overview and models of bilingual education in the United States. Students will examine socio-cultural, theoretical, and policy issues associated with native language and second-language instruction, and legal requirements for public bilingual program."}
{"code": "EDS 126", "title": "Social Organization of Education", "units": "4", "anchor": "eds126", "description": "(Same as SOCI 126) The social organization of education in the United States and other societies; the functions of education for individuals and society; the structure of schools; educational decision making; educational testing; socialization and education; formal and informal education; cultural transmission. Prerequisites: upper-division standing."}
{"code": "EDS 128", "title": "A-B. Introduction to Teaching and Learning", "units": "Elementary", "anchor": "eds128b", "description": "This course series is for undergraduates who are exploring a career in elementary school teaching. Topics addressed include theories of teaching and learning; research on cognition and motivation; and the cultural context of classroom teaching and learning. EDS 128A focuses on the learner in the teaching-learning interaction and EDS 128B focuses on the teacher in the teaching-learning interaction. Prerequisites: department approval required; EDS 139 must be taken as corequisite. EDS 130 or 131 or 133 or 135 or 136 or 137 or 145 or 146 must be completed before EDS 128A, and 128A for 128B. EDS 128A and EDS 128B are restricted for students applying to the EDS MEd/Multiple Subject Credential Program.", "prereqs": "EDS 139"}
{"code": "EDS 129", "title": "A-B-C. Introduction to Teaching and Learning", "units": "Secondary", "anchor": "eds129c", "description": "This course series is for undergraduates who are exploring a career in teaching secondary school. Topics addressed include theories of teaching and learning processes and motivation for science, mathematics, English, and world language instruction. EDS 129A focuses on the analysis of the needs of individual learners and small group instruction techniques; EDS 129B emphasizes the various roles of the classroom teacher and planning individual lessons; and EDS 129C emphasizes the assessment of student work and longer-range curriculum planning. Prerequisites: department approval required; EDS 139 must be taken as corequisite. Must have successfully completed EDS 135, 136, or 129A for 129B, and 129B for 129C. EDS 129B and 129C are restricted for students applying to the EDS MEd/Single Subject Credential Program.", "prereqs": "EDS 139"}
{"code": "EDS 130", "title": "Introduction to Academic Mentoring of Elementary/School Students", "units": "4", "anchor": "eds130", "description": "This course focuses on the role of undergraduate mentors in raising academic expectations for students and families traditionally underrepresented at the university. The relationship between the school and community, the social and political organization of elementary schools, and the academic achievement of elementary children are examined. Prerequisites: department approval required; EDS 139 must be taken as a corequisite.", "prereqs": "EDS 139"}
{"code": "EDS 131", "title": "Early Childhood Development and Education", "units": "4", "anchor": "eds131", "description": "This course investigates early child development (birth through eight years) and education and the role of high-quality early education on reducing inequities among diverse populations. Field experience and seminar focus on applying research and theory to experiences in early childhood classrooms (P–3). Prerequisites: department approval. Students will need to fill out a placement form prior to getting approval to enroll in EDS 131. This form provides the course instructor with information to make the appropriate field placement; EDS 139 must be taken as a corequisite."}
{"code": "EDS 133", "title": "Counseling, Mentoring, and Academic Advising", "units": "Preschool through Twelfth Grade", "anchor": "eds133", "description": "This course introduces students to foundations of academic advising and counseling. Through a combination of course readings, assignments, lectures, guest speakers, and field experiences, students learn about a social justice approach to academic advising and counseling. The course addresses issues of diversity, equity, access, and inclusion in P–12 schools. The role of language and culture, as well as family and community factors are addressed. Prerequisites: department approval required. EDS 139 must be taken as a corequisite."}
{"code": "EDS 135", "title": "Working with Newcomer Communities in San Diego", "units": "6", "anchor": "eds135", "description": "This Partners at Learning (PAL) practicum course examines the history, policies, and practices that inform work with newcomers (recent refugees and immigrants) in the San Diego community. Students enrolled in the course will learn about the diverse groups of newcomers in San Diego and will complete their field hours in a variety of school and community settings. Prerequisites: department approval required."}
{"code": "EDS 136", "title": "Introduction to Academic Tutoring of Secondary School Students", "units": "4", "anchor": "eds136", "description": "This course focuses on the role of undergraduate tutors in building academic resiliency in secondary students traditionally underrepresented at the university. The relationship between the school and community, the social and political organization of secondary schools, the philosophical, sociological, and political issues which relate to the US secondary educational system, and the academic achievement of secondary children are examined. Prerequisites: department approval required; EDS 139 must be taken as a corequisite.", "prereqs": "EDS 139"}
{"code": "EDS 137", "title": "Introduction to Discipline-Specific Teaching and Learning", "units": "4", "anchor": "eds137", "description": "This course examines effective practices for teaching and learning in specific academic content areas in PreK–12 school or community settings. The field experience and seminar focus on relationship building between mentors and learners, discipline-relevant teaching and learning processes, and community service. Prerequisites: department approval required; EDS 139 must be taken as a corequisite.", "prereqs": "EDS 139"}
{"code": "EDS 139", "title": "Practicum in Teaching and Learning", "units": "2", "anchor": "eds139", "description": "Students are placed in local P–12 schools and community field sites to actively engage in face-to-face educational service work. Students spend a minimum of four hours per week consistently over the ten-week quarter for a minimum total of forty hours per quarter. P/NP grades only. May be taken for credit up to twelve times. Corequisites: One of the following courses must be taken concurrently: EDS 128A-B, or 129A-B-C, 130, 131, 133, 136, 137, 140, or 141. Prerequisites: department approval required.", "coreqs": {"type": "one", "courses": [{"type": "all", "courses": ["EDS 128A", "EDS 128B"]}, {"type": "all", "courses": ["EDS 129A", "EDS 129B", "EDS 129C"]}, "EDS 130", "EDS 131", "EDS 133", "EDS 136", "EDS 137", "EDS 140", "EDS 141"]}}
{"code": "EDS 140", "title": "Introduction to Action Research in P–12 Schools", "units": "4", "anchor": "eds140", "description": "Using a service-learning model, the course provides students with the opportunity to serve as mentors and tutors at local underserved P–12 public schools and/or community centers while building the foundations of their own action research projects. Students will be introduced to qualitative research in education and taught the importance of conducting ethical and responsible research. Structured as a seminar, the course serves as a venue for students to develop their action research proposal. Prerequisites: EDS 130 or EDS 131 or EDS 133 or EDS 135 or EDS 136 or EDS 137, department approval. Students will need to fill out a placement form prior to getting approval to enroll in EDS 140. This form provides the course instructor with information regarding student’s prior experiences with PAL, areas/topics of interest; EDS 139 must be taken as a corequisite. If students wish to continue their service-learning practicum at their host school, they can take EDS 139.", "prereqs": {"type": "one", "courses": ["EDS 130", "EDS 131", "EDS 133", "EDS 135", "EDS 136", "EDS 137"]}}
{"code": "EDS 141", "title": "Action Research in P–12 Education: Advanced Practicum in P–12 Schools and Communities", "units": "4", "anchor": "eds141", "description": "Using a service-learning model, EDS 141 builds on EDS 140. Students will integrate their service-learning experiences at local P–12 public schools and/or community centers with action-oriented research experiences. In this course, students expand their understanding of qualitative and quantitative research methods in education and emphasizes the importance of carrying out research in responsible and ethical ways.  Prerequisites: EDS 140, department approval. Students will need to fill out a placement form prior to getting approval to enroll in EDS 140. This form provides the course instructor with information regarding student’s prior experiences with PAL, areas/topics of interest; EDS 139 must be taken as a corequisite.", "prereqs": "EDS 140"}
{"code": "EDS 145", "title": "Artsbridge: Integrating the Arts Across the Curriculum", "units": "4", "anchor": "eds145", "description": "In this course, students explore the role of the arts (dance, media arts, music, theatre, and/or visual arts) in P–12 education. A focus on STEAM (Science, Technology, Engineering, Arts, Mathematics), as well as the arts as a core subject, provide multiple perspectives on the arts and education. Students explore how arts activities enhance learning across the curriculum. The course explores issues of teaching, learning, creativity, communication, and social justice through the arts. Prerequisites: department approval required; EDS 139 must be taken as a corequisite.", "prereqs": "EDS 139"}
{"code": "EDS 146", "title": "Mindfulness and Education", "units": "4", "anchor": "eds146", "description": "This course introduces students to mindfulness and yoga in schools as it relates to social and emotional learning (SEL), executive functioning, and academic success. Through a combination of readings, lectures/discussions, assignments, and field experiences, students will learn about the impact of contemplative practices on academic functioning and SEL, while also addressing current educational and socio-emotional challenges that P–12 students, teachers, and parents face. Prerequisites: department approval required, EDS 139 must be taken as a corequisite.", "prereqs": "EDS 139"}
{"code": "EDS 150", "title": "Chancellor’s Associates Scholars Program Transfer Introductory Course", "units": "2", "anchor": "eds150", "description": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking, organizational, interpersonal, and wellness skills. P/NP grades only. Prerequisites: open to Chancellor’s Associates Scholars Program transfer students only."}
{"code": "EDS 164R", "title": "Early Childhood Policy: Children, Contexts, and Policies in Diverse Societies", "units": "4", "anchor": "eds165r", "description": "The focus of early childhood policy is to understand how the diverse policy contexts in which children are born and raised have dramatic implications for their life trajectories. This course examines how, when, and why government intervenes in children’s lives through family, pre-/school, community, and digital media contexts, in the aim to improve their trajectories. From this basis we examine the effects of policies on children locally, nationally, and internationally. Prerequisites: upper-division standing or consent of instructor."}
{"code": "EDS 180", "title": "Topics in Education Studies", "units": "4", "anchor": "eds180", "description": "This course examines special topics in education from a variety of theoretical and pedagogical perspectives. Topics will address pertinent and current issues related to teaching and learning, with an emphasis on transforming education in a diverse society. Topics may vary based on faculty expertise and research. May be taken for credit up to four times. Prerequisites: upper-division standing or consent of instructor."}
{"code": "EDS 190", "title": "Research Practicum", "units": "1–6", "anchor": "eds190", "description": "Supervised research studies with individual topics selected according to students’ special interests. Students will develop a research proposal and begin to gather and analyze data. Prerequisites: consent of instructor. (F,W,S)"}
{"code": "EDS 195", "title": "Apprentice Teaching", "units": "2–4", "anchor": "eds195", "description": "Advanced EDS students are prepared in effective methods of supervising the preparation of UC San Diego students serving as paraprofessionals in K–12 classrooms. Topics covered include classroom management, interpersonal relations, supervision techniques, multicultural and multilingual education, politics in the school, and curriculum development. Each student serves as a discussion leader and conducts at least two workshops. Prerequisites: consent of instructor and department approval."}
{"code": "EDS 198", "title": "Directed Group Study", "units": "4–2", "anchor": "eds198", "description": "Directed group study, guided reading, and study involving research and analysis of activities and services in multicultural education, bilingual education, the teaching-learning process, and other areas that are not covered by the present curriculum. May be taken for credit up to ten times. Prerequisites: consent of instructor."}
{"code": "EDS 199", "title": "Special Studies", "units": "4", "anchor": "eds199", "description": "Individual guided reading and study involving research and analysis of activities and services in multicultural education, bilingual education, the teaching-learning process, and other areas that are not covered by the present curriculum. Prerequisites: consent of instructor."}
{"code": "EDS 324AR", "title": "Teaching Impacts of Technology", "units": "4", "anchor": "eds324ar", "description": "This online course develops educators’ knowledge base around aspects of the digital world (e.g., digital devices, systems, networks, data and analysis, algorithms) and their impacts (social, ethical) and contributions to society. Prior programming experience is not required. Prerequisites: upper-division or graduate-level standing."}
{"code": "EDS 324BR", "title": "Computational Thinking and Block-Based Programming", "units": "4", "anchor": "eds324br", "description": "Examine issues in computing education (e.g., access and equity). Conceptual and skill development with core programming concepts (flow of control, abstraction, algorithms) using a novice programming framework. Computer science teaching and assessment methods for deep understanding. Prerequisites: upper-division or graduate-level standing."}
{"code": "EDS 324CR", "title": "Learn to Teach Java", "units": "4", "anchor": "eds324cr", "description": "Examine issues in teaching and learning of programming in Java with a focus teaching of secondary-level students. Teaching and learning of algorithms; data structures and representation; searching and sorting; basic software design processes and impacts on society. Developing an educational infrastructure and professional community that supports computing in traditional K-12 environments. Experience with block-based programming is recommended. Prerequisites: upper-division or graduate-level standing."}
{"code": "EDS 324DR", "title": "Teaching Methods in Computer Science", "units": "4", "anchor": "eds324dr", "description": "Provides pedagogical and content knowledge and experiences to be an effective computer science teacher in the K-12 setting. Misconceptions in programming, teaching debugging, development of differentiated programming assignments, use of Use, Modify, Create approach, pedagogy, and classroom engagement practices for supporting student success. Experience teaching any programming language in the K-12 setting is recommended. Learning to teach Java is also recommended. Prerequisites: upper-division or graduate-level standing."}
{"code": "EDS 342A", "title": "ASL-English Bilingual Education Practices", "units": "4", "anchor": "eds342a", "description": "Students will examine the history, current theory, philosophy, legislation, and trends in deaf education. Methods of first- and second-language development, communication, and literacy skills for deaf and hard-of-hearing children will be introduced. Prerequisites: must be an ED76 major. (F)"}
{"code": "EDS 342B", "title": "ASL-English Bilingual Education Practices", "units": "4", "anchor": "eds342b", "description": "Students will investigate formal and informal assessment techniques used for deaf and hard-of-hearing children, bilingual/multicultural education practices across the curriculum, effective learning environments and approaches for educating and interacting with families and communities. Prerequisites: EDS 342A, EDS 361A. Must be an ED76 major. Concurrent enrollment in EDS 361B and 369A. (W)", "prereqs": {"type": "all", "courses": ["EDS 342A", "EDS 361A"]}}
{"code": "EDS 342C", "title": "ASL-English Bilingual Education Practices", "units": "4", "anchor": "eds342c", "description": "Students will continue to investigate formal and informal assessment techniques used for deaf and hard of hearing children, bilingual/multicultural education practices across the curriculum, effective learning environments and approaches for educating and interacting with families and communities. Prerequisites: EDS 342A, EDS 342B, EDS 361A. Must be an ED76 major.", "prereqs": {"type": "all", "courses": ["EDS 342A", "EDS 342B", "EDS 361A"]}}
{"code": "EDS 349", "title": "Deaf Education Specialist Student Teaching Practicum", "units": "9", "anchor": "eds349", "description": "Education specialist credential candidate performs student teaching in participating schools for a minimum of seven weeks full-time under the supervision of a cooperating teacher and university supervisor. The field experience provides professional preparation and diversified teaching responsibilities for postbaccalaureate students pursuing the California Deaf and Hard of Hearing Specialist and BCLAD Credential. Prerequisites: must be an ED76 major, Teaching and Bilingual Education (ASL-English)"}
{"code": "EDS 351", "title": "Teaching the English Language Learner", "units": "4", "anchor": "eds351", "description": "Students will examine the principles of second language acquisition and approaches to bilingual education. They will develop a repertoire of strategies for teaching in elementary or secondary content areas. Prerequisites: ED76 or ED78 major: Elementary Multiple Subject or Single Subject candidates at UC San Diego who have advanced to student teaching or internship. (F)"}
{"code": "EDS 352A", "title": "Bilingual Instructional Practices I", "units": "2", "anchor": "eds352a", "description": "First course in a two-course sequence. Provides a theoretical and practical grounding in various pedagogical techniques for teaching in bilingual settings. Course covers principles of bilingualism and bilingual pedagogy; transfer between primary and target languages as appropriate to the language(s) of emphasis. Candidates study methods for teaching primary and target languages in a variety of program models; curriculum/assessment practices; and approaches for interacting with families/communities. Prerequisites: ED78 major: Elementary Multiple Subject or Single Subject candidates at UC San Diego who have advanced to student teaching or internship. Department approval for all other students required."}
{"code": "EDS 352B", "title": "Bilingual Instructional Practices II", "units": "2", "anchor": "eds352b", "description": "Second course in a two-course sequence. Provides a theoretical and practical grounding in various pedagogical techniques for teaching in bilingual settings. Course covers principles of bilingualism and bilingual pedagogy; transfer between primary and target languages as appropriate to the language(s) of emphasis. Candidates study methods for teaching primary and target languages in a variety of program models; curriculum/assessment practices; and approaches for interacting with families/communities. Prerequisites: EDS 352A. ED78 major: Elementary Multiple Subject or Single Subject candidates at UC San Diego who have advanced to student teaching or internship.", "prereqs": "EDS 352A"}
{"code": "EDS 355A", "title": "Advanced Mathematics Teaching Practices for Grades K–6", "units": "2", "anchor": "eds355a", "description": "First course in a three-course sequence. Provides a theoretical and practical grounding in pedagogy and professional factors influencing high-quality elementary mathematics education. Students will review research literature and various content standards, assessment materials, and curriculum materials in preparation for specialized mathematics instruction in elementary classrooms. Prerequisites: admission into the ED78: Multiple Subject (MS-2 program), and concurrent enrollment in EDS 361A or consent of instructor.", "prereqs": "EDS 361A"}
{"code": "EDS 355B", "title": "Advanced Mathematics Teaching Practices for Grades K–6", "units": "2", "anchor": "eds355b", "description": "Second course in the sequence. Provides a theoretical and practical grounding in pedagogy and professional factors influencing high-quality elementary mathematics education. Students will review research literature and various content standards, assessment materials, and curriculum materials in preparation for specialized mathematics instruction in elementary classrooms. Prerequisites: EDS 355A, admission into the ED85: Multiple Subject (MS-2 program), and concurrent enrollment in EDS 361B or consent of instructor.", "prereqs": "EDS 355A", "coreqs": "EDS 361B"}
{"code": "EDS 355C", "title": "Advanced Mathematics Teaching Practices for Grades K–6", "units": "2", "anchor": "eds355c", "description": "Third course in the series, which provides a theoretical and practical grounding in pedagogy and professional factors influencing high-quality elementary mathematics education. Students will review research literature and various content standards, assessment materials, and curriculum materials in preparation for specialized mathematics instruction in elementary classrooms. Prerequisites: EDS 355B is required prior to EDS 355C. Students must have been admitted to ED85; Multiple Subject (MS-2 program), and concurrent enrollment in EDS 361C or consent of instructor.", "prereqs": "EDS 355B"}
{"code": "EDS 361A", "title": "Innovative Instructional Practices I", "units": "6", "anchor": "eds361a", "description": "First course in a three-course sequence. It provides pedagogical methods for multiple-subject teaching. Diverse subject areas (math, science, fine arts, P.E., and social studies) are integrated into a single intercurricular course of study by emphasizing activity/inquiry techniques of instruction. Prerequisites: must be an ED76 major: Teaching and Learning Bilingual Education (ASL-English) or ED78 major only for Elementary Multiple Subject candidate who has advanced to student teaching. (F)"}
{"code": "EDS 361B", "title": "Innovative Instructional Practices II", "units": "6", "anchor": "eds361b", "description": "Second course in three-course sequence. It provides pedagogical methods for multiple subject teaching. Diverse subject areas (language arts, English language development, health education, mathematics, sciences, social studies, fine arts, and physical education) are integrated into a single intercurricular course of study by emphasizing activity/inquiry techniques of instructions. Prerequisites: EDS 361A, ED76 major: Teaching and Learning Bilingual Education (ASL-English) or ED78 major only for Elementary Multiple Subject candidate who has advanced to student teaching.", "prereqs": "EDS 361A"}
{"code": "EDS 361C", "title": "Innovative Instructional Practices III", "units": "4", "anchor": "eds361c", "description": "Last course in a three-course sequence. It provides pedagogical methods for multiple subject teaching. General teaching methods are integrated into a single intercurricular course of study by emphasizing activity/inquiry techniques of instruction. Prerequisites: EDS 361B, ED76 major: Teaching and Learning Bilingual Education (ASL-English) or ED78 major only for Elementary Multiple Subject candidate who has advanced to student teaching.", "prereqs": "EDS 361B"}
{"code": "EDS 369A", "title": "Multiple Subject", "units": "Elementary", "anchor": "eds369a", "description": "First course in a series. The elementary credential candidate performs student teaching in participating schools for seven to eight weeks full-time for each course (fifteen weeks total) under the supervision of a cooperating teacher and university supervisor. The student teaching experience offers professional preparation and diversified teaching responsibilities for postbaccalaureate students pursuing the California Multiple Subject Teaching Credential. Prerequisites: ED78 major for Elementary Multiple Subjects only. Affirmed Multiple Subject Credential candidate at UC San Diego who has advanced to student teaching."}
{"code": "EDS 369B", "title": "Multiple Subject", "units": "Elementary", "anchor": "eds369b", "description": "Second course in a two-course series. The elementary credential candidate performs student teaching in participating schools for seven to eight weeks full-time for each course (fifteen weeks total) under the supervision of a cooperating teacher and university supervisor. The student teaching experience offers professional preparation and diversified teaching responsibilities for postbaccalaureate students pursuing the California Multiple Subject Teaching Credential. Prerequisites: EDS 369A, ED78 major for Elementary Multiple Subjects only. Affirmed Multiple Subject Credential candidate at UC San Diego who has advanced to student teaching.", "prereqs": "EDS 369A"}
{"code": "EDS 372", "title": "World Language Teaching Practices", "units": "4", "anchor": "eds372", "description": "Proficiency-oriented language teaching techniques, including project-based and communicative approaches, developing student knowledge and appreciation of the cultures and societies in which the target language is spoken, the use of technology to support instruction aligned to the California academic content standards."}
{"code": "EDS 373", "title": "Secondary English Teaching Practices", "units": "4", "anchor": "eds373", "description": "The course introduces prospective secondary teachers to principles and strategies of teaching English language arts. Topics include writing processes, reading processes, integrated language arts, assessment, the second language learner, the classroom community, the California English Language Arts Framework. Prerequisites: ED78 Single Subject major only. Affirmed Single Subject candidate at UC San Diego who has advanced to internship or consent of instructor."}
{"code": "EDS 374", "title": "Secondary Mathematics Teaching Practices", "units": "4", "anchor": "eds374", "description": "Mathematics teaching techniques, including curriculum design, California Model Curriculum Standards, instructional methods, computer applications, selection and use of textbooks, student assessment, lesson planning, and classroom organization. Professional matters including curriculum planning, professional organizations, para-professionals, professional ethics, education law, and parent involvement are addressed. Prerequisites: ED78 Single Subject major only. Affirmed Single Subject candidate at UC San Diego who has advanced to internship or consent of instructor."}
{"code": "EDS 375", "title": "Secondary Science Teaching Practices", "units": "4", "anchor": "eds375", "description": "Science teaching techniques, including science curriculum design, California Model Curriculum Standards, instructional methods, computer applications, selection and use of textbooks, student assessment, lesson planning, and classroom organization. Professional matters including curriculum planning, professional organizations, paraprofessionals, professional ethics, education law, and parent involvement are addressed. Prerequisites: ED78 Single Subject major only. Affirmed Single Subject candidate at UC San Diego who has advanced to internship or consent of instructor."}
{"code": "EDS 376", "title": "Language and Learning Instruction", "units": "4", "anchor": "eds376", "description": "This course satisfies the California Commission on Teacher Credentialing requirement for preparation in reading theory and methods for all credential candidates. Theories of reading development, integration of the language arts, reading and writing in the content areas, teaching methods, and literature. Prerequisites: ED78 Elementary Multiple Subject or Single Subject candidates at UC San Diego who have advanced to student teaching or internship."}
{"code": "EDS 379A", "title": "Single Subject", "units": "Secondary", "anchor": "eds379a", "description": "The secondary credential candidate teaches approximately one academic quarter for each course in this series (one public school academic year) under the guidance of a university supervisor with additional support provided by an on-site teacher. The internship offers extensive professional preparation and diversified teaching experience under actual classroom conditions for postbaccalaureate students pursuing the California Single Subject Teaching Credential. Prerequisites: ED78 Single Subject major only. Affirmed Single Subject candidate at UC San Diego who has advanced to internship or consent of instructor."}
{"code": "EDS 379B", "title": "Single Subject", "units": "Secondary", "anchor": "eds379b", "description": "Second course in the series. The secondary credential candidate teaches approximately one academic quarter for each course in this series (one public school academic year) under the guidance of a university supervisor with additional support provided by an on-site teacher. The internship offers extensive professional preparation and diversified teaching experience under actual classroom conditions for postbaccalaureate students pursuing the California Single Subject Teaching Credential. Prerequisites: EDS 379A. ED78 Single Subject major only. Affirmed Single Subject candidate at UC San Diego who has advanced to internship.", "prereqs": "EDS 379A"}
{"code": "EDS 379C", "title": "Single Subject", "units": "Secondary", "anchor": "eds379c", "description": "Third course in the series. The secondary credential candidate teaches approximately one academic quarter for each course in this series (one public school academic year) under the guidance of a university supervisor with additional support provided by an on-site teacher. The internship offers extensive professional preparation and diversified teaching experience under actual classroom conditions for postbaccalaureate students pursuing the California Single Subject Teaching Credential. Prerequisites: EDS 379B. ED78 Single Subject major only. Affirmed Single Subject candidate at UC San Diego who has advanced to internship.", "prereqs": "EDS 379B"}
{"code": "EDS 381", "title": "Health Education", "units": "4", "anchor": "eds381", "description": "This course satisfies the Commission on Teacher Credentialing requirement for Health Education. Topics include physical education, substance abuse, sex education, cardio-pulmonary resuscitation, nutrition, and first aid. Prerequisites: ED78 major: Elementary Multiple Subject or Single Subject candidates at UC San Diego who have advanced to student teaching or internship."}
{"code": "EDS 382", "title": "Inclusive Educational Practices", "units": "4", "anchor": "eds382", "description": "This course satisfies the Commission on Teacher Credentialing requirements for Special Education. Topics include teaching methods for accommodating special-needs students in the regular classroom, developing an Individual Education Plan, characteristics of special-needs students, lesson planning to accommodate individual differences, and legislated mandates. Prerequisites: ED78 or ED81 major: Elementary Multiple Subject or Single Subject candidates at UC San Diego who have advanced to student teaching or internship and department approval required."}
{"code": "EDS 385", "title": "Elementary School Mathematics Content and Pedagogy", "units": "4", "anchor": "eds385", "description": "Examines the underlying mathematical concepts of the elementary school mathematics curriculum and related pedagogical implications for teaching. Topics include number concepts, algebraic thinking, geometry, and data collection and analysis. Prerequisites: students must be ED78 majors: MEd/Elementary-Multiple Subject Credential candidates who have advanced to student teaching or internship. (MS-2)."}
{"code": "EDS 201", "title": "Introduction to Resources for Teaching and Learning", "units": "4", "anchor": "eds201", "description": "This course introduces students to educational resources, both in print and online. Students compile and evaluate research studies, curricular materials, and instructional approaches in preparation for future projects in developing and evaluating various approaches to teaching and learning. Prerequisites: students must be registered EDS graduate students (ED 76, 77, 78, 79, 80)."}
{"code": "EDS 203", "title": "Technology, Teaching, and Learning", "units": "4", "anchor": "eds203", "description": "This course will review current literature on effective applications of technology in the classroom. Students will also become fluent in the use of productivity tools, presentation software, and web development for teaching and learning; critique software relevant to their area of teaching; and develop an educational activity based on their review of the literature that harnesses the power of technology. Prerequisites: students must be registered EDS graduate students (ED 76, 77, 78, 79, 80)."}
{"code": "EDS 204", "title": "Technology and Professional Assessment", "units": "4", "anchor": "eds204", "description": "Advanced techniques for using network-based resources for teaching and learning will be introduced. Students will review relevant research on advanced technologies related to assessment of professional performance and student achievement. Students will present a web-based professional Teaching Performance Assessment Portfolio that reflects teaching performance during their student teaching or internship field experience. Prerequisites: students must be registered EDS graduate students."}
{"code": "EDS 205A", "title": "Reflective Teaching Practice", "units": "2", "anchor": "eds205a", "description": "This course introduces principles and practices of reflective teaching. Student teachers and interns will systematically document their practice teaching and analyze observation data to improve performance. Students will collaborate with supervisors and expert teachers throughout the yearlong preservice teaching experience. Prerequisites: students must be registered EDS graduate students."}
{"code": "EDS 205B", "title": "Reflective Teaching Practice", "units": "2", "anchor": "eds205b", "description": "This course introduces principles and practices of reflective teaching. Student teachers and interns will systematically document their practice teaching and analyze observation data to improve performance. Students will collaborate with supervisors and expert teachers throughout the yearlong preservice teaching experience. Prerequisites: EDS 205A, and students must be registered EDS graduate students.", "prereqs": "EDS 205A"}
{"code": "EDS 206", "title": "Teaching Performance Assessment Portfolio", "units": "4", "anchor": "eds206", "description": "This course introduces the use of a Teaching Performance Assessment Portfolio for assessment of teaching performance. Student teachers and interns will design an electronic portfolio that demonstrates acceptable performance on essential credential standards. National Board of Professional Teaching Standards will also be introduced. Prerequisites: students must be registered EDS graduate students."}
{"code": "EDS 229", "title": "Introduction to Educational Resources", "units": "4", "anchor": "eds229", "description": "This course prepares K–12 teacher-researchers to design, implement, and evaluate classroom research. Students learn how to access and evaluate research studies, curricular materials, and instructional approaches both online and in print. Prerequisites: students must be registered ED75 majors."}
{"code": "EDS 230A-B-C", "title": ". Research in Curriculum Design", "units": "4-4-4", "anchor": "eds230c", "description": "A yearlong course sequence, which provides an extensive overview of curriculum, design principles appropriate for K–12 instruction. Consensus and model building methods will be discussed using case studies of curriculum research and development projects appropriate for various subject areas and grade levels. Participants will design, implement, and evaluate a curriculum project in their own classrooms. Prerequisites: must be ED75 major or consent of instructor. (F,W,S)"}
{"code": "EDS 231", "title": "Advanced Topics in Instructional Practices", "units": "4", "anchor": "eds231", "description": "Selected advanced topics in K–12 instructional practices in various subject areas. Techniques for teaching higher-level cognitive processes and advanced applications of computers and other technology will be stressed. Participants will conduct a field study of promising teaching practices appropriate to their grade level(s) and subject area(s) of instruction. Prerequisites: must be ED75 major or consent of instructor. (Su)"}
{"code": "EDS 232", "title": "Special Topics in Education", "units": "4", "anchor": "eds232", "description": "This course explores topical issues in education. It focuses on recent developments that have broad implications for research and practice in teaching and learning. Course topics will vary each time the course is offered. Prerequisites: ED75 major or consent of instructor."}
{"code": "EDS 233A", "title": "Topics in Education Research and Design", "units": "2", "anchor": "eds233a", "description": "Current topics and issues in education and educational research methodology, including action research, participant observation, ethnography, and survey research. This is the first in a two-course series. Prerequisites: ED79 major or consent of instructor."}
{"code": "EDS 233B", "title": "Topics in Education Research and Design", "units": "2", "anchor": "eds233b", "description": "Current topics and issues in education and educational research methodology, including action research, participant observation, ethnography, and survey research. This is the second in a two-course series. Prerequisites: EDS 233A: ED79 major or consent of instructor.", "prereqs": "EDS 233A"}
{"code": "EDS 240A", "title": "Research in ASL-English Bilingual Education", "units": "4", "anchor": "eds240a", "description": "A three-course sequence in which participants conduct an overview of research and design and conduct a study related to bilingual, bicultural education for deaf children. Prerequisites: ED76 major: Teaching and Learning Bilingual Education (ASL-English) or consent of instructor."}
{"code": "EDS 240B", "title": "Research in ASL-English Bilingual Education", "units": "4", "anchor": "eds240b", "description": "A three-course sequence in which participants conduct an overview of research and design and conduct a study related to bilingual, bicultural education for deaf children. Prerequisites: EDS 240A, and ED76 major: Teaching and Learning Bilingual Education (ASL-English) or consent of instructor.", "prereqs": "EDS 240A"}
{"code": "EDS 240C", "title": "Research in ASL-English Bilingual Education", "units": "4", "anchor": "eds240c", "description": "A three-course sequence in which participants conduct an overview of research and design and conduct a study related to bilingual, bicultural education for deaf children. Prerequisites: EDS 240A/EDS 240B, and ED76 major: Teaching and Learning Bilingual Education (ASL-English) or consent of instructor.", "prereqs": {"type": "one", "courses": ["EDS 240A", "EDS 240B"]}}
{"code": "EDS 249", "title": "Equity in Higher Education", "units": "4", "anchor": "eds249", "description": "This graduate-level course is aimed at providing students with an opportunity to learn about institutional transformation and equity in higher education. Prerequisites: graduate-level standing."}
{"code": "EDS 250", "title": "Equitable Educational Research and Practice", "units": "4", "anchor": "eds250", "description": "This course introduces students to research studies and educational practices of educational equity, both in general and within specific content areas. Research studies relevant to educational equity will be examined, as will practices that have attempted to enable all students to achieve to the best of their abilities. Prerequisites: students must be registered EDS graduate students."}
{"code": "EDS 251", "title": "Transforming Learning Environments", "units": "4", "anchor": "eds251", "description": "This course explores formal and informal learning environments with documented records of successful student engagement. Using an array of curriculum and learning theories, students investigate new and traditional pedagogical practices, curricula, and learning environments for elements of transformative practices. Students critique current literature on teaching for change as it applies to the contexts they chose to study and identify new possibilities for teaching and learning in diverse student contexts. Letter grades only. Prerequisites: ED82 major or consent of instructor."}
{"code": "EDS 252", "title": "Transforming Inequities in Student Outcomes", "units": "4", "anchor": "eds252", "description": "The course focuses on factors that shape the unequal distribution of educational opportunities for marginalized groups. Students will interrogate societal and school structures and underlying socio-cultural processes that impact engagement and outcomes for marginalized groups or students. Students will explore theories on student success and failure, family and community connections, and identity formation in relation to transforming outcomes. Letter grades only. Prerequisites: ED82 major or consent of instructor."}
{"code": "EDS 253", "title": "Transforming Educational Systems and Policy", "units": "4", "anchor": "eds253", "description": "This course exposes students to past and present systemic policies that influence the practices and efficiency of the P–20 system. Students will explore the barriers and facilitators of successful policy interventions at the local, state, and federal levels of education policy. Attention is given to each segment of the educational continuum, exposing students to strategies for transforming the educational system to ensure equitable opportunities to learn and achieve. Prerequisites: ED82 major or consent of instructor."}
{"code": "EDS 254", "title": "Introduction to Research Design and Quantitative Data Analysis", "units": "4", "anchor": "eds254", "description": "Introduction to quantitative concepts, descriptive statistics, and fundamentals of statistical inference in social science. Emphasis on applying statistical concepts—how to select the appropriate statistical techniques, execute those techniques, examine assumptions necessary for the techniques to work appropriately, interpret analytic results, and summarize findings in a professional manner. Hands-on computer-based practice of quantitative analyses will be an integral part of the course. Letter grades only. Prerequisites: doctoral students in education ED82 or MSED major ME75 or consent of instructor."}
{"code": "EDS 255", "title": "Advanced Quantitative Data Analysis", "units": "4", "anchor": "eds255", "description": "In this course, students will extend their knowledge of statistical methods based on the general linear model, including correlation, regression, analysis of variance, and analysis of covariance to address questions that emerge in educational and social science research. Students will address a variety of substantive research questions by analyzing data and fitting increasingly sophisticated analytic models. Letter grades only. Prerequisites: EDS 254. Restricted to doctoral students (ED82), MSED major ME75, or consent of instructor.", "prereqs": "EDS 254"}
{"code": "EDS 256", "title": "Introduction to Mixed Methods Research Design and Analysis", "units": "4", "anchor": "eds256", "description": "This course offers an introduction to mixed methods research in education studies. Participants will learn how qualitative and quantitative data can be integrated to capture the perspectives of individuals and organizations to answer complex research questions. The course will cover formulating research questions, collecting and analyzing different types of data, choosing appropriate mixed methods designs, and interpreting mixed methods results. Letter grades only. Prerequisites: EDS 254 and EDS 264. ED82 major or consent of instructor.", "prereqs": {"type": "all", "courses": ["EDS 254", "EDS 264"]}}
{"code": "EDS 257", "title": "Case Study Research", "units": "4", "anchor": "eds257", "description": "This course will guide doctoral students in conducting rigorous case study research in the social sciences and the field of education. The course will address case study design, data collection, data analysis, and reporting. This will be accomplished through training on these stages of case study research. It will also provide hands-on experience designing case studies and analyzing case study data. The course will equip students with all the necessary tools to conduct independent case studies. Letter grades only. Prerequisites: ED82 and ED79 majors, or consent of instructor."}
{"code": "EDS 259", "title": "Communicating Research", "units": "2", "anchor": "eds259", "description": "Universities are exploring new ways to convey the relevance of research directly to interested stakeholders beyond the academy. In this course, students will learn and practice a variety of strategies and tools for communicating their scholarship to a range of audiences, actively participate in discussion of education equity and access, and coconstruct meaningful partnerships with education stakeholders. S/U grades only. May be taken for credit two times. Prerequisites: ED82 major or consent of instructor."}
{"code": "EDS 260A", "title": "Educational Research and Evaluation Design", "units": "4", "anchor": "eds260a", "description": "This course integrates a variety of social and behavioral science perspectives and research methodologies in examining topics of central relevance to education. Students have opportunities to design and apply to educational-research questions a variety of methodologies, including survey, interview, ethnographic, case study, video data analysis, and discourse analysis methods. This is the first of a three-course series. Prerequisites: admission into the EdD program or consent of instructor."}
{"code": "EDS 260B", "title": "Educational Research and Evaluation Design", "units": "4", "anchor": "eds260b", "description": "This course integrates a variety of social and behavioral science perspectives and research methodologies in examining topics of central relevance to education. Students have opportunities to design and apply to educational-research questions a variety of methodologies, including survey, interview, ethnographic, case study, video data analysis, and discourse analysis methods. This is the second of a three-course series. Prerequisites: EDS 260A, and admission into the EdD program or consent of instructor.", "prereqs": "EDS 260A"}
{"code": "EDS 260C", "title": "Educational Research and Evaluation Design", "units": "4", "anchor": "eds260c", "description": "This course integrates a variety of social and behavioral science perspectives and research methodologies in examining topics of central relevance to education. Students have opportunities to design and apply to educational research questions a variety of methodologies, including survey, interview, ethnographic, case study, video data analysis, and discourse analysis methods. This is the third of a three-course series. Prerequisites: EDS 260B, and admission into the EdD program or consent of instructor.", "prereqs": "EDS 260B"}
{"code": "EDS 261A", "title": "Advanced Research and Evaluation Methods", "units": "4", "anchor": "eds261a", "description": "This course addresses more advanced topics in research design and methodology. Students hone the requisite research skills to conduct dissertation research. Students gain varied hands-on experiences in collecting and analyzing data relevant to schooling, as well as learn how to develop, manage, and analyze large data files. Students create a research agenda and develop skills needed in proposal writing: development, organization and coherence, conceptualization of research design, and attention to audience and writing style. This is the first of a three-course series. Prerequisites: admission into the EdD program or consent of instructor."}
{"code": "EDS 261B", "title": "Advanced Research and Evaluation Methods", "units": "4", "anchor": "eds261b", "description": "This course addresses more advanced topics in research design and methodology. Students hone the requisite research skills to conduct dissertation research. Students gain varied hands-on experiences in collecting and analyzing data relevant to schooling, as well as learn how to develop, manage, and analyze large data files. Students create a research agenda and develop skills needed in proposal writing: development, organization and coherence, conceptualization of research design, and attention to audience and writing style. This is the second of a three-course series. Prerequisites: EDS 261A, and admission into the EdD program or consent of instructor.", "prereqs": "EDS 261A"}
{"code": "EDS 261C", "title": "Advanced Research and Evaluation Methods", "units": "4", "anchor": "eds261c", "description": "This course addresses more advanced topics in research design and methodology. Students hone the requisite research skills to conduct dissertation research. Students gain varied hands-on experiences in collecting and analyzing data relevant to schooling, as well as learn how to develop, manage, and analyze large data files. Students create a research agenda and develop skills needed in proposal writing: development, organization and coherence, conceptualization of research design, and attention to audience and writing style. This is the third of a three-course series. Prerequisites: EDS 261B, and admission into the EdD program or consent of instructor.", "prereqs": "EDS 261B"}
{"code": "EDS 262A", "title": "Dissertation Writing Seminar", "units": "4", "anchor": "eds262a", "description": "This seminar provides an opportunity for doctoral candidates to present and critique in-progress dissertation research and writing. Topics addressed will also include writing for professional publications and presenting research findings to varied audiences. This is the first of a three-course series. Prerequisites: admission into the EdD program or consent of instructor."}
{"code": "EDS 262B", "title": "Dissertation Writing Seminar", "units": "4", "anchor": "eds262b", "description": "This seminar provides an opportunity for doctoral candidates to present and critique in-progress dissertation research and writing. Topics addressed will also include writing for professional publications and presenting research findings to varied audiences. This is the second of a three-course series. Prerequisites: EDS 262A, and admission into the EdD program or consent of instructor.", "prereqs": "EDS 262A"}
{"code": "EDS 262C", "title": "Dissertation Writing Seminar", "units": "4", "anchor": "eds262c", "description": "This seminar provides an opportunity for doctoral candidates to present and critique in-progress dissertation research and writing. Topics addressed will also include writing for professional publications and presenting research findings to varied audiences. This is the third of a three-course series. Prerequisites: EDS 262B, and admission into the EdD program or consent of instructor.", "prereqs": "EDS 262B"}
{"code": "EDS 263", "title": "Developmental Theory and Culture", "units": "4", "anchor": "eds263", "description": "This seminar will examine basic approaches to the study of human development, drawing on theory, research, and methods from multiple disciplines to study how children and adults develop within the context of cultural communities. It includes discussion of cultural practices as mediators on developmental outcomes, notions of universals and diversity, and individualism and familism. We will discuss the complex ways that individual and sociocultural factors interact in learning and development."}
{"code": "EDS 264", "title": "Introduction to Qualitative Analysis", "units": "4", "anchor": "eds264", "description": "This course provides an introduction to qualitative approaches in education research. Students explore various qualitative methods and analytic strategies and gain hands-on experiences analyzing qualitative data collected on topics relevant to the study of education. The assigned readings include scholarship on the philosophical underpinnings and practice of qualitative research and varied examples of published qualitative research studies. Prerequisites: ED82 major or consent of instructor."}
{"code": "EDS 265", "title": "Special Topics in Qualitative Methods", "units": "4", "anchor": "eds265", "description": "This course series addresses special topics in education research and data analysis. Students explore a faculty-specified qualitative research method and analytic approach. Approaches may include case studies, video analysis, mixed methods, naturalistic observations, ethnography, and netnography. The assigned readings include scholarship on the practice and philosophical underpinnings of the specified qualitative research approach and examples of published qualitative studies. Prerequisites: ED82 major or consent of instructor."}
{"code": "EDS 266", "title": "Special Topics in Quantitative Methods", "units": "4", "anchor": "eds266", "description": "This course series addresses special topics in quantitative education research and data analysis. Students explore a faculty-specified quantitative research method and analytic approach. Approaches may include social network analysis, hierarchical linear modeling, latent class analysis, and structural equation modeling. The readings include scholarship on the practice and philosophical underpinnings of the specified quantitative research approach and examples of published quantitative studies. Letter grades only. Prerequisites: ED82 major or consent of instructor."}
{"code": "EDS 267", "title": "Contexts for Teaching and Change", "units": "4", "anchor": "eds267", "description": "This seminar integrates a range of perspectives to understand the contexts of teaching and change. There are three main foci: 1) how the profession of teaching in PK–16 is shaped by factors in the broader policy, political, and social context; 2) change, change agentry, and obstacles to change in educational institutions; 3) design-based research models to effect changes in the context of teaching. An international comparative approach is critical to consider levers for educational improvement. Letter grades only. Prerequisites: restricted to PhD (ED82) and EdD (ED79) students, or consent of instructor."}
{"code": "EDS 268", "title": "Introduction to Critical Race Theory and Education", "units": "4", "anchor": "eds268", "description": "Introduction to critical race theory (CRT) and education provides a foundation for students who are interested in learning more about critical race theory in education. Students will read seminal and new scholarship in CRT. Students will gain a solid breadth of knowledge from the field of CRT and identify possible applications and opportunities for future research in education. Prerequisites: EDS 251 or EDS 252 or EDS 253. ED82 major or consent of instructor.", "prereqs": {"type": "one", "courses": ["EDS 251", "EDS 252", "EDS 253"]}}
{"code": "EDS 269", "title": "Diverse College Students", "units": "4", "anchor": "eds269", "description": "This course is aimed at providing students with an opportunity to develop a better understanding of theory and research focused on college students. Students will gain increased levels of knowledge about areas of critical research on students in higher education, and apply this knowledge to envision innovating efforts aimed at the improvement of higher education policy and practice. Prerequisites: graduate-level standing."}
{"code": "EDS 270", "title": "Leadership and Equity in Educational Reform", "units": "4", "anchor": "eds270", "description": "This course provides a framework for understanding school reform movements that integrates relevant theory and research from a number of academic disciplines. Prerequisites: admission into the EdD program or consent of instructor."}
{"code": "EDS 272", "title": "Education and Culture", "units": "4", "anchor": "eds272", "description": "This course examines schooling from an anthropological perspective, focusing on the impact of social and cultural forces on teaching and learning in US public schools using comparative materials from other societies and settings. Prerequisites: admission into the EdD program or consent of instructor."}
{"code": "EDS 278", "title": "Talking Culture, Culture Talking: Voices of Diversity", "units": "4", "anchor": "eds278", "description": "This course explores the discourse of culture in American society and the problem of “silenced” or unheard voices. The interaction of individual and collective voice, language, and identity are discussed as they bear on the ways that culture moves through important social institutions such as schools. Of particular interest are issues of teaching, learning, displacement, inclusion, marginality, and the “speaking center.” Prerequisites: graduate status or consent of instructor."}
{"code": "EDS 279", "title": "Campus Activism", "units": "4", "anchor": "eds279", "description": "This course is focused on providing students with a better understanding of the relationship between social movements and higher education systems. In this course, students will engage with literature from a wide range of fields, including sociology, political science, ethnic studies, and education in order to learn about the ways in which people study social movements and activism in higher education. Prerequisites: graduate-level standing."}
{"code": "EDS 280", "title": "Rethinking Leadership", "units": "4", "anchor": "eds280", "description": "This course will present the evolution of leadership thought and theory, with an emphasis on the distinction between, and interrelatedness of, effective management and leadership. The ethics of leadership practice and epistemological perspectives of emerging leadership styles will be explored, and students will have opportunities to reflect on the nature of leadership as it is practiced in educational settings. Applying critical, self-reflective leadership practice through structured activities is also an element of this course."}
{"code": "EDS 281", "title": "Leadership for Learning", "units": "4", "anchor": "eds281", "description": "This course will explore various models of curriculum and instruction in response to students’ learning needs. It also will examine models of school organization and the leader’s role and responsibility in developing a school culture that promotes student achievement, using evidence-based decision making. A major emphasis will be on evaluating research on which theories and practice are based. Prerequisites: Joint EdD in Educational Leadership student status (ED81)."}
{"code": "EDS 282", "title": "Leadership for a Diverse Society", "units": "4", "anchor": "eds282", "description": "This course will address theories and practices for achieving schools and classrooms that are informed by and built around the participation of diverse communities and cultures. The emphasis is on how leadership intersects with sociohistorical and sociocultural theories that suggest that the organization of schools and instruction is critical to student inclusion and outcomes. A basic premise of this course is that a socially just learning theory begins with using all of the resources and knowledge of families, communities, and cultures in formulating policy and practice. Prerequisites: Joint EdD in Educational Leadership student status."}
{"code": "EDS 283", "title": "Leadership for Organizational Change", "units": "4", "anchor": "eds283", "description": "This course will present multiple theories of organizational change, explore group processes and identify models of decision making, and analyze human motivation theories. Establishing and nurturing a purpose-driven organization, while dealing with competing demands, will be discussed. A major emphasis in this course is on people as agents of change and on the creation of high-quality ethical and productive workplaces where employees can achieve success and satisfaction, while advancing the mission of the educational organization. Prerequisites: Joint EdD in Educational Leadership student status or consent of instructor."}
{"code": "EDS 284", "title": "Leadership for Organizational Development", "units": "4", "anchor": "eds284", "description": "This course will investigate the skills and dispositions needed for students to lead the development of learning organizations. Faculty will teach and model concepts of working with people within educational organizations and programs. Emphasis will be placed on individual’s team development and facilitation, organizational communications, adult learning, and professional development. Prerequisites: Joint EdD in Educational Leadership student status or consent of instructor."}
{"code": "EDS 285", "title": "Leadership for the Future", "units": "4", "anchor": "eds285", "description": "This course addresses interdisciplinary influences on leadership practice within learning organizations. Contributions from scholars in futures’ studies, including those influenced by modernism and postmodernism, will be used to explore topics such as long-range planning, demographic trends, technology, and brain theory. Prerequisites: Joint EdD in Educational Leadership student status or consent of instructor."}
{"code": "EDS 286", "title": "Advanced Topics in Leadership", "units": "4", "anchor": "eds286", "description": "This course explores topical issues in the field of leadership. It focuses on recent developments that have broad implications for research and practice in educational leadership. Course topics will vary each time the course is offered. Prerequisites: Joint EdD in Educational Leadership student status."}
{"code": "EDS 287A", "title": "Educational Research and Evaluation Design A", "units": "4", "anchor": "eds287a", "description": "This course integrates a variety of social and behavioral science perspectives and research methodologies in examining topics of central relevance to education. Students have opportunities to learn a variety of quantitative and/or qualitative methodologies. Letter grades only. EDS 287A is one of three courses in the series. Prerequisites: EDS doctoral student (ED81 or ED82) or consent of instructor."}
{"code": "EDS 287B", "title": "Educational Research and Evaluation Design B", "units": "4", "anchor": "eds287b", "description": "This course integrates a variety of social and behavioral science perspectives and research methodologies in examining topics of central relevance to education. Students have opportunities to learn a variety of quantitative and/or qualitative methodologies. Letter grades only. EDS 287B is one of three courses in the series. Prerequisites: EDS 287A and EDS doctoral student (ED81 or ED82), or consent of instructor.", "prereqs": "EDS 287A"}
{"code": "EDS 287C", "title": "Educational Research and Evaluation Design C—Qualitative Methods", "units": "4", "anchor": "eds287c", "description": "This course integrates a variety of social and behavioral science perspectives and research methodologies in examining topics of central relevance to education. Students have opportunities to learn a variety of quantitative and/or qualitative methodologies. Letter grades only. EDS 287C is one of three courses in the series. Prerequisites: EDS 287A, EDS 287B, and EDS doctoral student (ED81 or ED82), or consent of instructor.", "prereqs": {"type": "all", "courses": ["EDS 287A", "EDS 287B"]}}
{"code": "EDS 288A", "title": "Advanced Research and Evaluation Methods A—Quantitative Methods", "units": "4", "anchor": "eds288a", "description": "This first course in a three-course series focuses on the importance of data interpretation. Students hone the requisite research skills to conduct dissertation research as it pertains to gathering, collecting, analyzing, and reporting quantitative data in a meaningful way. This course provides an overview of data use in educational systems as well as an introduction to survey design and inferential statistics. Students create a research agenda to develop skills needed in proposal writing. Letter grades only. EDS 288A is one of three courses in the series. Prerequisites: EDS doctoral student (ED81 or ED82) or consent of instructor."}
{"code": "EDS 288B", "title": "Advanced Research and Evaluation Methods B—Qualitative Methods", "units": "4", "anchor": "eds288b", "description": "This course focuses on student’s skill development in qualitative research with emphasis on designing qualitative studies. Students will learn and practice the core qualitative data collection approaches of observing and interviewing. Letter grades only. EDS 288B is one of three courses in the series. Prerequisites: EDS doctoral student (ED81 or ED82) or consent of instructor."}
{"code": "EDS 288C", "title": "Advanced Research and Evaluation Methods C—Quantitative Methods", "units": "4", "anchor": "eds288c", "description": "This course focuses on analyzing quantitative data. Students will deepen knowledge and skill on data collection and analysis and use data to prepare and report findings. Students will also explore other research methods of their choosing and will develop and conduct a small pilot study relevant to dissertation topics. Letter grades only. EDS 288C is one of three courses in the series. Prerequisites: EDS doctoral student (ED81 or ED82) or consent of instructor."}
{"code": "EDS 289A", "title": "Dissertation Writing Seminar", "units": "4", "anchor": "eds289a", "description": "This seminar provides an opportunity for doctoral candidates to present and critique in-progress dissertation research and writing. Topics addressed will also include writing for professional publications and presenting research findings to varied audiences. This is the first in a four-course series. Prerequisites: Joint EdD in Educational Leadership student status or consent of instructor."}
{"code": "EDS 289B", "title": "Dissertation Writing Seminar", "units": "4", "anchor": "eds289b", "description": "This seminar provides an opportunity for doctoral candidates to present and critique in-progress dissertation research and writing. Topics addressed will also include writing for professional publications and presenting research findings to varied audiences. This is the second in a four-course series. Prerequisites: EDS 289A, and Joint EdD in Educational Leadership student status or consent of instructor.", "prereqs": "EDS 289A"}
{"code": "EDS 289C", "title": "Dissertation Writing Seminar", "units": "4", "anchor": "eds289c", "description": "This seminar provides an opportunity for doctoral candidates to present and critique in-progress dissertation research and writing. Topics addressed will also include writing for professional publications and presenting research findings to varied audiences. This is the third in a four-course series. Prerequisites: EDS 289B, and Joint EdD in Educational Leadership student status or consent of instructor.", "prereqs": "EDS 289B"}
{"code": "EDS 289D", "title": "Dissertation Writing Seminar", "units": "4", "anchor": "eds289d", "description": "This seminar provides an opportunity for doctoral candidates to present and critique in-progress dissertation research and writing. Topics addressed will also include writing for professional publications and presenting research findings to varied audiences. This is the fourth course in a four-course series. Prerequisites: EDS 289C, and Joint EdD in Educational Leadership student status or consent of instructor.", "prereqs": "EDS 289C"}
{"code": "EDS 290", "title": "Research Practicum", "units": "1–12", "anchor": "eds290", "description": "Supervised research studies with individual topics selected according to students’ special interests. Students will develop a research proposal appropriate for MA thesis, begin to gather and analyze data. Prerequisites: MA candidate and consent of instructor. (S/U grades only.)"}
{"code": "EDS 291A", "title": "Leadership Research Practicum", "units": "2", "anchor": "eds291a", "description": "Students use their placements in local schools and educational settings to examine leadership research and practice topics raised in the Leadership core courses and Research and Evaluation Design/Methods courses. This is the first in a three-course series. Prerequisites: Joint EdD in Educational Leadership student status or consent of instructor."}
{"code": "EDS 291B", "title": "Leadership Research Practicum", "units": "2", "anchor": "eds291b", "description": "Students use their placements in local schools and educational settings to examine leadership research and practice topics raised in the Leadership core courses and Research and Evaluation Design/Methods courses. This is the second course in a three-course series. Prerequisites: EDS 291A, and Joint EdD in Educational Leadership student status.", "prereqs": "EDS 291A"}
{"code": "EDS 292", "title": "Qualifying Paper Preparation", "units": "2", "anchor": "eds292", "description": "This course will provide students with time, resources, and guidance for the purpose of developing a review of literature on a student-related topic, which typically becomes the focus of the dissertation research project. Students will be expected to use a variety of research tools in order to discover and identify relevant information. Prerequisites: Joint EdD in Educational Leadership student status. (S/U grade permitted)"}
{"code": "EDS 293A", "title": "Advanced Leadership Research Practicum", "units": "2", "anchor": "eds293a", "description": "Students use their placements in local schools and educational settings to examine leadership research and practice topics raised in the Leadership core courses and Research and Evaluation Design/Methods courses. This is the first course in a three-course series. Prerequisites: Joint EdD in Educational Leadership student status or consent of instructor."}
{"code": "EDS 293B", "title": "Advanced Leadership Research Practicum", "units": "2", "anchor": "eds293b", "description": "Students use their placements in local schools and educational settings to examine leadership research and practice topics raised in the Leadership core courses and Research and Evaluation Design/Methods courses. This is the second course in a three-course series. Prerequisites: EDS 293A, and Joint EdD in Educational Leadership student status or consent of instructor.", "prereqs": "EDS 293A"}
{"code": "EDS 294A", "title": "Colloquium on Educational Leadership", "units": "2", "anchor": "eds294a", "description": "Program faculty and visiting lecturers present leadership research in progress. Serves as a forum to discuss current research in educational leadership. This is the first course of a two-course series. Prerequisites: graduate student status or consent of instructor."}
{"code": "EDS 294B", "title": "Colloquium on Educational Leadership", "units": "2", "anchor": "eds294b", "description": "Program faculty and visiting lecturers present leadership research in progress. Serves as a forum to discuss current research in educational leadership. This is the second course in a two-course series. Prerequisites: EDS 294A, and graduate student status or consent of instructor.", "prereqs": "EDS 294A"}
{"code": "EDS 295", "title": "MA Thesis", "units": "1–8", "anchor": "eds295", "description": "Research for the master’s thesis (Educational Research) or curriculum design portfolio thesis (Curriculum Design). Open for repeated registration up to eight units (S/U grade only). Prerequisites: consent of instructor."}
{"code": "EDS 296", "title": "Research Apprenticeship Course", "units": "2–12", "anchor": "eds296", "description": "The RAC will introduce students to transformational research and practice in education through involvement in faculty-led research teams. The RAC will provide a structured environment for mentoring through engagement in collaborative research activities. Each RAC will conceptualize and conduct research that is likely to result in student presentations at educational conferences and in student publications. The RAC also provides support for the analysis and write-up of dissertation research. S/U grades only. May be repeated for credit up to eighteen times for a maximum of 120 units. Prerequisites: ED82 major or consent of instructor."}
{"code": "EDS 297", "title": "Directed Group Study", "units": "1–6", "anchor": "eds297", "description": "Study and analysis of specific topics under the guidance of a faculty member. Offered for repeated registration. Prerequisites: consent of instructor."}
{"code": "EDS 298", "title": "Independent Study", "units": "1–6", "anchor": "eds298", "description": "Individual guided study and/or independent research in an area not covered by present course offerings. Offered for repeated registration. Prerequisites: consent of instructor."}
{"code": "EDS 299", "title": "Dissertation Research", "units": "1–12", "anchor": "eds299", "description": "Directed research on dissertation topic for students who have been admitted to candidacy for the EdD or PhD program. May be taken for credit up to four times for a maximum of forty-eight units. Prerequisites: admission into the EdD or PhD program (major codes ED81 and ED82) and consent of instructor."}
{"code": "EDS 500", "title": "Apprentice Teaching in Education", "units": "2–4", "anchor": "eds500", "description": "The course, designed for graduate students serving as teaching assistants in teacher education courses, includes discussion of teaching theory and practice, instructional materials, organization of discussion sections, liaison with participating schools, and methods of evaluation/grading under the supervision of the instructor of the course. S/U grades only. May be taken for credit five times."}
