{"code": "GLBH", "name": "Global Health Program", "link": "https://catalog.ucsd.edu/courses/GLBH.html"}
{"code": "GLBH 20", "title": "Introduction to Global Health", "units": "4", "anchor": "glbh20", "description": "Provides a foundational interdisciplinary understanding of complex global health issues and introduces major concepts and principles in global health. The course surveys the range of problems contributing to the global burden of disease and disability including infectious disease, mental illness, refugee and immigrant health, natural disasters, climate change, and food insecurity."}
{"code": "GLBH 100", "title": "Special Topics in Global Health", "units": "4", "anchor": "glbh100", "description": "Selected topics in global health. Content will vary from quarter to quarter. May be taken for credit up to four times."}
{"code": "GLBH 101", "title": "Aging: Culture and Health in Late Life Human Development", "units": "4", "anchor": "glbh101", "description": "(Cross-listed with ANSC 101.) Examines aging as a process of human development from local and global perspectives. Focuses on the interrelationships of social, cultural, psychological, and health factors that shape the experience and well-being of aging populations. Students explore the challenges and wisdom of aging. Students may not receive credit for GLBH 101 and ANSC 101."}
{"code": "GLBH 102", "title": "Global Health Epidemiology", "units": "4", "anchor": "glbh101", "description": "This course will address basic epidemiology principles, concepts, and procedures that are used in investigation of health-related states or events from a global perspective. Explores study designs and methods appropriate for studies of incidence and prevalence, causality and prevention, with emphasis on research in resource-poor settings. Prerequisites: COGS 14B or MATH 11 or PSYC 60 and GLBH 20 or FMPH 40 and GLBH 181.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["COGS 14B", "MATH 11", "PSYC 60"]}, {"type": "one", "courses": ["GLBH 20", "FMPH 40"]}, "GLBH 181"]}}
{"code": "GLBH 103", "title": "Global Health Disparities and the Quest for Global Health Equity", "units": "4", "anchor": "glbh101", "description": "This course examines health and health care for racial and ethnic minorities in the United States. Students will explore explanations for why racial and ethnic minorities have poorer health outcomes and receive lower quality health care than other societal groups. Students will examine discrimination in health care settings, psychosocial stress and mental and physical health, and how the health care system generates disparate outcomes through interpersonal and institutional processes."}
{"code": "GLBH 104", "title": "Humanities, Ethics, and Professionalism: Engaging Moral Imaginaries for Exploring Health and the Human Condition", "units": "4", "anchor": "glbh101", "description": "Questions of morality are implicit in all aspects of health. Drawing insights from the medical humanities, this course engages students in thinking about the human condition (what it means to be human or dehumanized) from multiple perspectives: individual, social, civic. How do humans ascribe meaning to their lives? What does it take to flourish? What is empathy; for whom do we have it? What is ethical and just about the organization of society and its impact on health?"}
{"code": "GLBH 105", "title": "Global Health and Inequality", "units": "4", "anchor": "glbh101", "description": "(Cross-listed with ANSC 105.) Why is there variation of health outcomes across the world? We will discuss health and illness in context of culture and address concerns in cross-national health variations by comparing health care systems in developed, underdeveloped, and developing countries. In addition, we’ll study the role of socioeconomic and political change in determining health outcomes, and examine social health determinants in contemporary global health problems—multidrug resistance to antibiotics, gender violence, human trafficking, etc. Students may receive credit for one of the following: GLBH 105, ANSC 105, ANSC 105S, or ANSC 105GS."}
{"code": "GLBH 106", "title": "Water, Sanitation, and Hygiene in Global Health", "units": "4", "anchor": "glbh101", "description": "This course provides an overview of water, sanitation, and hygiene (WaSH) in global health. We discuss the global burden of disease from inadequate access to WaSH services, survey the state of WaSH across the globe, learn about a range of WaSH technologies, examine the social, economic, and policy considerations important in WaSH planning and sustainability, and learn how to conduct a water safety test. Case studies from the Americas, South Asia, and sub-Saharan Africa will be discussed. It is recommended that students take GLBH 20, Introduction to Global Health, prior to enrolling in this course."}
{"code": "GLBH 107", "title": "Refugee Health in Local and Global Contexts", "units": "4", "anchor": "glbh101", "description": "This course provides an overview of the health worlds of forcibly displaced populations, focusing on the intersections of violence, migration, and globalization. Topics include infectious disease, mental health, health policy, and access to care. Specific case studies explored include Latin American migrant experiences in the U.S., Haitian migrant experiences in the Dominican Republic, African migrant experiences in France, and Afghan migrant experiences in Greece."}
{"code": "GLBH 108S", "title": "The Indigenous Futures Lab", "units": "IFL", "anchor": "glbh101", "description": "Currently 90 percent of genome studies and 95 percent of clinical trials exclusively feature individuals of European ancestry. This bias and systematic lack of engagement of Indigenous people in both clinical trials and genome studies is partially the result of a history of distrust. Through our field school, we will train the next generation of global health professionals to imagine, promote, and sustain a future where Indigenous people are partners in and not subjects of genetic research. Program or materials fees may apply."}
{"code": "GLBH 109", "title": "Decolonizing Global Health", "units": "4", "anchor": "glbh101", "description": "This course aims to provide epistemological, theoretical, and methodological perspectives to approach global health from a decolonial stance. We will analyze the colonial legacies in global health to discuss the challenges of pursuing a change in the field. Themes to explore include the westernization of knowledge in health, decolonizing global health education, colonialism as a social determinant of health, decolonial research methodologies, and dismantling colonialism in health care systems."}
{"code": "GLBH 110", "title": "Demography and Social Networks in Global Health", "units": "4", "anchor": "glbh101", "description": "This course will provide an overview of demographic principles, and their associations with maternal and child health outcomes. We will focus on demographic trends in developing countries, using research from the DHS to discuss inequalities in fertility, mortality, and morbidity. The remainder of the class will question why we see such spatial variation in many maternal and child health outcomes, with a focus on theories of social norms, and social network methods for uncovering those trends."}
{"code": "GLBH 111", "title": "Clinic on the Border: Health Frontiers in Tijuana", "units": "4", "anchor": "glbh101", "description": "Introduces students to the physical and mental health needs of vulnerable migrants and socially marginalized communities, including substance users, LGBTQ, deportees, and the homeless and medically indigent. Students will become integrated into a free clinic in Tijuana where they will obtain community-based field experiences in interacting with these populations; learn about delivering evidence-based health care in underserved settings and be introduced to issues regarding cultural appropriation. Program or materials fees may apply. May be taken for credit up to three times. Students are required to cross the US-Mexico border to attend clinic in Tijuana as part of the requirements for the course. Recommended preparation: upper-division global health course work prior to participation is recommended."}
{"code": "GLBH 112", "title": "Medicine, Global Health, and Bioethics", "units": "4", "anchor": "glbh101", "description": "This course explores the global medical commons via current topics in medical anthropology and sociology, including learning medicine, the work of doctoring, the culture of biomedicine and the clinic, the political economy of health care, the ethics of care at the end of life, and medical rationing. We will examine how medical knowledge, ethical practice, research, and technology are culturally shaped and institutionally organized in different societies."}
{"code": "GLBH 113", "title": "Women’s Health in Global Perspective", "units": "4", "anchor": "glbh101", "description": "The course examines women’s and girls’ health throughout the world, focusing on the main health problems experienced primarily in low resource settings. This course presents issues in the context of a woman’s life from childhood, through adolescence, reproductive years, and aging. The course will have a strong emphasis on social, economic, environmental, behavioral, and political factors that affect health behaviors, reproductive health, maternal morbidity/mortality, and STIs/HIV."}
{"code": "GLBH 114", "title": "Latin American Health and Healing", "units": "4", "anchor": "glbh101", "description": "This course aims to analyze the health and healing processes in Latin America. Students will understand the social, cultural, political, and economic aspects traversing those processes. We will analyze biomedical health care systems and intercultural health practices at structural, community, and individual levels based on specific cases. Finally, alternative health care services and self-care practices will be discussed to understand health and healing experiences in specific contexts."}
{"code": "GLBH 129", "title": "Meaning and Healing", "units": "4", "anchor": "glbh101", "description": "(Cross-listed with ANSC 129.) This course examines the nature of healing across cultures, with special emphasis on religious and ritual healing. Students may not receive credit for GLBH 129 and ANSC 129."}
{"code": "GLBH 139", "title": "Native American Health and Healing", "units": "4", "anchor": "glbh101", "description": "(Cross-listed with ANSC 139.) This course examines fact and fiction with respect to epidemics of contagious diseases including smallpox and tuberculosis, alcohol and drug dependency, diabetes and obesity, depression and suicide. We analyze health care with respect to the history and development of the Indian Health Service, health care efforts by Christian missionaries, tribal-led health initiatives, indigenous spiritual healing, and collaborations between indigenous healers and biomedical professionals. Students may not receive credit for ANSC 139 and GLBH 139. ANSC 139/GLBH 139 may be coscheduled with ANTH 237/GLBH 245."}
{"code": "GLBH 141", "title": "Clinical Perspectives in Global Health", "units": "4", "anchor": "glbh101", "description": "This course aims to understand the salient aspects of global health from the point of view of the clinician who translates epidemiological knowledge into treatment approaches for their patients. The perspective of the clinician illuminates that of the patient and allows us to understand public health on the front line. The course will examine many aspects of global health from the point of view of the clinicians involved, whose perspectives will help illuminate those of their patients. May be coscheduled with GLBH 241."}
{"code": "GLBH 142", "title": "“When the field is a ward”: Ethnographies of the Clinic", "units": "4", "anchor": "glbh101", "description": "The purpose of this course is to introduce ethnography as a strategy to conduct research on clinical contexts. During the first part of the course, students will learn about the ethnographic method, and how both qualitative research and ethnography may be utilized in healthcare and medical education. The course will also examine some key limitations to these methods."}
{"code": "GLBH 143", "title": "Mental Health as Global Health Priority", "units": "4", "anchor": "glbh101", "description": "(Cross-listed with ANSC 143.) Why is mental health a global concern? This anthropological course reviews globalization, culture, and mental health. We examine issues of social suffering, stigma, and economic burden associated with mental illness, gender inequality, political violence, “global security,” and pharmaceutical and illegal drugs. May be coscheduled with ANTH 243. Students may not receive credit for both ANSC 143 and GLBH 143."}
{"code": "GLBH 146", "title": "A Global Health Perspective on HIV", "units": "4", "anchor": "glbh101", "description": "(Cross-listed with ANSC 146.) An introductory course to HIV taught through a medical student format, with emphasis on research and experiential learning, including observation of physicians providing care for patients from diverse socioeconomic and cultural backgrounds, and who may be underinsured or uninsured, homeless, and/or immigrants. Students may not receive credit for ANSC 146 and GLBH 146."}
{"code": "GLBH 147", "title": "Global Health and the Environment", "units": "4", "anchor": "glbh101", "description": "(Cross-listed with ANSC 147.) Examines interactions of culture, health, and environment. Rural and urban human ecologies, their energy foundations, sociocultural systems, and characteristic health and environmental problems are explored. The role of culture and human values in designing solutions will be investigated. Students may not receive credit for GLBH 147 and ANSC 147."}
{"code": "GLBH 148", "title": "Global Health and Cultural Diversity", "units": "4", "anchor": "glbh101", "description": "(Cross-listed with ANSC 148.) Introduction to global health from the perspective of medical anthropology on disease and illness, cultural conceptions of health, doctor-patient interaction, illness experience, medical science and technology, mental health, infectious disease, and health care inequalities by ethnicity, gender, and socioeconomic status. Students may not receive credit for GLBH 148 and ANSC 148."}
{"code": "GLBH 150", "title": "Culture and Mental Health", "units": "4", "anchor": "glbh101", "description": "(Cross-listed with ANSC 150.) This course reviews mental health cross-culturally and transnationally. Issues examined are cultural shaping of the interpretation, experience, symptoms, treatment, course, and recovery of mental illness. World Health Organization findings of better outcomes in non-European and North American countries are explored. Students may not receive credit for GLBH 150 and ANSC 150."}
{"code": "GLBH 150A", "title": "Global Health Horizons Honors Thesis Seminar I", "units": "4", "anchor": "glbh101", "description": "This course will consist of intensive reading and discussion in fields related to each student’s primary interest and building on their Global Health Field Experience that will culminate into an honors thesis. Prerequisites: department approval required."}
{"code": "GLBH 150B", "title": "Global Health Horizons Honors Thesis Seminar II", "units": "4", "anchor": "glbh101", "description": "This course will be a workshop with critical input from all participants focusing on preparing a final thesis paper. Prerequisites: GLBH 150A; department approval required.", "prereqs": "GLBH 150A"}
{"code": "GLBH 160", "title": "Global Health Policy", "units": "4", "anchor": "glbh101", "description": "Students will learn fundamental principles and concepts of global health policy, law, and governance. The course will focus on identifying critical global health policy challenges and solving them using a multidisciplinary approach that takes into account the perspectives of various stakeholders. Prerequisites: upper-division standing."}
{"code": "GLBH 171R", "title": "Global Mental Health", "units": "4", "anchor": "glbh101", "description": "Global Mental Health (GMH) is a field of research, practice, and advocacy prioritizing mental health for all persons and communities worldwide. GMH recognizes mental, neurological, or substance use disorders as the leading causes of disability worldwide and works to counteract social stigma and discrimination commonly associated with such conditions. The course introduces this interdisciplinary field based on analysis of and writing about critical sources from the relevant scholarly literature."}
{"code": "GLBH 173", "title": "Substance Use and Global Mental Health: Case Studies for Research and Praxis", "units": "4", "anchor": "glbh101", "description": "Psychoactive substance use, or drug use, is a rapidly growing global health concern. This course examines local and global case studies of substance use and its treatment through global health frameworks for social justice and health equity. Topics include the comorbidity of drug use with other mental health problems, the relationship between drug use and poverty/social inequity, the “War on Drugs,” available treatment options, and emerging technologies to aid recovery."}
{"code": "GLBH 181", "title": "Essentials of Global Health", "units": "4", "anchor": "glbh101", "description": "Illustrates and explores ecologic settings and frameworks for study and understanding of global health and international health policy. Students acquire understanding of diverse determinants and trends of disease in various settings and interrelationships between socio-cultural-economic development and health."}
{"code": "GLBH 195", "title": "Instructional Apprenticeship in Global Health", "units": "4", "anchor": "glbh101", "description": "Course gives students experience in teaching global health courses. Students, under direction of instructor, lead discussion sections, attend lectures, review course readings, and meet regularly to prepare course materials and to evaluate examinations and papers. Students will need to apply for the undergraduate instructional apprentice position through ASES, fulfill the Academic Senate regulations, and receive the approval of the department, instructor, department chair, and Academic Senate. May be taken for credit up to two times. Course cannot be used to fulfill requirements for the global health major or minor."}
{"code": "GLBH 196", "title": "Global Health and Social Justice Seminar", "units": "1", "anchor": "glbh101", "description": "Through Alternative Breaks: Public Health Program in the Center for Student Involvement, students explore aspects of the historical, political, economic, and social context of the issues surrounding access to healthcare and develop hard and soft skills needed to perform a successful public health outreach in Indonesia. May be taken for credit up to three times. Students must be accepted into the Alternative Breaks Program to enroll in the course. Prerequisites: department approval required."}
{"code": "GLBH 197", "title": "Global Health Academic Internship Program", "units": "4", "anchor": "glbh101", "description": "Offers global health students the opportunity to intern and gain credit for their global health field experience requirement. Students will intern and work with a faculty adviser to elaborate on the intellectual analysis and critique of the field experience. Students must complete the AIP application process and have the consent of a faculty adviser. May be taken for credit up to two times. Must be taken for a letter grade to fulfill requirements for the global health major or minor."}
{"code": "GLBH 198", "title": "Directed Group Study", "units": "4", "anchor": "glbh101", "description": "Directed group study for students to delve deeper into global health topics or elaborate the intellectual analysis and critique of their field experience. For students enrolled in the global health major or minor. May be taken for credit two times. Prerequisites: department approval required."}
{"code": "GLBH 199", "title": "Independent Study in Global Health Field Experience", "units": "4", "anchor": "glbh101", "description": "Independent study opportunity for students to work with global health affiliated faculty on relevant research or to elaborate the intellectual analysis and critique of their global health field experience. For students enrolled in the global health major or minor. May be taken for credit two times. Prerequisites: department approval required."}
{"code": "GLBH 200", "title": "Global Health Master’s Core Seminar", "units": "4", "anchor": "glbh101", "description": "This seminar course consists of workshops to expand on a student’s thesis project and readings synthesizing key concepts and problems in the field of global health. Students will explore career options in global health and begin work on their final portfolio, due at the end of spring quarter. Prerequisites: graduate-level standing."}
{"code": "GLBH 201", "title": "Special Topics in Global Health", "units": "4", "anchor": "glbh101", "description": "Selected topics in global health. Content will vary from quarter to quarter. May be taken for credit up to two times. May be coscheduled with GLBH 100. Prerequisites: graduate-level standing."}
{"code": "GLBH 202", "title": "Global Health Epidemiology", "units": "4", "anchor": "glbh101", "description": "This course will address basic epidemiology principles, concepts, and procedures that are used in the investigation of health-related states or events from a global perspective. Explores study designs and methods appropriate for studies of incidence and prevalence, causality and prevention, with emphasis on research in resource-poor settings. May be coscheduled with GLBH 102. Prerequisites: graduate-level standing or department approval required."}
{"code": "GLBH 211", "title": "Clinic on the Border: Health Frontiers in Tijuana", "units": "4", "anchor": "glbh101", "description": "Introduces students to the physical and mental health needs of vulnerable migrants and socially marginalized communities, including substance users, LGBTQ, deportees, and the homeless and medically indigent. Students will become integrated into a free clinic in Tijuana where they will obtain community-based field experiences in interacting with these populations; learn about delivering evidence-based health care in underserved settings; and be introduced to issues regarding cultural appropriation. Program or materials fees may apply. May be taken for credit up to three times. Students are required to cross US-Mexico border to attend clinic in Tijuana as part of the requirements for the course. May be coscheduled with GLBH 111. Prerequisites: Students must apply to participate in the program quarterly."}
{"code": "GLBH 212", "title": "“Experiencing Epidemics”: Anthropologies of Infectious Diseases", "units": "4", "anchor": "glbh101", "description": "This course aims to discuss infectious diseases as a dynamic field of study, fruitful for global health research because it allows us to observe the interplay between power, social structures, and cultural practices that orient people’s discourses and behaviors. Students will study how this imbricate set of relations configure social categories that both “socialize” epidemics and “naturalize” social relations played out through categories such as race, ethnicity, and class. Prerequisites: graduate-level standing."}
{"code": "GLBH 213", "title": "Global Health Program Design and Evaluation", "units": "4", "anchor": "glbh101", "description": "This seminar examines program development focused on designing logic models and monitoring and evaluation (M&E) plans from problem identification to proposal review. Students work on a common case through in-class presentations and develop a project based on their own interests. Prerequisites: department approval required, graduate-level standing."}
{"code": "GLBH 214", "title": "Program Management in Global Health", "units": "4", "anchor": "glbh101", "description": "This seminar examines program development, capacity strengthening, and strategic analysis in global health through reading, discussion, project work, and presentation. Students will adapt global health theory and demonstrate the use of practical project management tools and techniques as they design a culturally sensitive global health program. Restricted to students in the MA in global health program."}
{"code": "GLBH 215", "title": "Community Health Workers", "units": "4", "anchor": "glbh101", "description": "Community health workers (CHWs)—people from the community in which they are working, who receive training on the job—are a cornerstone of health programs around the world, including in the U.S. Topics that will be explored include the history and range of work done by CHWs, task shifting, professionalization, hierarchy and knowledge, and cultural and structural competency. The course will draw on a variety of case studies, including CHW programs in San Diego and Southern California. Prerequisites: graduate level standing."}
{"code": "GLBH 241", "title": "Clinical Perspectives in Global Health", "units": "4", "anchor": "glbh101", "description": "This course aims to understand the salient aspects of global health from the point of view of the clinician who translates epidemiological knowledge into treatment approaches for their patients. The perspective of the clinician illuminates that of the patient and allows us to understand public health on the front line. We will examine many aspects of global health from the point of view of the clinicians involved, whose perspectives will help illuminate those of their patients. May be coscheduled with GLBH 141. Restricted to students in the MA in global health program. Prerequisites: graduate-level standing."}
{"code": "GLBH 245", "title": "Native American Health and Healing", "units": "4", "anchor": "glbh101", "description": "This course examines fact and fiction with respect to epidemics of contagious diseases including smallpox and tuberculosis, alcohol and drug dependency, diabetes and obesity, and depression and suicide. We analyze health care with respect to the history and development of the Indian Health Service, health care efforts by Christian missionaries, tribal-led health initiatives, indigenous spiritual healing, and collaborations between indigenous healers and biomedical professionals. Prerequisites: graduate-level standing."}
{"code": "GLBH 248", "title": "Introduction to Global Health Research", "units": "4", "anchor": "glbh101", "description": "Students will gain competency in common research methods and be introduced to implementation challenges in global health. Students will critically evaluate the impact of sociocultural factors on health disparities. This knowledge can be applied toward future research experiences and career development. Restricted to students in the MA in global health program."}
{"code": "GLBH 249", "title": "Special Epidemiology", "units": "4", "anchor": "glbh101", "description": "This course provides an overview of social epidemiology, a branch of epidemiology that focuses on the study of how health-related states or events are impacted by social, political, cultural, and economic factors. Students will learn about the history and current state of the science of social epidemiology, its leading theories/paradigms and methods, and distinct core areas of research. Prerequisites: graduate-level standing."}
{"code": "GLBH 260", "title": "Global Health Policy", "units": "4", "anchor": "glbh101", "description": "Students will learn fundamental principles and concepts of global health policy, law, and governance. The course will focus on identifying critical global health policy challenges and solving them using a multidisciplinary approach that takes into account the perspectives of various stakeholders. May be coscheduled with GLBH 160. Prerequisites: graduate-level standing."}
{"code": "GLBH 261", "title": "Global Health Policy, Diplomacy, and Advocacy", "units": "4", "anchor": "glbh101", "description": "Students will explore the application of global health policy, governance, and law principles to the practice of global health through case studies and interactive debate simulations. The course will include a series of special and advanced topics in global health, including health migration, funding and innovation for infectious and chronic diseases, disease surveillance, fake medicines, and global health governance reform. Prerequisites: GLBH 260.", "prereqs": "GLBH 260"}
{"code": "GLBH 274", "title": "Global Mental Health", "units": "4", "anchor": "glbh101", "description": "(Cross-listed with ANTH 276.) This course will examine core topics in global mental health research and practice, including cross-cultural classification of mental illness, stigma, and intervention. It combines anthropological perspectives alongside cross-cultural psychiatry, epidemiology, humanities, and global public health. The course highlights mixed-method approaches to research, intervention design, and evaluation. The seminar includes a combination of interactive lectures, discussion, and hands-on activities."}
{"code": "GLBH 281", "title": "Essentials of Global Health", "units": "4", "anchor": "glbh101", "description": "This course provides an overview of global health as a field of research and practice, with an emphasis on use of surveillance and research methods to understand health and determinants of health, evidence-based program development and evaluation of programs in the field, and engagement with governments and advocacy groups to elicit evidence-based policy change. Topics of focus will prioritize infectious diseases, maternal child health, substance use, and gender-based violence. May be coscheduled with GLBH 181. Prerequisites: graduate level standing."}
{"code": "GLBH 297", "title": "Global Health Internship", "units": "4", "anchor": "glbh101", "description": "Offers global health master’s students the opportunity to intern and gain credit for their global health field work. Students will intern and work with a faculty adviser to elaborate on the intellectual analysis and critique of the field experience. May be taken for credit up to three times. Prerequisites: students must complete Special Studies paperwork, have a faculty adviser, and receive department approval."}
{"code": "GLBH 298", "title": "Directed Study", "units": "2–12", "anchor": "glbh101", "description": "Supervised study and readings of topics in global health literature. May be taken for credit up to four times for a maximum of sixteen units. Prerequisites: graduate-level standing. Students must receive approval from the program to enroll with a faculty member in a directed study course."}
{"code": "GLBH 299", "title": "Independent Research", "units": "2–12", "anchor": "glbh101", "description": "Mentored course in which students will work closely with a faculty adviser to prepare a publishable masters project based on their undergraduate senior thesis or project agreed upon with faculty adviser. May be taken for credit up to twelve times for a maximum of forty-eight units. Prerequisites: graduate-level standing. Students must receive approval from the program to enroll with a faculty member in an independent research course."}
{"code": "GLBH 500", "title": "Teaching Apprenticeship", "units": "1–4", "anchor": "glbh101", "description": "The course is designed for students to participate in the undergraduate teaching program as a teaching assistant. Student will assist in preparing materials, grading, discussions, and office hours. May be taken for credit six times. Prerequisites: graduate-level standing. Department approval required; students must be a TA for the global health program to enroll."}
