{"code": "GSS", "name": "Global South Studies", "link": "https://catalog.ucsd.edu/courses/GSS.html"}
{"code": "GSS 20", "title": "Introduction to Global South Studies", "units": "4", "anchor": "gss20", "description": "This introductory course examines historical and theoretical debates on the Global South. Especially important are socioeconomic, political, as well as cultural processes, as they are key factors to understanding the Global South across the globe."}
{"code": "GSS 21-22-23-24-25-26", "title": ". Literatures of the Global South", "units": "4-4-4-4-4-4", "anchor": "tws26", "description": "An introduction to the cultures of various regions of the Global South through close reading of selected literary texts. GSS 21 focuses on African literature, GSS 22 deals with Latin American literature, GSS 23 examines Chinese literature, GSS 24 examines Caribbean literature, GSS 25 focuses on Middle Eastern literature, and GSS 26 treats literature of the Indian Subcontinent. Topics will vary each quarter. (F,W,S)"}
{"code": "GSS 132", "title": "Literature and Global South Societies", "units": "4", "anchor": "tws132", "description": "This course will investigate novelistic and dramatic treatments of European society in the era of nineteenth-century imperialism, Global South societies under the impact of colonialism, and the position of national minorities inside the United States to the present day. Attention will center on the interplay between the aesthetic merits and social-historical-philosophical content of the works read."}
{"code": "GSS 190", "title": "Undergraduate Seminars", "units": "4", "anchor": "tws190", "description": "Seminars will be organized on the basis of topics with readings, discussions, and papers. Specific subjects to be covered will change each quarter depending on particular interest of instructors or students. May be repeated for credit."}
{"code": "GSS 197", "title": "Fieldwork", "units": "4", "anchor": "tws197", "description": "In an attempt to explore and study some unique processes and aspects of community life, students will engage in research in field settings. Topics to be researched may vary, but in each case the course will provide skills for carrying out these studies."}
{"code": "GSS 198", "title": "Directed Group Studies", "units": "2 or 4", "anchor": "tws198", "description": "Directed group study on a topic or in a field not included in the regular department curriculum, by special arrangement with a faculty member. Prerequisites: upper-division standing."}
{"code": "GSS 199", "title": "Independent Study", "units": "2 or 4", "anchor": "tws199", "description": "Tutorial, individual guided reading and research projects (to be arranged between student and instructor) in an area not normally covered in courses currently being offered in the department. (P/NP grades only.) Prerequisites: upper-division standing and consent of instructor. (F,W,S)"}
