{"code": "JAPN", "name": "Japanese Studies", "link": "https://catalog.ucsd.edu/courses/JAPN.html"}
{"code": "JAPN 190", "title": "Selected Topics in Contemporary Japanese Studies", "units": "?", "anchor": "japn190", "description": "Students who have prior preparation of Japanese language are placed in language courses based on the results of a placement test and an oral interview with an instructor. Students who have lived in Japan and/or speak Japanese at home are required to take a placement exam administered prior to the beginning of the fall quarter. Contact the Japanese Studies office for more information."}
{"code": "JAPN 10A", "title": "First-Year Japanese", "units": "5", "anchor": "japn10a", "description": "This course is an introduction to the Japanese language. Students will learn basic skills of listening, speaking, reading, and writing over seventy-five characters. Students will also acquire fundamental knowledge of Japanese grammar and learn about Japanese people and culture."}
{"code": "JAPN 10B", "title": "First-Year Japanese", "units": "5", "anchor": "japn10b", "description": "This course is an introduction to the Japanese language. Students will learn basic skills of listening, speaking, reading, and writing over seventy-two additional characters. Students will also acquire fundamental knowledge of Japanese grammar and learn about Japanese people and culture. Prerequisites: previous course or consent of instructor."}
{"code": "JAPN 10C", "title": "First-Year Japanese", "units": "5", "anchor": "japn10c", "description": "This course is an introduction to the Japanese language. Students will learn basic skills of listening, speaking, reading, and writing over forty-eight additional characters. Students will also acquire fundamental knowledge of Japanese grammar and learn about Japanese people and culture. Prerequisites: previous course or consent of instructor."}
{"code": "JAPN 20A", "title": "Second-Year Japanese", "units": "5", "anchor": "japn20a", "description": "Students will improve their fundamental skills in listening, speaking, reading, and writing including acquiring knowledge of Japanese transportation, trips, and geography. Prerequisites: previous course or consent of instructor."}
{"code": "JAPN 20B", "title": "Second-Year Japanese", "units": "5", "anchor": "japn20b", "description": "Students will improve their fundamental skills in listening, speaking, reading, and writing including acquiring knowledge of life experiences, Japanese culture, customs, health, and school. Prerequisites: previous course or consent of instructor."}
{"code": "JAPN 20C", "title": "Second-Year Japanese", "units": "5", "anchor": "japn20c", "description": "Students will improve their fundamental skills in listening, speaking, reading, and writing including acquiring knowledge of Japanese culture and customs. Students will conduct research including writing a short essay and presentation. Prerequisites: previous course or consent of instructor."}
{"code": "JAPN 130A", "title": "Third-Year Japanese", "units": "5", "anchor": "japn130a", "description": "This course will require students to gain knowledge, comprehend, evaluate, and discuss Japanese customs. Students will critically analyze and compare culture and customs of Japan and other countries. Course work includes student research on issues in Japanese society. Prerequisites: previous course or consent of instructor."}
{"code": "JAPN 130B", "title": "Third-Year Japanese", "units": "5", "anchor": "japn130b", "description": "This course will require students to gain knowledge, comprehend, evaluate, and discuss topics of education system and youth issues in Japan and other countries. Students will learn vocabulary and phrases to support, explain, research, and hypothesize concrete and abstract topics. Prerequisites: previous course or consent of instructor."}
{"code": "JAPN 130C", "title": "Third-Year Japanese", "units": "5", "anchor": "japn130c", "description": "This course will require students to gain knowledge, comprehend, evaluate, and discuss the environment and internationalization issues. Students will learn vocabulary and phrases to critically analyze and compare, express their opinions, and present and propose possible solutions for these topics. Prerequisites: previous course or consent of instructor."}
{"code": "JAPN 135A", "title": "Japanese for Professional Purposes", "units": "4", "anchor": "japn135a", "description": "Training in oral and written communication skills for professional settings in Japanese. Broad aspects of cultural issues in Japanese organizations are introduced and comparison of American and Japanese cultural business patterns will be conducted. Prerequisites: JAPN 20C, or consent of instructor.", "prereqs": "JAPN 20C"}
{"code": "JAPN 135B", "title": "Japanese for Professional Purposes", "units": "4", "anchor": "japn135b", "description": "Continuation of training in oral and written communication skills for professional settings in Japanese. Broad aspects of cultural issues in Japanese organizations are introduced and comparison of American and Japanese cultural business patterns will be conducted. Prerequisites: JAPN 135A, or consent of instructor.", "prereqs": "JAPN 135A"}
{"code": "JAPN 135C", "title": "Japanese for Professional Purposes", "units": "4", "anchor": "japn135c", "description": "Continuation of training in oral and written communication skills for professional settings in Japanese. Broad aspects of cultural issues in Japanese organizations are introduced and comparison of American and Japanese cultural business patterns will be conducted. Prerequisites: JAPN 135B.", "prereqs": "JAPN 135B"}
{"code": "JAPN 140A-B-C", "title": ". Fourth-Year Japanese", "units": "4-4-4", "description": "Prerequisites: previous course or consent of instructor."}
{"code": "JAPN 150A-B-C", "title": ". Advanced Japanese", "units": "4-4-4", "anchor": "japn150a", "description": "This course is for advanced-level Japanese language learners. Students will train to further develop their academic language skills through various discussion topics such as social, cultural, and political issues. Prerequisites: previous course or consent of instructor."}
