{"code": "JWSP", "name": "Jewish Studies", "link": "https://catalog.ucsd.edu/courses/JWSP.html"}
{"code": "JWSP 1", "title": "Beginning Hebrew", "units": "5", "anchor": "jwsp1", "description": "Acquisition of basic vocabulary, fundamentals of Hebrew grammar, conversation, and reading."}
{"code": "JWSP 2", "title": "Intermediate Hebrew", "units": "5", "anchor": "jwsp2", "description": "Continued study of vocabulary and grammar, emphasis on fluency in conversation, and reading."}
{"code": "JWSP 3", "title": "Intermediate Hebrew, Continued", "units": "5", "anchor": "jwsp3", "description": "Vocabulary, grammar, conversation, introduction to literary and nonliterary texts."}
{"code": "JWSP 87", "title": "First-year Student Seminar", "units": "1", "anchor": "jwsp87", "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students. P/NP grades only. May be taken for credit four times. Seminars are open to sophomores, juniors, and seniors on a space available basis."}
{"code": "JWSP 101", "title": "Introduction to Hebrew Texts", "units": "4", "anchor": "jwsp101", "description": "Reading and analysis of texts from Biblical through modern authors, study of advanced vocabulary and grammar. Course taught in Hebrew and in English."}
{"code": "JWSP 102", "title": "Intermediate Hebrew Texts", "units": "4", "anchor": "jwsp102", "description": "Further reading and analysis of Hebrew literature from a range of periods. Advanced grammar and vocabulary. Course taught in Hebrew and in English."}
{"code": "JWSP 103", "title": "Advanced Hebrew Texts", "units": "4", "anchor": "jwsp103", "description": "Synthesis of fluency, reading, and grammatical skills. Reading of texts from a range of periods."}
{"code": "JWSP 104", "title": "Practicum in Advanced Hebrew", "units": "4", "anchor": "jwsp104", "description": "Students will read texts and/or view films on a particular topic (topics will rotate on a four-year cycle) in the original Hebrew. Students will build skills in translating from Hebrew to English, in advanced grammar, and will cover a topic related to either modern Israel or pre-1948 Hebrew language literature and thought. The Hebrew lecturer will accommodate students with a basic knowledge of Hebrew, and will offer supplementary assignments for advanced students."}
{"code": "JWSP 110", "title": "Introduction to Judaism", "units": "4", "anchor": "jwsp110", "description": "An introductory survey of Jewish history, literature, and culture from antiquity to contemporary times. Topics include sacred texts; the variety of groups and views of Judaism; the historical and geographical movements of the Jewish people; and the intersection of religion, ethnicity, and culture."}
{"code": "JWSP 111", "title": "Topics in Judaic Studies", "units": "4", "anchor": "jwsp111", "description": "Study of a particular period, theme, or literature in Jewish civilization. May be taken for credit three times. Prerequisites: upper-division standing or consent of instructor."}
{"code": "JWSP 130", "title": "Introduction to the Old Testament: The Historical Books", "units": "4", "anchor": "jwsp130", "description": "This course will study the historical books of the Hebrew Bible (in English), Genesis through 2 Kings, through a literary-historical approach: how, when, and why the Hebrew Bible came to be written down, its relationship with known historical facts, and the archaeological record. Prerequisites: upper-division standing or consent of instructor."}
{"code": "JWSP 131", "title": "Introduction to the Old Testament: The Poetic Books", "units": "4", "anchor": "jwsp131", "description": "This course will study the prophetic and poetic books of the Hebrew Bible (in English), through a literary-historical approach. Topics include prophecy, social justice, monotheism, suffering, humor, and love. Prerequisites: JWSP 100A; upper-division standing or consent of instructor.", "prereqs": "JWSP 100A"}
{"code": "JWSP 196A", "title": "Jewish Studies Honors Course", "units": "4", "anchor": "jwsp196a", "description": "First quarter of honors thesis research for students accepted into honors program. Research is conducted under the supervision of a faculty member selected with the approval of the director of the Jewish Studies Program. Prerequisites: admission to Jewish Studies Honors Program; JWSP 100, JWSP103, HITO 104, HITO 105; upper-division electives in Jewish studies; at least junior standing; overall 3.3 GPA; 3.5 in Jewish studies.", "prereqs": {"type": "all", "courses": ["JWSP 100", "HITO 104", "HITO 105"]}}
{"code": "JWSP 196B", "title": "Jewish Studies Honors Course", "units": "4", "anchor": "jwsp196b", "description": "Second quarter of honors thesis research for students accepted into honors program. Research is conducted under the supervision of a faculty member selected with the approval of the director of the Jewish Studies Program. Prerequisites: admission to Jewish Studies Honors Program; previous enrollment in JWSP 196A; JWSP 100, JWSP 103, HITO 104, HITO 105; upper-division electives in Jewish studies; at least junior standing; overall 3.3 GPA; 3.5 in Jewish studies.", "prereqs": {"type": "all", "courses": ["JWSP 196A", "JWSP 100", "JWSP 103", "HITO 104", "HITO 105"]}}
{"code": "JWSP 198", "title": "Directed Group Study in Jewish Studies", "units": "1-4", "anchor": "jwsp198", "description": "Directed group study on a topic not generally included in the regular curriculum. Student must make arrangements with individual faculty members. (P/NP only)"}
{"code": "JWSP 199", "title": "Independent Study in Jewish Studies", "units": "1-4", "anchor": "jwsp199", "description": "Independent study on a topic not generally included in the regular curriculum. Student must make arrangements with individual faculty members. (P/NP only)"}
