{"code": "MAS", "name": "Master of Advanced Studies", "link": "https://catalog.ucsd.edu/courses/MAS.html"}
{"code": "AESE 241", "title": "Decision and Risk Analysis", "units": "4", "anchor": "aese241", "description": "Focuses on analytic techniques supporting rational business decision-making, providing systematic approaches to complex decision situations. Addresses analysis of conflicting objectives and use of tools such as value trees, decision trees, influence diagrams, and value hierarchies, Bayesian networks, and data mining. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday. Prerequisites: enrollment in MAS-AESE, or permission of the instructor. AESE 241 is cross-listed with MGT 241."}
{"code": "AESE 261", "title": "Managing Stakeholder Relationships", "units": "4", "anchor": "aese261", "description": "Addresses critical processes and frameworks required to build effective business relationships internally and externally. Focuses on the skills required by functional or technical leaders to envision strategic value and create business development strategies aligned with organizational needs. This workshop meets once a quarter from Wednesday to Saturday from 8:00 a.m. to 5:00 p.m. for more intensive interaction. Prerequisites: enrollment in MAS-AESE, MGT 406, or permission of the instructor. AESE 261 is cross-listed with MGT 261.", "prereqs": "MGT 406"}
{"code": "AESE 278A", "title": "Complexity and Large-Scale Systems", "units": "4", "anchor": "aese278a", "description": "Comprehensive introduction to system and event complexity, software and systems engineering practices for complexity management, agile and plan-driven development, development and management processes and process models, data, information, and knowledge management, basics of distributed data and computation. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday. Prerequisites: enrollment in MAS-AESE or instructor approval. AESE 278A is cross-listed with CSE 278A, ECE 205A, and MAE 277A."}
{"code": "AESE 278B", "title": "Enterprise Architecting", "units": "4", "anchor": "aese278b", "description": "Architectural foundations, frameworks, standards, and infrastructures with an emphasis on layered architectures, loose coupling, architecture evolution, service- and component-oriented architectures, enterprise service buses, metadata and information virtualization, ontologies, Semantic Web, policy and governance, service-level agreements, information assurance essentials. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday. Prerequisites: enrollment in MAS-AESE, MGT 291, MGT 406, and AESE 278A or MAE 277A or ECE 205 or CSE 278A, or instructor approval.", "prereqs": {"type": "all", "courses": ["MGT 291", "MGT 406", {"type": "one", "courses": ["AESE 278A", "MAE 277A", "ECE 205", "CSE 278A"]}]}}
{"code": "AESE 278C", "title": "Modeling, Simulation, and Analysis", "units": "4", "anchor": "aese278c", "description": "Model-driven architecture and development concepts, business process and workflow modeling, structured analysis and IDEF modeling methods, object-, component- and service-orientation and the Unified Modeling Language, event and stream models, colored Petri nets, executable architectures, distributed simulation for performance analysis. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday. Prerequisites: enrollment in MAS-AESE, MGT 291, AESE 278A-B, or instructor approval. AESE 278C is cross-listed with CSE 278C, ECE 206, and MAE 278A.", "prereqs": {"type": "all", "courses": ["MGT 291", "AESE 278A", "AESE 278B"]}}
{"code": "AESE 278D", "title": "Engineering Essentials for Open, Distributed Systems", "units": "4", "anchor": "aese278d", "description": "Engineering tools and their use in defining the layered and service-oriented architectures, Unified Modeling Language and enterprise architecture tools, business and process modeling tools, visualization methods, data and information management tools, comprehensive domain modeling, architecture implementation via enterprise service buses. This workshop course meets once a quarter from Wednesday to Saturday from 8:00 a.m. to 5:00 p.m. for more intensive interaction. Prerequisites: enrollment in MAS-AESE, AESE 278A (or CSE 278A or ECE 205A or MAE 277A), AESE 278C (or CSE 278C or ECE 206 or MAE 278A), or instructor approval.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["AESE 278A", "CSE 278A", "ECE 205A", "MAE 277A"]}, {"type": "one", "courses": ["AESE 278C", "CSE 278C", "ECE 206", "MAE 278A"]}]}}
{"code": "AESE 278E", "title": "Patterns for Enterprise Architecting", "units": "4", "anchor": "aese278e", "description": "Fundamental aspects of pattern methodologies and reuse, requirements, design and architecture patterns, patterns for service-oriented architectures, enterprise application and integration patterns, e-business patterns, event-driven architectures and patterns for complex event processing, process patterns, architecture evolution and refactoring using patterns. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday. Prerequisites: enrollment in MAS-AESE, AESE 278B-C-D, or instructor approval.", "prereqs": {"type": "all", "courses": ["AESE 278B", "AESE 278C", "AESE 278D"]}}
{"code": "AESE 279A", "title": "Architecture-based Enterprise Systems Engineering Quarterly Team Project", "units": "1", "anchor": "aese279a", "description": "Students will work collaboratively on a team project, mostly in a lab setting, to demonstrate their knowledge of leadership teams and enterprise architecting for complex systems. Students are required to take three instances of AESE 279A before they can take AESE 279B (the final for the team project). Prerequisites: enrollment in MAS-AESE."}
{"code": "AESE 279B", "title": "Architecture-based Enterprise Systems Engineering Capstone Team Project", "units": "3", "anchor": "aese279b", "description": "Students will work collaboratively on a team project, mostly in a lab setting, to demonstrate their grasp of the material in the entire project sequence. Prerequisites: enrollment in MAS-AESE; three instances of AESE 279A successfully completed prior to this class; department approval required.", "prereqs": "AESE 279A"}
{"code": "DSE 200", "title": "Python for Data Analysis", "units": "4", "anchor": "dse200", "description": "The goal of this course is to bring students with diverse backgrounds and experience to a common level of competency in programming in the context of complex and noisy data. Solid competency in Python programming provides its owner with autonomy and independence in their work. Introduction to object-oriented programming using Python. Regular expressions. NumPy and numerical processing. IPython and plotting. Data analysis using PANDAS. Web page scraping using Scrapy. The Twitter API. NLTK."}
{"code": "DSE 201", "title": "Database Management Systems", "units": "4", "anchor": "dse201", "description": "This course will provide an introduction to the management of structured data beginning with an introduction to database models including relational, hierarchical, and network approaches. It will also cover topics in database system implementation including query languages and system architectures; parallel, column-oriented, and array-based database systems; advanced SQL features including user-defined functions (UDFs), triggers, statistical functions; and support for spatial data."}
{"code": "DSE 203", "title": "Data Integration and ETL", "units": "4", "anchor": "dse203", "description": "The course is designed to provide students with the fundamentals of data integration and includes schema mapping and matching, entity disambiguation, ontology development and management, data provenance, and crowd sourcing and machine learning as strategies for integration. The course will also require hands-on projects in which students will work on a data integration problem requiring integration of two or more datasets taken from an application domain of their choice (e.g., geospatial data, healthcare, financial applications, bioinformatics, etc.)."}
{"code": "DSE 210", "title": "Statistics and Probability Using Python", "units": "4", "anchor": "dse210", "description": "Probability and statistics for data science. Distribution over the real line; independence, expectation, variance, correlation. Central limit theorem. Chernoff/Hoeffding bound. Statistical tests. Bonferroni correction."}
{"code": "DSE 220", "title": "Machine Learning", "units": "4", "anchor": "dse220", "description": "This course provides a broad introduction to the practical side of machine learning and data analysis. The topics covered in this class include topics in supervised learning, such as k-nearest neighbor classifiers, decision trees, boosting and perceptrons, and topics in unsupervised learning, such as k-means, PCA, and Gaussian mixture models."}
{"code": "DSE 230", "title": "Scalable Data Analysis", "units": "4", "anchor": "dse230", "description": "The course exercises the data scientist’s scalability toolbox, covering such concepts as map-reduce, streaming analysis, external memory algorithms, as well as their implementation options in popular frameworks (e.g., Hadoop and its ecosystem: HBase, Hive, Pig and Spark, etc.). The class will include assignments of analyzing large existing databases."}
{"code": "DSE 241", "title": "Data Visualization", "units": "4", "anchor": "dse241", "description": "The goal for the course is to use visualization as a tool to explore trends, relationships, confirm hypotheses, communicate findings, and gain insight about data. This course will focus on teaching students the principles and techniques for creating visual representation from raw data. The course exercises will be based on publicly available datasets and utilize freely available tools like D3.js and VisIt. The course will be modeled similar to Stanford’s visualization CS 448 course and will include an introduction to visualization, vis foundation review, color, interaction, dashboards and heat maps, introduction to D3.js, high dimensional data, network data, geographic data, text data, scientific visualization: isosurface, volume rendering, and introduction to VisIt."}
{"code": "DSE 250", "title": "Beyond Relational Data Models", "units": "4", "anchor": "dse250", "description": "The course covers data models, query languages, and models of computation beyond those employed in relational databases. It addresses new developments that have gained attention with the advent of the Web 2.0 and big data revolutions. The topics are presented in a unifying framework and include key-value pairs as data model, as used in Google’s Bigtable; object-oriented data model, with its practical support in relational databases via the object-relational mapping (involves ODMG standards ODL and OQL, and recent systems such as Ruby on Rails); semi-structured databases (data organized as graph with labels on nodes and edges), query languages based on reachability constraints between nodes: conjunctive regular path queries); XML databases, as special case of semi-structured databases in which the graph is a tree (this involves associated standards such as XML Schema, XPath, and XQuery); RDF databases (with associated OWL and SPARQL standard."}
{"code": "DSE 290", "title": "Case Studies in Data Science", "units": "2", "anchor": "dse290", "description": "Case studies discussed by speakers from industry, government, and academia expose students to the needs and uses of different technologies and their roles in model building."}
{"code": "DSE 260", "title": "Data Science Capstone Design Project", "units": "4", "anchor": "dse260", "description": "A team design project in the final two quarters of the program culminates in a final report and an oral presentation of the capstone project. In addition, there might be a demonstration of the working prototype. The project will start by identifying a domain of interest and the available data sources that will be used to study the domain. From this starting point there will be two parallel and interdependent lines of work: data extraction, Transformation and Loading (ETL), and statistical analysis and model building. The ultimate goal will be to present a processing pipeline which transforms the raw data into more usable forms and models which separates between the predictable and the unpredictable aspects of the underlying system. Examples of previous capstone projects can be found here."}
{"code": "WES 237A", "title": "Introduction to Embedded Systems Design", "units": "4", "anchor": "wes237a", "description": "Embedded system technologies including processors, DSP, memory, and software. System interfacing basics, communication strategies, sensors, and actuators. Mobile and wireless technology in embedded systems. Design case studies in wireless, multimedia, and/or networking domains."}
{"code": "WES 237B", "title": "Software for Embedded Systems", "units": "4", "anchor": "wes237b", "description": "Embedded computing elements, device interfaces, time-critical I/O handling. Embedded software design under size, performance, and reliability constraints. Software timing and functional validation. Programming methods and compilation for embeddable software. Embedded runtime systems. Case studies of real-time software systems."}
{"code": "WES 237C", "title": "Hardware for Embedded Systems", "units": "4", "anchor": "wes237c", "description": "Embedded system building blocks including IP cores, hardware synthesis, optimizations for size, power, energy, and throughput, FPGA and ASIC design flows, formal verification and testing, device interfaces, I/O handling."}
{"code": "WES 265", "title": "Wireless Communications Circuits and Systems", "units": "4", "anchor": "wes265", "description": "Introduction to noise and linearity concepts. System budgeting for optimum dynamic range. Frequency planning. Linearity analysis techniques. Down-conversion and up-conversion techniques. Modulation and de-modulation. Microwave and RF system design communications. Current research topics in the field."}
{"code": "WES 267", "title": "Digital Signal Processing for Wireless Embedded Systems", "units": "4", "anchor": "wes267", "description": "Review of discrete-time systems and signals, discrete-time Fourier transform and its properties, the fast Fourier transform, design of finite impulse response (FIR) and infinite impulse response (IIR) filters, implementation of digital filters. Sampling and quantization of baseband signals; A/D and D/A conversion, quantization noise, oversampling and noise shaping."}
{"code": "WES 268A", "title": "Digital Communications Systems I", "units": "4", "anchor": "wes268a", "description": "Experiments in the modulation and demodulation of baseband and pass-band signals. Statistical characterization of signals and impairments."}
{"code": "WES 268B", "title": "Digital Communications Systems II", "units": "4", "anchor": "wes268b", "description": "Advanced projects in communication systems. Students will plan and implement design projects in the laboratory, updating progress weekly and making plan/design adjustments based upon feedback."}
{"code": "WES 269", "title": "Codesign of Hardware and Software", "units": "4", "anchor": "wes269", "description": "Advanced projects in the codesign of software/hardware for a wireless embedded system. Students will design and simulate both hardware and software of a wireless embedded system, with special attention to the hardware/software interfaces. Specific case studies will include the design of a media access control layer in hardware/software. Advanced topics will include the cooptimization and covalidation of software and hardware for a general wireless embedded system."}
{"code": "WES 207", "title": "Capstone Project: Wireless Embedded Systems", "units": "4", "anchor": "wes207", "description": "Small teams will demonstrate their critical thinking, organization, and design skills in attacking a problem within the WES field. The groups may approach this project as consultants hired to develop a new type of embedded wireless device for a specific application. They may be responsible for designing the device and implementing a working prototype."}
