{"code": "MATH", "name": "Mathematics", "link": "https://catalog.ucsd.edu/courses/MATH.html"}
{"code": "MATH 2", "title": "Introduction to College Mathematics", "units": "4", "anchor": "math2", "description": "A highly adaptive course designed to build on students’ strengths while increasing overall mathematical understanding and skill. This multimodality course will focus on several topics of study designed to develop conceptual understanding and mathematical relevance: linear relationships; exponents and polynomials; rational expressions and equations; models of quadratic and polynomial functions and radical equations; exponential and logarithmic functions; and geometry and trigonometry. Workload credit only—not for baccalaureate credit. Prerequisites: Math Placement Exam qualifying score."}
{"code": "MATH 3C", "title": "Precalculus", "units": "4", "anchor": "math3c", "description": "Functions and their graphs. Linear and polynomial functions, zeroes, inverse functions, exponential and logarithmic, trigonometric functions and their inverses. Emphasis on understanding algebraic, numerical and graphical approaches making use of graphing calculators. (No credit given if taken after MATH 4C, 1A/10A, or 2A/20A.) Three or more years of high school mathematics or equivalent recommended. Prerequisites: Math Placement Exam qualifying score, or ACT Math score of 22 or higher, or SAT Math score of 600 or higher."}
{"code": "MATH 4C", "title": "Precalculus for Science and Engineering", "units": "4", "anchor": "math4c", "description": "Review of polynomials. Graphing functions and relations: graphing rational functions, effects of linear changes of coordinates. Circular functions and right triangle trigonometry. Reinforcement of function concept: exponential, logarithmic, and trigonometric functions. Vectors. Conic sections. Polar coordinates. (No credit given if taken after MATH 1A/10A or 2A/20A. Two units of credit given if taken after MATH 3C.) Three or more years of high school mathematics or equivalent recommended. Prerequisites: Math Placement Exam qualifying score, or MATH 3C, or ACT Math score of 25 or higher, or AP Calculus AB score (or subscore) of 2.", "prereqs": "MATH 3C"}
{"code": "MATH 10A", "title": "Calculus I", "units": "4", "anchor": "math10a", "description": "Differential calculus of functions of one variable, with applications. Functions, graphs, continuity, limits, derivatives, tangent lines, optimization problems. (No credit given if taken after or concurrent with MATH 20A.) Prerequisites: Math Placement Exam qualifying score, or AP Calculus AB score of 2, or SAT II Math Level 2 score of 600 or higher, or MATH 3C, or MATH 4C.", "prereqs": {"type": "one", "courses": ["MATH 3C", "MATH 4C"]}}
{"code": "MATH 10B", "title": "Calculus II", "units": "4", "anchor": "math10b", "description": "Integral calculus of functions of one variable, with applications. Antiderivatives, definite integrals, the Fundamental Theorem of Calculus, methods of integration, areas and volumes, separable differential equations. (No credit given if taken after or concurrent with MATH 20B.) Prerequisites: AP Calculus AB score of 3, 4, or 5 (or equivalent AB subscore on BC exam), or MATH 10A, or MATH 20A.", "prereqs": {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}}
{"code": "MATH 10C", "title": "Calculus III", "units": "4", "anchor": "math10c", "description": "Introduction to functions of more than one variable. Vector geometry, partial derivatives, velocity and acceleration vectors, optimization problems. (No credit given if taken after or concurrent with 20C.) Prerequisites: AP Calculus BC score of 3, 4, or 5, or MATH 10B, or MATH 20B.", "prereqs": {"type": "one", "courses": ["MATH 10B", "MATH 20B"]}}
{"code": "MATH 11", "title": "Calculus-Based Introductory Probability and Statistics", "units": "5", "anchor": "math11", "description": "Events and probabilities, conditional probability, Bayes’ formula. Discrete and continuous random variables: mean, variance; binomial, Poisson distributions, normal, uniform, exponential distributions, central limit theorem. Sample statistics, confidence intervals, hypothesis testing, regression. Applications. Introduction to software for probabilistic and statistical analysis. Emphasis on connections between probability and statistics, numerical results of real data, and techniques of data analysis.  Prerequisites: AP Calculus BC score of 3, 4, or 5, or MATH 10B or MATH 20B.", "prereqs": {"type": "one", "courses": ["MATH 10B", "MATH 20B"]}}
{"code": "MATH 15A", "title": "Introduction to Discrete Mathematics", "units": "4", "anchor": "math15a", "description": "Basic discrete mathematical structure: sets, relations, functions, sequences, equivalence relations, partial orders, and number systems. Methods of reasoning and proofs: propositional logic, predicate logic, induction, recursion, and pigeonhole principle. Infinite sets and diagonalization. Basic counting techniques; permutation and combinations. Applications will be given to digital logic design, elementary number theory, design of programs, and proofs of program correctness. Students who have completed MATH 109 may not receive credit for MATH 15A. Credit not offered for both MATH 15A and CSE 20. Equivalent to CSE 20. Prerequisites: CSE 8B or CSE 11. Prerequisite courses must be completed with a grade of C– or better.", "prereqs": {"type": "one", "courses": ["CSE 8B", "CSE 11"]}}
{"code": "MATH 18", "title": "Linear Algebra", "units": "4", "anchor": "math18", "description": "Matrix algebra, Gaussian elimination, determinants. Linear and affine subspaces, bases of Euclidean spaces. Eigenvalues and eigenvectors, quadratic forms, orthogonal matrices, diagonalization of symmetric matrices. Applications. Computing symbolic and graphical solutions using MATLAB. Students may not receive credit for both MATH 18 and 31AH. Prerequisites: Math Placement Exam qualifying score, or AP Calculus AB score of 3 (or equivalent AB subscore on BC exam), or SAT II Math Level 2 score of 650 or higher, or MATH 4C, or MATH 10A, or MATH 20A. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 4C", "MATH 10A", "MATH 20A"]}}
{"code": "MATH 20A", "title": "Calculus for Science and Engineering", "units": "4", "anchor": "math20a", "description": "Foundations of differential and integral calculus of one variable. Functions, graphs, continuity, limits, derivative, tangent line. Applications with algebraic, exponential, logarithmic, and trigonometric functions. Introduction to the integral. (Two credits given if taken after MATH 1A/10A and no credit given if taken after MATH 1B/10B or MATH 1C/10C. Formerly numbered MATH 2A.) Prerequisites: Math Placement Exam qualifying score, or AP Calculus AB score of 3 (or equivalent AB subscore on BC exam), or SAT II MATH 2C score of 650 or higher, or MATH 4C or MATH 10A.", "prereqs": {"type": "one", "courses": ["MATH 2C", "MATH 4C", "MATH 10A"]}}
{"code": "MATH 20B", "title": "Calculus for Science and Engineering", "units": "4", "anchor": "math20b", "description": "Integral calculus of one variable and its applications, with exponential, logarithmic, hyperbolic, and trigonometric functions. Methods of integration. Infinite series. Polar coordinates in the plane and complex exponentials. (Two units of credits given if taken after MATH 1B/10B or MATH 1C/10C.) Prerequisites: AP Calculus AB score of 4 or 5, or AP Calculus BC score of 3, or MATH 20A with a grade of C– or better, or MATH 10B with a grade of C– or better, or MATH 10C with a grade of C– or better.", "prereqs": {"type": "one", "courses": ["MATH 20A", "MATH 10B", "MATH 10C"]}}
{"code": "MATH 20C", "title": "Calculus and Analytic Geometry for Science and Engineering", "units": "4", "anchor": "math20c", "description": "Vector geometry, vector functions and their derivatives. Partial differentiation. Maxima and minima. Double integration. (Two units of credit given if taken after MATH 10C. Credit not offered for both MATH 20C and 31BH. Formerly numbered MATH 21C.) Prerequisites: AP Calculus BC score of 4 or 5, or MATH 20B with a grade of C– or better.", "prereqs": "MATH 20B"}
{"code": "MATH 20D", "title": "Introduction to Differential Equations", "units": "4", "anchor": "math20d", "description": "Ordinary differential equations: exact, separable, and linear; constant coefficients, undetermined coefficients, variations of parameters. Systems. Series solutions. Laplace transforms. Techniques for engineering sciences. Computing symbolic and graphical solutions using MATLAB. (Formerly numbered MATH 21D.) May be taken as repeat credit for MATH 21D. Prerequisites: MATH 20C (or MATH 21C) or MATH 31BH with a grade of C– or better.", "prereqs": {"type": "one", "courses": ["MATH 20C", "MATH 21C", "MATH 31BH"]}}
{"code": "MATH 20E", "title": "Vector Calculus", "units": "4", "anchor": "math20e", "description": "Change of variable in multiple integrals, Jacobian, Line integrals, Green’s theorem. Vector fields, gradient fields, divergence, curl. Spherical/cylindrical coordinates. Taylor series in several variables. Surface integrals, Stoke’s theorem. Gauss’ theorem. Conservative fields. Prerequisites: MATH 18 or MATH 20F or MATH 31AH and MATH 20C (or MATH 21C) or MATH 31BH with a grade of C– or better.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, {"type": "one", "courses": ["MATH 20C", "MATH 21C", "MATH 31BH"]}]}}
{"code": "MATH 31AH", "title": "Honors Linear Algebra", "units": "4", "anchor": "math31ah", "description": "First quarter of three-quarter honors integrated linear algebra/multivariable calculus sequence for well-prepared students. Topics include real/complex number systems, vector spaces, linear transformations, bases and dimension, change of basis, eigenvalues, eigenvectors, diagonalization. (Credit not offered for both MATH 31AH and 20F.) Prerequisites: AP Calculus BC score of 5 or consent of instructor."}
{"code": "MATH 31BH", "title": "Honors Multivariable Calculus", "units": "4", "anchor": "math31bh", "description": "Second quarter of three-quarter honors integrated linear algebra/multivariable calculus sequence for well-prepared students. Topics include derivative in several variables, Jacobian matrices, extrema and constrained extrema, integration in several variables. (Credit not offered for both MATH 31BH and 20C.) Prerequisites: MATH 31AH with a grade of B– or better, or consent of instructor.", "prereqs": "MATH 31AH"}
{"code": "MATH 31CH", "title": "Honors Vector Calculus", "units": "4", "anchor": "math31ch", "description": "Third quarter of honors integrated linear algebra/multivariable calculus sequence for well-prepared students. Topics include change of variables formula, integration of differential forms, exterior derivative, generalized Stoke’s theorem, conservative vector fields, potentials. Prerequisites: MATH 31BH with a grade of B– or better, or consent of instructor.", "prereqs": "MATH 31BH"}
{"code": "MATH 87", "title": "First-year Student Seminar", "units": "1", "anchor": "math87", "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students. Prerequisites: none."}
{"code": "MATH 95", "title": "Introduction to Teaching Math", "units": "2", "anchor": "math95", "description": "(Cross-listed with EDS 30.) Revisit students’ learning difficulties in mathematics in more depth to prepare students to make meaningful observations of how K–12 teachers deal with these difficulties. Explore how instruction can use students’ knowledge to pose problems that stimulate students’ intellectual curiosity. Prerequisites: none."}
{"code": "MATH 96", "title": "Putnam Seminar", "units": "1", "anchor": "math96", "description": "Students will develop skills in analytical thinking as they solve and present solutions to challenging mathematical problems in preparation for the William Lowell Putnam Mathematics Competition, a national undergraduate mathematics examination held each year. Students must sit for at least one half of the Putnam exam (given the first Saturday in December) to receive a passing grade. P/NP grades only. May be taken for credit up to four times. Prerequisites: AP Calculus AB score of 4 or more, or AP Calculus BC score of 3 or more, or MATH 20A.", "prereqs": "MATH 20A"}
{"code": "MATH 99R", "title": "Independent Study", "units": "1", "anchor": "math99r", "description": "Independent study or research under direction of a member of the faculty. Prerequisites: Must be of first-year standing and a Regent’s Scholar."}
{"code": "MATH 100A", "title": "Abstract Algebra I", "units": "4", "anchor": "math100a", "description": "First course in a rigorous three-quarter introduction to the methods and basic structures of higher algebra. Topics include groups, subgroups and factor groups, homomorphisms, rings, fields. (Students may not receive credit for both MATH 100A and MATH 103A.) Prerequisites: MATH 31CH or MATH 109 or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 31CH", "MATH 109"]}}
{"code": "MATH 100B", "title": "Abstract Algebra II", "units": "4", "anchor": "math100b", "description": "Second course in a rigorous three-quarter introduction to the methods and basic structures of higher algebra. Topics include rings (especially polynomial rings) and ideals, unique factorization, fields; linear algebra from perspective of linear transformations on vector spaces, including inner product spaces, determinants, diagonalization. (Students may not receive credit for both MATH 100B and MATH 103B.) Prerequisites: MATH 100A or consent of instructor.", "prereqs": "MATH 100A"}
{"code": "MATH 100C", "title": "Abstract Algebra III", "units": "4", "anchor": "math100c", "description": "Third course in a rigorous three-quarter introduction to the methods and basic structures of higher algebra. Topics include linear transformations, including Jordan canonical form and rational canonical form; Galois theory, including the insolvability of the quintic. Prerequisites: MATH 100B or consent of instructor.", "prereqs": "MATH 100B"}
{"code": "MATH 102", "title": "Applied Linear Algebra", "units": "4", "anchor": "math102", "description": "Second course in linear algebra from a computational yet geometric point of view. Elementary Hermitian matrices, Schur’s theorem, normal matrices, and quadratic forms. Moore-Penrose generalized inverse and least square problems. Vector and matrix norms. Characteristic and singular values. Canonical forms. Determinants and multilinear algebra. Prerequisites: MATH 18 or MATH 20F or MATH 31AH and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, "MATH 20C"]}}
{"code": "MATH 103A", "title": "Modern Algebra I", "units": "4", "anchor": "math103a", "description": "First course in a two-quarter introduction to abstract algebra with some applications. Emphasis on group theory. Topics include definitions and basic properties of groups, properties of isomorphisms, subgroups. (Students may not receive credit for both MATH 100A and MATH 103A.) Prerequisites: MATH 31CH or MATH 109 or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 31CH", "MATH 109"]}}
{"code": "MATH 103B", "title": "Modern Algebra II", "units": "4", "anchor": "math103b", "description": "Second course in a two-quarter introduction to abstract algebra with some applications. Emphasis on rings and fields. Topics include definitions and basic properties of rings, fields, and ideals, homomorphisms, irreducibility of polynomials. (Students may not receive credit for both MATH 100B and MATH 103B.) Prerequisites: MATH 103A or MATH 100A or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 103A", "MATH 100A"]}}
{"code": "MATH 104A", "title": "Number Theory I", "units": "4", "anchor": "math104a", "description": "Elementary number theory with applications. Topics include unique factorization, irrational numbers, residue systems, congruences, primitive roots, reciprocity laws, quadratic forms, arithmetic functions, partitions, Diophantine equations, distribution of primes. Applications include fast Fourier transform, signal processing, codes, cryptography. Prerequisites: MATH 100B or MATH 103B. Students who have not completed the listed prerequisite(s) may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 100B", "MATH 103B"]}}
{"code": "MATH 104B", "title": "Number Theory II", "units": "4", "anchor": "math104b", "description": "Topics in number theory such as finite fields, continued fractions, Diophantine equations, character sums, zeta and theta functions, prime number theorem, algebraic integers, quadratic and cyclotomic fields, prime ideal theory, class number, quadratic forms, units, Diophantine approximation, p-adic numbers, elliptic curves. Prerequisites: MATH 104A or consent of instructor.", "prereqs": "MATH 104A"}
{"code": "MATH 104C", "title": "Number Theory III", "units": "4", "anchor": "math104c", "description": "Topics in algebraic and analytic number theory, with an advanced treatment of material listed for MATH 104B. Prerequisites: Math 104B or consent of instructor."}
{"code": "MATH 105", "title": "Basic Number Theory", "units": "4", "anchor": "math105", "description": "The course will cover the basic arithmetic properties of the integers, with applications to Diophantine equations and elementary Diophantine approximation theory. Prerequisites: MATH 31CH or MATH 109. Students who have not completed the listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 31CH", "MATH 109"]}}
{"code": "MATH 106", "title": "Introduction to Algebraic Geometry", "units": "4", "anchor": "math106", "description": "Plane curves, Bezout’s theorem, singularities of plane curves. Affine and projective spaces, affine and projective varieties. Examples of all the above. Instructor may choose to include some commutative algebra or some computational examples. Prerequisites: MATH 100B or MATH 103B. Students who have not completed the listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 100B", "MATH 103B"]}}
{"code": "MATH 109", "title": "Mathematical Reasoning", "units": "4", "anchor": "math109", "description": "This course uses a variety of topics in mathematics to introduce the students to rigorous mathematical proof, emphasizing quantifiers, induction, negation, proof by contradiction, naive set theory, equivalence relations and epsilon-delta proofs. Required of all departmental majors. Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, "MATH 20C"]}}
{"code": "MATH 110", "title": "Introduction to Partial Differential Equations", "units": "4", "anchor": "math110", "description": "An introduction to partial differential equations focusing on equations in two variables. Topics include the heat and wave equation on an interval, Laplace’s equation on rectangular and circular domains, separation of variables, boundary conditions and eigenfunctions, introduction to Fourier series, software methods for solving equations. Formerly MATH 110A. (Students may not receive credit for MATH 110 and MATH 110A.) Prerequisites: MATH 18 or MATH 20F or MATH 31AH and MATH 20D and MATH 20E or MATH 31CH. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, "MATH 20D", {"type": "one", "courses": ["MATH 20E", "MATH 31CH"]}]}}
{"code": "MATH 111A", "title": "Mathematical Modeling I", "units": "4", "anchor": "math111a", "description": "An introduction to mathematical modeling in the physical and social sciences. Topics vary, but have included mathematical models for epidemics, chemical reactions, political organizations, magnets, economic mobility, and geographical distributions of species. May be taken for credit two times when topics change. Prerequisites: MATH 20D, MATH 18 or MATH 20F or MATH 31AH, and MATH 109 or MATH 31CH. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 20D", {"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, {"type": "one", "courses": ["MATH 109", "MATH 31CH"]}]}}
{"code": "MATH 111B", "title": "Mathematical Modeling II", "units": "4", "anchor": "math111a", "description": "Continued study on mathematical modeling in the physical and social sciences, using advanced techniques that will expand upon the topics selected and further the mathematical theory presented in MATH 111A. Prerequisites: MATH 111A or consent of instructor.", "prereqs": "MATH 111A"}
{"code": "MATH 112A", "title": "Introduction to Mathematical Biology I", "units": "4", "anchor": "math111a", "description": "Part one of a two-course introduction to the use of mathematical theory and techniques in analyzing biological problems. Topics include differential equations, dynamical systems, and probability theory applied to a selection of biological problems from population dynamics, biochemical reactions, biological oscillators, gene regulation, molecular interactions, and cellular function. May be coscheduled with MATH 212A. Recommended preparation: MATH 130 and MATH 180A. Prerequisites: MATH 11 or MATH 180A or MATH 183 or MATH 186, and MATH 18 or MATH 31AH, and MATH 20D, and BILD 1. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 11", "MATH 180A", "MATH 183", "MATH 186"]}, {"type": "one", "courses": ["MATH 18", "MATH 31AH"]}, "MATH 20D", "BILD 1"]}}
{"code": "MATH 112B", "title": "Introduction to Mathematical Biology II", "units": "4", "anchor": "math111a", "description": "Part two of an introduction to the use of mathematical theory and techniques in analyzing biological problems. Topics include partial differential equations and stochastic processes applied to a selection of biological problems, especially those involving spatial movement, such as molecular diffusion, bacterial chemotaxis, tumor growth, and biological patterns. May be coscheduled with MATH 212B. Recommended preparation: MATH 180B. Prerequisites: MATH 112A and MATH 110 and MATH 180A. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 112A", "MATH 110", "MATH 180A"]}}
{"code": "MATH 114", "title": "Introduction to Computational Stochastics", "units": "4", "anchor": "math111a", "description": "Topics include random number generators, variance reduction, Monte Carlo (including Markov Chain Monte Carlo) simulation, and numerical methods for stochastic differential equations. Methods will be illustrated on applications in biology, physics, and finance. May be coscheduled with MATH 214. Recommended preparation: CSE 5A, CSE 8A, CSE 11, or ECE 15. Students should complete a computer programming course before enrolling in MATH 114. Prerequisites: MATH 180A. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": "MATH 180A"}
{"code": "MATH 120A", "title": "Elements of Complex Analysis", "units": "4", "anchor": "math111a", "description": "Complex numbers and functions. Analytic functions, harmonic functions, elementary conformal mappings. Complex integration. Power series. Cauchy’s theorem. Cauchy’s formula. Residue theorem. Prerequisites: MATH 20E or MATH 31CH, or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 20E", "MATH 31CH"]}}
{"code": "MATH 120B", "title": "Applied Complex Analysis", "units": "4", "anchor": "math111a", "description": "Applications of the residue theorem. Conformal mapping and applications to potential theory, flows, and temperature distributions. Fourier transformations. Laplace transformations, and applications to integral and differential equations. Selected topics such as Poisson’s formula, Dirichlet’s problem, Neumann’s problem, or special functions. Prerequisites: MATH 120A or consent of instructor.", "prereqs": "MATH 120A"}
{"code": "MATH 121A", "title": "Foundations of Teaching and Learning Mathematics I", "units": "4", "anchor": "math111a", "description": "(Cross-listed with EDS 121A.) Develop teachers’ knowledge base (knowledge of mathematics content, pedagogy, and student learning) in the context of advanced mathematics. This course builds on the previous courses where these components of knowledge were addressed exclusively in the context of high-school mathematics. Prerequisites: EDS 30/MATH 95, Calculus 10C or 20C.", "prereqs": {"type": "one", "courses": ["EDS 30", "MATH 95"]}}
{"code": "MATH 121B", "title": "Foundations of Teaching and Learning Math II", "units": "4", "anchor": "math111a", "description": "(Cross-listed with EDS 121B.) Examine how learning theories can consolidate observations about conceptual development with the individual student as well as the development of knowledge in the history of mathematics. Examine how teaching theories explain the effect of teaching approaches addressed in the previous courses. Prerequisites: EDS 121A/MATH 121A.", "prereqs": {"type": "one", "courses": ["EDS 121A", "MATH 121A"]}}
{"code": "MATH 130", "title": "Differential Equations and Dynamical Systems", "units": "4", "anchor": "math111a", "description": "An introduction to ordinary differential equations from the dynamical systems perspective. Topics include flows on lines and circles, two-dimensional linear systems and phase portraits, nonlinear planar systems, index theory, limit cycles, bifurcation theory, applications to biology, physics, and electrical engineering. Formerly MATH 130A. (Students may not receive credit for MATH 130 and MATH 130A.) Prerequisites: MATH 18 or MATH 20F or MATH 31AH and MATH 20D. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, "MATH 20D"]}}
{"code": "MATH 140A", "title": "Foundations of Real Analysis I", "units": "4", "anchor": "math111a", "description": "First course in a rigorous three-quarter sequence on real analysis. Topics include the real number system, basic topology, numerical sequences and series, continuity. (Students may not receive credit for both MATH 140A and MATH 142A.) Prerequisites: MATH 31CH or MATH 109. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 31CH", "MATH 109"]}}
{"code": "MATH 140B", "title": "Foundations of Real Analysis II", "units": "4", "anchor": "math111a", "description": "Second course in a rigorous three-quarter sequence on real analysis. Topics include differentiation, the Riemann-Stieltjes integral, sequences and series of functions, power series, Fourier series, and special functions. (Students may not receive credit for both MATH 140B and MATH 142B.) Prerequisites: MATH 140A or consent of instructor.", "prereqs": "MATH 140A"}
{"code": "MATH 140C", "title": "Foundations of Real Analysis III", "units": "4", "anchor": "math111a", "description": "Third course in a rigorous three-quarter sequence on real analysis. Topics include differentiation of functions of several real variables, the implicit and inverse function theorems, the Lebesgue integral, infinite-dimensional normed spaces. Prerequisites: MATH 140B or consent of instructor.", "prereqs": "MATH 140B"}
{"code": "MATH 142A", "title": "Introduction to Analysis I", "units": "4", "anchor": "math111a", "description": "First course in an introductory two-quarter sequence on analysis. Topics include the real number system, numerical sequences and series, infinite limits, limits of functions, continuity, differentiation. Students may not receive credit for MATH 142A if taken after or concurrently with MATH 140A. Prerequisites: MATH 31CH or MATH 109. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 31CH", "MATH 109"]}}
{"code": "MATH 142B", "title": "Introduction to Analysis II", "units": "4", "anchor": "math111a", "description": "Second course in an introductory two-quarter sequence on analysis. Topics include the Riemann integral, sequences and series of functions, uniform convergence, Taylor series, introduction to analysis in several variables. Students may not receive credit for MATH 142B if taken after or concurrently with MATH 140B. Prerequisites: MATH 142A or MATH 140A. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 142A", "MATH 140A"]}}
{"code": "MATH 144", "title": "Introduction to Fourier Analysis", "units": "4", "anchor": "math111a", "description": "Rigorous introduction to the theory of Fourier series and Fourier transforms. Topics include basic properties of Fourier series, mean square and pointwise convergence, Hilbert spaces, applications of Fourier series, the Fourier transform on the real line, inversion formula, Plancherel formula, Poisson summation formula, Heisenberg uncertainty principle, applications of the Fourier transform. Prerequisites: MATH 140B or MATH 142B. Students who have not completed listed prerequisite(s) may enroll with the consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 140B", "MATH 142B"]}}
{"code": "MATH 146", "title": "Analysis of Ordinary Differential Equations", "units": "4", "anchor": "math111a", "description": "A rigorous introduction to systems of ordinary differential equations. Topics include linear systems, matrix diagonalization and canonical forms, matrix exponentials, nonlinear systems, existence and uniqueness of solutions, linearization, and stability. Prerequisites: MATH 140B or MATH 142B. Students who have not completed listed prerequisite(s) may enroll with the consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 140B", "MATH 142B"]}}
{"code": "MATH 148", "title": "Analysis of Partial Differential Equations", "units": "4", "anchor": "math111a", "description": "A rigorous introduction to partial differential equations. Topics include initial and boundary value problems; first order linear and quasilinear equations, method of characteristics; wave and heat equations on the line, half-line, and in space; separation of variables for heat and wave equations on an interval and for Laplace’s equation on rectangles and discs; eigenfunctions of the Laplacian and heat, wave, Poisson’s equations on bounded domains; and Green’s functions and distributions. Prerequisites: MATH 140B or MATH 142B. Students who have not completed listed prerequisite(s) may enroll with the consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 140B", "MATH 142B"]}}
{"code": "MATH 150A", "title": "Differential Geometry", "units": "4", "anchor": "math111a", "description": "Differential geometry of curves and surfaces. Gauss and mean curvatures, geodesics, parallel displacement, Gauss-Bonnet theorem. Prerequisites: MATH 20E or MATH 31CH and either MATH 18 or MATH 20F or MATH 31AH. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 20E", "MATH 31CH"]}, {"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}]}}
{"code": "MATH 150B", "title": "Calculus on Manifolds", "units": "4", "anchor": "math111a", "description": "Calculus of functions of several variables, inverse function theorem. Further topics may include exterior differential forms, Stokes’ theorem, manifolds, Sard’s theorem, elements of differential topology, singularities of maps, catastrophes, further topics in differential geometry, topics in geometry of physics. Prerequisites: MATH 150A or consent of instructor.", "prereqs": "MATH 150A"}
{"code": "MATH 152", "title": "Applicable Mathematics and Computing", "units": "4", "anchor": "math111a", "description": "This course will give students experience in applying theory to real world applications such as internet and wireless communication problems. The course will incorporate talks by experts from industry and students will be helped to carry out independent projects. Topics include graph visualization, labelling, and embeddings, random graphs and randomized algorithms. May be taken for credit three times. Prerequisites: MATH 20D and either MATH 18 or MATH 20F or MATH 31AH. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 20D", {"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}]}}
{"code": "MATH 153", "title": "Geometry for Secondary Teachers", "units": "4", "anchor": "math111a", "description": "Two- and three-dimensional Euclidean geometry is developed from one set of axioms. Pedagogical issues will emerge from the mathematics and be addressed using current research in teaching and learning geometry. This course is designed for prospective secondary school mathematics teachers. Prerequisites: MATH 109 or MATH 31CH, or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 109", "MATH 31CH"]}}
{"code": "MATH 154", "title": "Discrete Mathematics and Graph Theory", "units": "4", "anchor": "math111a", "description": "Basic concepts in graph theory, including trees, walks, paths, and connectivity, cycles, matching theory, vertex and edge-coloring, planar graphs, flows and combinatorial algorithms, covering Hall’s theorems, the max-flow min-cut theorem, Euler’s formula, and the travelling salesman problem. Credit not offered for MATH 154 if MATH 158 is previously taken. If MATH 154 and MATH 158 are concurrently taken, credit is only offered for MATH 158. Prerequisites: MATH 31CH or MATH 109. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 31CH", "MATH 109"]}}
{"code": "MATH 155A", "title": "Geometric Computer Graphics", "units": "4", "anchor": "math111a", "description": "Bezier curves and control lines, de Casteljau construction for subdivision, elevation of degree, control points of Hermite curves, barycentric coordinates, rational curves. Programming knowledge recommended. (Students may not receive credit for both MATH 155A and CSE 167.) Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, "MATH 20C"]}}
{"code": "MATH 155B", "title": "Topics in Computer Graphics", "units": "4", "anchor": "math111a", "description": "Spline curves, NURBS, knot insertion, spline interpolation, illumination models, radiosity, and ray tracing. Prerequisites: MATH 155A. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": "MATH 155A"}
{"code": "MATH 157", "title": "Introduction to Mathematical Software", "units": "4", "anchor": "math111a", "description": "This course provides a hands-on introduction to the use of a variety of open-source mathematical software packages, as applied to a diverse range of topics within pure and applied mathematics. Most of these packages are built on the Python programming language, but experience with another common programming language is acceptable. All software will be accessed using the CoCalc web platform (http://cocalc.com), which provides a uniform interface through any web browser. Students will need to bring a laptop or tablet to lectures in order to participate in interactive presentations. Students should have exposure to one of the following programming languages: C, C++, Java, Python, R. Prerequisites: MATH 18 or MATH 20F or MATH 31AH and one of BILD 62, COGS 18 or CSE 5A or CSE 6R or CSE 8A or CSE 11 or DSC 10 or ECE 15 or ECE 143 or MATH 189. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, {"type": "one", "courses": ["BILD 62", "COGS 18", "CSE 5A", "CSE 6R", "CSE 8A", "CSE 11", "DSC 10", "ECE 15", "ECE 143", "MATH 189"]}]}}
{"code": "MATH 158", "title": "Extremal Combinatorics and Graph Theory", "units": "4", "anchor": "math111a", "description": "Extremal combinatorics is the study of how large or small a finite set can be under combinatorial restrictions. We will give an introduction to graph theory, connectivity, coloring, factors, and matchings, extremal graph theory, Ramsey theory, extremal set theory, and an introduction to probabilistic combinatorics. Topics include Turan’s theorem, Ramsey’s theorem, Dilworth’s theorem, and Sperner’s theorem. Credit not offered for MATH 158 if MATH 154 was previously taken. If MATH 154 and MATH 158 are concurrently taken, credit is only offered for MATH 158. A strong performance in MATH 109 or MATH 31CH is recommended. Prerequisites: MATH 31CH or MATH 109. Students who have not completed the listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 31CH", "MATH 109"]}}
{"code": "MATH 160A", "title": "Elementary Mathematical Logic I", "units": "4", "anchor": "math111a", "description": "An introduction to recursion theory, set theory, proof theory, model theory. Turing machines. Undecidability of arithmetic and predicate logic. Proof by induction and definition by recursion. Cardinal and ordinal numbers. Completeness and compactness theorems for propositional and predicate calculi. Prerequisites: MATH 100A, or MATH 103A, or MATH 140A, or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 100A", "MATH 103A", "MATH 140A"]}}
{"code": "MATH 160B", "title": "Elementary Mathematical Logic II", "units": "4", "anchor": "math111a", "description": "A continuation of recursion theory, set theory, proof theory, model theory. Turing machines. Undecidability of arithmetic and predicate logic. Proof by induction and definition by recursion. Cardinal and ordinal numbers. Completeness and compactness theorems for propositional and predicate calculi. Prerequisites: MATH 160A or consent of instructor.", "prereqs": "MATH 160A"}
{"code": "MATH 163", "title": "History of Mathematics", "units": "4", "anchor": "math111a", "description": "Topics will vary from year to year in areas of mathematics and their development. Topics may include the evolution of mathematics from the Babylonian period to the eighteenth century using original sources, a history of the foundations of mathematics and the development of modern mathematics. Prerequisites: MATH 20B or consent of instructor.", "prereqs": "MATH 20B"}
{"code": "MATH 168A", "title": "Topics in Applied Mathematics—Computer Science", "units": "4", "anchor": "math111a", "description": "Topics to be chosen in areas of applied mathematics and mathematical aspects of computer science. May be taken for credit two times with different topics. Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, "MATH 20C"]}}
{"code": "MATH 170A", "title": "Introduction to Numerical Analysis: Linear Algebra", "units": "4", "anchor": "math111a", "description": "Analysis of numerical methods for linear algebraic systems and least squares problems. Orthogonalization methods. Ill conditioned problems. Eigenvalue and singular value computations. Knowledge of programming recommended. Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C or MATH 31BH. Students who have not completed the listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, {"type": "one", "courses": ["MATH 20C", "MATH 31BH"]}]}}
{"code": "MATH 170B", "title": "Introduction to Numerical Analysis: Approximation and Nonlinear Equations", "units": "4", "anchor": "math111a", "description": "Rounding and discretization errors. Calculation of roots of polynomials and nonlinear equations. Interpolation. Approximation of functions. Knowledge of programming recommended. Prerequisites: MATH 170A.", "prereqs": "MATH 170A"}
{"code": "MATH 170C", "title": "Introduction to Numerical Analysis: Ordinary Differential Equations", "units": "4", "anchor": "math111a", "description": "Numerical differentiation and integration. Ordinary differential equations and their numerical solution. Basic existence and stability theory. Difference equations. Boundary value problems. Prerequisites: MATH 20D or 21D and MATH 170B, or consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 20D", "MATH 21D"]}, "MATH 170B"]}}
{"code": "MATH 171A", "title": "Introduction to Numerical Optimization: Linear Programming", "units": "4", "anchor": "math111a", "description": "Linear optimization and applications. Linear programming, the simplex method, duality. Selected topics from integer programming, network flows, transportation problems, inventory problems, and other applications. Three lectures, one recitation. Knowledge of programming recommended. (Credit not allowed for both MATH 171A and ECON 172A.) Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, "MATH 20C"]}}
{"code": "MATH 171B", "title": "Introduction to Numerical Optimization: Nonlinear Programming", "units": "4", "anchor": "math111a", "description": "Convergence of sequences in Rn, multivariate Taylor series. Bisection and related methods for nonlinear equations in one variable. Newton’s methods for nonlinear equations in one and many variables. Unconstrained optimization and Newton’s method. Equality-constrained optimization, Kuhn-Tucker theorem. Inequality-constrained optimization. Three lectures, one recitation. Knowledge of programming recommended. (Credit not allowed for both MATH 171B and ECON 172B.) Prerequisites: MATH 171A or consent of instructor.", "prereqs": "MATH 171A"}
{"code": "MATH 173A", "title": "Optimization Methods for Data Science I", "units": "4", "anchor": "math111a", "description": "Introduction to convexity: convex sets, convex functions; geometry of hyperplanes; support functions for convex sets; hyperplanes and support vector machines. Linear and quadratic programming: optimality conditions; duality; primal and dual forms of linear support vector machines; active-set methods; interior methods. Prerequisites: MATH 20C or MATH 31BH and MATH 18 or 20F or 31AH. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 20C", "MATH 31BH"]}, {"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}]}}
{"code": "MATH 173B", "title": "Optimization Methods for Data Science II", "units": "4", "anchor": "math111a", "description": "Unconstrained optimization: linear least squares; randomized linear least squares; method(s) of steepest descent; line-search methods; conjugate-gradient method; comparing the efficiency of methods; randomized/stochastic methods; nonlinear least squares; norm minimization methods. Convex constrained optimization: optimality conditions; convex programming; Lagrangian relaxation; the method of multipliers; the alternating direction method of multipliers; minimizing combinations of norms. Prerequisites: MATH 173A. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": "MATH 173A"}
{"code": "MATH 174", "title": "Numerical Methods for Physical Modeling", "units": "4", "anchor": "math111a", "description": "(Conjoined with MATH 274.) Floating point arithmetic, direct and iterative solution of linear equations, iterative solution of nonlinear equations, optimization, approximation theory, interpolation, quadrature, numerical methods for initial and boundary value problems in ordinary differential equations. (Students may not receive credit for both MATH 174 and PHYS 105, AMES 153 or 154. Students may not receive credit for MATH 174 if MATH 170A, B, or C has already been taken.) Graduate students will do an extra assignment/exam. Prerequisites: Math 20D or MATH 21D, and either MATH 20F or MATH 31AH, or consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 21D", {"type": "one", "courses": ["MATH 20F", "MATH 31AH"]}]}}
{"code": "MATH 175", "title": "Numerical Methods for Partial Differential Equations", "units": "4", "anchor": "math111a", "description": "(Conjoined with MATH 275.) Mathematical background for working with partial differential equations. Survey of finite difference, finite element, and other numerical methods for the solution of elliptic, parabolic, and hyperbolic partial differential equations. (Formerly MATH 172. Students may not receive credit for MATH 175/275 and MATH 172.) Graduate students do an extra paper, project, or presentation, per instructor. Prerequisites: MATH 174 or MATH 274, or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 174", "MATH 274"]}}
{"code": "MATH 179", "title": "Projects in Computational and Applied Mathematics", "units": "4", "anchor": "math111a", "description": "(Conjoined with MATH 279.) Mathematical models of physical systems arising in science and engineering, good models and well-posedness, numerical and other approximation techniques, solution algorithms for linear and nonlinear approximation problems, scientific visualizations, scientific software design and engineering, project-oriented. Graduate students will do an extra paper, project, or presentation per instructor. Prerequisites: MATH 174 or MATH 274 or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 174", "MATH 274"]}}
{"code": "MATH 180A", "title": "Introduction to Probability", "units": "4", "anchor": "math111a", "description": "Probability spaces, random variables, independence, conditional probability, distribution, expectation, variance, joint distributions, central limit theorem. (Two units of credit offered for MATH 180A if ECON 120A previously, no credit offered if ECON 120A concurrently. Two units of credit offered for MATH 180A if MATH 183 or 186 taken previously or concurrently.) Prior or concurrent enrollment in MATH 109 is highly recommended.  Prerequisites: Math 20C or MATH 31BH, or consent of instructor.", "prereqs": "MATH 31BH"}
{"code": "MATH 180B", "title": "Introduction to Stochastic Processes I", "units": "4", "anchor": "math111a", "description": "Random vectors, multivariate densities, covariance matrix, multivariate normal distribution. Random walk, Poisson process. Other topics if time permits. Prerequisites: MATH 20D and either MATH 18 or MATH 20F or MATH 31AH, and MATH 109 or MATH 31CH, and MATH 180A. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 20D", {"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, {"type": "one", "courses": ["MATH 109", "MATH 31CH"]}, "MATH 180A"]}}
{"code": "MATH 180C", "title": "Introduction to Stochastic Processes II", "units": "4", "anchor": "math111a", "description": "Markov chains in discrete and continuous time, random walk, recurrent events. If time permits, topics chosen from stationary normal processes, branching processes, queuing theory. Prerequisites: MATH 180B or consent of instructor.", "prereqs": "MATH 180B"}
{"code": "MATH 181A", "title": "Introduction to Mathematical Statistics I", "units": "4", "anchor": "math111a", "description": "Multivariate distribution, functions of random variables, distributions related to normal. Parameter estimation, method of moments, maximum likelihood. Estimator accuracy and confidence intervals. Hypothesis testing, type I and type II errors, power, one-sample t-test. Prior or concurrent enrollment in MATH 109 is highly recommended.  Prerequisites: MATH 180A, and MATH 18 or MATH 20F or MATH 31AH, and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 180A", {"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, "MATH 20C"]}}
{"code": "MATH 181B", "title": "Introduction to Mathematical Statistics II", "units": "4", "anchor": "math111a", "description": "Hypothesis testing. Linear models, regression, and analysis of variance. Goodness of fit tests. Nonparametric statistics. Two units of credit offered for MATH 181B if ECON 120B previously; no credit offered if ECON 120B concurrently. Prior enrollment in MATH 109 is highly recommended. Prerequisites: MATH 181A or consent of instructor.", "prereqs": "MATH 181A"}
{"code": "MATH 181C", "title": "Mathematical Statistics—Nonparametric Statistics", "units": "4", "anchor": "math111a", "description": "Topics covered may include the following: classical rank test, rank correlations, permutation tests, distribution free testing, efficiency, confidence intervals, nonparametric regression and density estimation, resampling techniques (bootstrap, jackknife, etc.) and cross validations. Prior enrollment in MATH 109 is highly recommended. Prerequisites: MATH 181B or consent of instructor.", "prereqs": "MATH 181B"}
{"code": "MATH 181D", "title": "Statistical Learning", "units": "4", "anchor": "math111a", "description": "Statistical learning refers to a set of tools for modeling and understanding complex data sets. It uses developments in optimization, computer science, and in particular machine learning. This encompasses many methods such as dimensionality reduction, sparse representations, variable selection, classification, boosting, bagging, support vector machines, and machine learning. Prerequisites: ECE 109 or ECON 120A or MAE 108 or MATH 181A or MATH 183 or MATH 186 or MATH 189. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["ECE 109", "ECON 120A", "MAE 108", "MATH 181A", "MATH 183", "MATH 186", "MATH 189"]}}
{"code": "MATH 181E", "title": "Mathematical Statistics—Time Series", "units": "4", "anchor": "math111a", "description": "Analysis of trends and seasonal effects, autoregressive and moving averages models, forecasting, informal introduction to spectral analysis. Prerequisites: MATH 181B or consent of instructor.", "prereqs": "MATH 181B"}
{"code": "MATH 181F", "title": "Sampling Surveys and Experimental Design", "units": "4", "anchor": "math111a", "description": "Design of sampling surveys: simple, stratified, systematic, cluster, network surveys. Sources of bias in surveys. Estimators and confidence intervals based on unequal probability sampling. Design and analysis of experiments: block, factorial, crossover, matched-pairs designs. Analysis of variance, re-randomization, and multiple comparisons. Prerequisites: ECE 109 or ECON 120A or MAE 108 or MATH 11 or MATH 181A or MATH 183 or MATH 186 or MATH 189. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["ECE 109", "ECON 120A", "MAE 108", "MATH 11", "MATH 181A", "MATH 183", "MATH 186", "MATH 189"]}}
{"code": "MATH 182", "title": "Hidden Data in Random Matrices", "units": "4", "anchor": "math111a", "description": "Rigorous treatment of principal component analysis, one of the most effective methods in finding signals amidst the noise of large data arrays. Topics include singular value decomposition for matrices, maximal likelihood estimation, least squares methods, unbiased estimators, random matrices, Wigner’s semicircle law, Markchenko-Pastur laws, universality of eigenvalue statistics, outliers, the BBP transition, applications to community detection, and stochastic block model. Students will not receive credit for both MATH 182 and DSC 155. Completion of MATH 102 is encouraged but not required. Prerequisites: MATH 180A, and MATH 18 or MATH 31AH. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 180A", {"type": "one", "courses": ["MATH 18", "MATH 31AH"]}]}}
{"code": "MATH 183", "title": "Statistical Methods", "units": "4", "anchor": "math111a", "description": "Introduction to probability. Discrete and continuous random variables–binomial, Poisson and Gaussian distributions. Central limit theorem. Data analysis and inferential statistics: graphical techniques, confidence intervals, hypothesis tests, curve fitting. (Credit not offered for MATH 183 if ECON 120A, ECE 109, MAE 108, MATH 181A, or MATH 186 previously or concurrently taken. Two units of credit offered for MATH 183 if MATH 180A taken previously or concurrently.) Prerequisites: MATH 20C or MATH 31BH, or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 20C", "MATH 31BH"]}}
{"code": "MATH 184", "title": "Enumerative Combinatorics", "units": "4", "anchor": "math111a", "description": "Introduction to the theory and applications of combinatorics. Enumeration of combinatorial structures (permutations, integer partitions, set partitions). Bijections, inclusion-exclusion, ordinary and exponential generating functions. Renumbered from MATH 184A; credit not offered for MATH 184 if MATH 184A if previously taken. Credit not offered for MATH 184 if MATH 188 previously taken. If MATH 184 and MATH 188 are concurrently taken, credit only offered for MATH 188. Prerequisites: MATH 31CH or MATH 109. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 31CH", "MATH 109"]}}
{"code": "MATH 185", "title": "Introduction to Computational Statistics", "units": "4", "anchor": "math111a", "description": "Statistical analysis of data by means of package programs. Regression, analysis of variance, discriminant analysis, principal components, Monte Carlo simulation, and graphical methods. Emphasis will be on understanding the connections between statistical theory, numerical results, and analysis of real data. Recommended preparation: exposure to computer programming (such as CSE 5A, CSE 7, or ECE 15) highly recommended. Prerequisites: MATH 181A, or ECON 120B, and either MATH 18 or MATH 20F or MATH 31AH, and MATH 20C or MATH 31BH. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 181A", "ECON 120B"]}, {"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, {"type": "one", "courses": ["MATH 20C", "MATH 31BH"]}]}}
{"code": "MATH 186", "title": "Probability and Statistics for Bioinformatics", "units": "4", "anchor": "math111a", "description": "This course will cover discrete and random variables, data analysis and inferential statistics, likelihood estimators and scoring matrices with applications to biological problems. Introduction to Binomial, Poisson, and Gaussian distributions, central limit theorem, applications to sequence and functional analysis of genomes and genetic epidemiology. (Credit not offered for MATH 186 if ECON 120A, ECE 109, MAE 108, MATH 181A, or MATH 183 previously or concurrently. Two units of credit offered for MATH 186 if MATH 180A taken previously or concurrently.) Prerequisites: MATH 20C or MATH 31BH, or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 20C", "MATH 31BH"]}}
{"code": "MATH 187A", "title": "Introduction to Cryptography", "units": "4", "anchor": "math111a", "description": "An introduction to the basic concepts and techniques of modern cryptography. Classical cryptanalysis. Probabilistic models of plaintext. Monalphabetic and polyalphabetic substitution. The one-time system. Caesar-Vigenere-Playfair-Hill substitutions. The Enigma. Modern-day developments. The Data Encryption Standard. Public key systems. Security aspects of computer networks. Data protection. Electronic mail. Recommended preparation: basic programming experience. Renumbered from MATH 187. Students may not receive credit for both MATH 187A and MATH 187. Prerequisites: MATH 10A or MATH 20A. Students who have not completed listed prerequisite may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 10A", "MATH 20A"]}}
{"code": "MATH 187B", "title": "Mathematics of Modern Cryptography", "units": "4", "anchor": "math111a", "description": "The object of this course is to study modern public key cryptographic systems and cryptanalysis (e.g., RSA, Diffie-Hellman, elliptic curve cryptography, lattice-based cryptography, homomorphic encryption) and the mathematics behind them. We also explore other applications of these computational techniques (e.g., integer factorization and attacks on RSA). Recommended preparation: Familiarity with Python and/or mathematical software (especially SAGE) would be helpful, but it is not required. Prerequisites: MATH 187 or MATH 187A and MATH 18 or MATH 31AH or MATH 20F. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 187", "MATH 187A"]}, {"type": "one", "courses": ["MATH 18", "MATH 31AH", "MATH 20F"]}]}}
{"code": "MATH 188", "title": "Algebraic Combinatorics", "units": "4", "anchor": "math111a", "description": "A rigorous introduction to algebraic combinatorics. Basic enumeration and generating functions. Enumeration involving group actions: Polya theory. Posets and Sperner property. q-analogs and unimodality. Partitions and tableaux. Credit not offered for MATH 188 if MATH 184 or MATH 184A previously taken. If MATH 184 and MATH 188 are concurrently taken, credit only offered for MATH 188. Prerequisites: MATH 31CH or MATH 109 and MATH 18 or MATH 31AH and MATH 100A or 103A. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 31CH", "MATH 109"]}, {"type": "one", "courses": ["MATH 18", "MATH 31AH"]}, {"type": "one", "courses": ["MATH 100A", "MATH 103A"]}]}}
{"code": "MATH 189", "title": "Exploratory Data Analysis and Inference", "units": "4", "anchor": "math111a", "description": "An introduction to various quantitative methods and statistical techniques for analyzing data—in particular big data. Quick review of probability continuing to topics of how to process, analyze, and visualize data using statistical language R. Further topics include basic inference, sampling, hypothesis testing, bootstrap methods, and regression and diagnostics. Offers conceptual explanation of techniques, along with opportunities to examine, implement, and practice them in real and simulated data. Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C and one of BENG 134, CSE 103, ECE 109, ECON 120A, MAE 108, MATH 180A, MATH 183, MATH 186, or SE 125. Students who have not completed listed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, "MATH 20C", {"type": "one", "courses": ["BENG 134", "CSE 103", "ECE 109", "ECON 120A", "MAE 108", "MATH 180A", "MATH 183", "MATH 186", "SE 125"]}]}}
{"code": "MATH 190A", "title": "Foundations of Topology I", "units": "4", "anchor": "math111a", "description": "An introduction to point set topology: topological spaces, subspace topologies, product topologies, quotient topologies, continuous maps and homeomorphisms, metric spaces, connectedness, compactness, basic separation, and countability axioms. Examples. Instructor may choose further topics such as Urysohn’s lemma, Urysohn’s metrization theorem. Formerly MATH 190. Students may not receive credit for MATH 190A and MATH 190. Prerequisites: MATH 31CH or MATH 140A or MATH 142A. Students who have not completed prerequisites may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 31CH", "MATH 140A", "MATH 142A"]}}
{"code": "MATH 190B", "title": "Foundations of Topology II", "units": "4", "anchor": "math111a", "description": "An introduction to the fundamental group: homotopy and path homotopy, homotopy equivalence, basic calculations of fundamental groups, fundamental group of the circle and applications (for instance to retractions and fixed-point theorems), van Kampen’s theorem, covering spaces, universal covers. Examples of all of the above. Instructor may choose further topics such as deck transformations and the Galois correspondence, basic homology, compact surfaces. Prerequisites: MATH 190A. Students who have not completed the listed prerequisite may enroll with consent of instructor.", "prereqs": "MATH 190A"}
{"code": "MATH 191", "title": "Topics in Topology", "units": "4", "anchor": "math111a", "description": "Topics to be chosen by the instructor from the fields of differential algebraic, geometric, and general topology. Prerequisites: MATH 190 or consent of instructor.", "prereqs": "MATH 190"}
{"code": "MATH 193A", "title": "Actuarial Mathematics I", "units": "4", "anchor": "math111a", "description": "Probabilistic Foundations of Insurance. Short-term risk models. Survival distributions and life tables. Introduction to life insurance. Prerequisites: MATH 180A or MATH 183, or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 180A", "MATH 183"]}}
{"code": "MATH 193B", "title": "Actuarial Mathematics II", "units": "4", "anchor": "math111a", "description": "Life Insurance and Annuities. Analysis of premiums and premium reserves. Introduction to multiple life functions and decrement models as time permits. Prerequisites: MATH 193A or consent of instructor.", "prereqs": "MATH 193A"}
{"code": "MATH 194", "title": "The Mathematics of Finance", "units": "4", "anchor": "math111a", "description": "Introduction to the mathematics of financial models. Basic probabilistic models and associated mathematical machinery will be discussed, with emphasis on discrete time models. Concepts covered will include conditional expectation, martingales, optimal stopping, arbitrage pricing, hedging, European and American options. Prerequisites: MATH 20D, and either MATH 18 or MATH 20F or MATH 31AH, and MATH 180A. Students who have not completed listed prerequisites may enroll with consent of instructor. Students completing ECON 120A instead of MATH 180A must obtain consent of instructor to enroll.", "prereqs": {"type": "all", "courses": ["MATH 20D", {"type": "one", "courses": ["MATH 18", "MATH 20F", "MATH 31AH"]}, "MATH 180A"]}}
{"code": "MATH 195", "title": "Introduction to Teaching in Mathematics", "units": "4", "anchor": "math111a", "description": "Students will be responsible for and teach a class section of a lower-division mathematics course. They will also attend a weekly meeting on teaching methods. (Does not count toward a minor or major.) Prerequisites: consent of instructor."}
{"code": "MATH 196", "title": "Student Colloquium", "units": "1", "anchor": "math111a", "description": "A variety of topics and current research results in mathematics will be presented by guest lecturers and students under faculty direction. May be taken for P/NP grade only. Prerequisites: upper-division status."}
{"code": "MATH 197", "title": "Extracurricular Industry Practicum", "units": "2 or 4", "anchor": "math111a", "description": "An enrichment program which provides academic credit for work experience with public/private sector employers. After independently securing an internship with significant mathematical content, students will identify a faculty member to work with directly, discussing the mathematics involved. Faculty may require related readings and assignments as appropriate. May be taken for credit three times. Units may not be applied towards major graduation requirements. Prerequisites: permission of department."}
{"code": "MATH 199", "title": "Independent Study for Undergraduates", "units": "2 or 4", "anchor": "math111a", "description": "Independent reading in advanced mathematics by individual students. Three periods. (P/NP grades only.) Prerequisites: permission of department."}
{"code": "MATH 199H", "title": "Honors Thesis Research for Undergraduates", "units": "2–4", "anchor": "math111a", "description": "Honors thesis research for seniors participating in the Honors Program. Research is conducted under the supervision of a mathematics faculty member. Prerequisites: admission to the Honors Program in mathematics, department stamp."}
{"code": "MATH 200A", "title": "Algebra I", "units": "4", "anchor": "math111a", "description": "First course in graduate algebra. Topics may include group actions, Sylow theorems, solvable and nilpotent groups, free groups and presentations, semidirect products, polynomial rings, unique factorization, chain conditions, modules over principal ideal domains, rational and Jordan canonical forms, tensor products, projective and flat modules, Galois theory, solvability by radicals, localization, primary decomposition, Hilbert Nullstellensatz, integral extensions, Dedekind domains, Krull dimension. Prerequisites: graduate standing in MA75, MA76, MA77, MA80, MA81. All other students may enroll with consent of instructor."}
{"code": "MATH 200B", "title": "Algebra II", "units": "4", "anchor": "math111a", "description": "Second course in graduate algebra. Topics may include group actions, Sylow theorems, solvable and nilpotent groups, free groups and presentations, semidirect products, polynomial rings, unique factorization, chain conditions, modules over principal ideal domains, rational and Jordan canonical forms, tensor products, projective and flat modules, Galois theory, solvability by radicals, localization, primary decomposition, Hilbert Nullstellensatz, integral extensions, Dedekind domains, Krull dimension. Prerequisites: MATH 200A. Students who have not completed MATH 200A may enroll with consent of instructor.", "prereqs": "MATH 200A"}
{"code": "MATH 200C", "title": "Algebra III", "units": "4", "anchor": "math111a", "description": "Third course in graduate algebra. Topics may include group actions, Sylow theorems, solvable and nilpotent groups, free groups and presentations, semidirect products, polynomial rings, unique factorization, chain conditions, modules over principal ideal domains, rational and Jordan canonical forms, tensor products, projective and flat modules, Galois theory, solvability by radicals, localization, primary decomposition, Hilbert Nullstellensatz, integral extensions, Dedekind domains, Krull dimension. Prerequisites: MATH 200B. Students who have not completed MATH 200B may enroll with consent of instructor.", "prereqs": "MATH 200B"}
{"code": "MATH 201A", "title": "Basic Topics in Algebra I", "units": "4", "anchor": "math111a", "description": "Recommended for all students specializing in algebra. Basic topics include categorical algebra, commutative algebra, group representations, homological algebra, nonassociative algebra, ring theory. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: MATH 200C. Students who have not taken MATH 200C may enroll with consent of instructor.", "prereqs": "MATH 200C"}
{"code": "MATH 202A", "title": "Applied Algebra I", "units": "4", "anchor": "math111a", "description": "Introduction to algebra from a computational perspective. Groups, rings, linear algebra, rational and Jordan forms, unitary and Hermitian matrices, matrix decompositions, perturbation of eigenvalues, group representations, symmetric functions, fast Fourier transform, commutative algebra, Grobner basis, finite fields. Prerequisites: graduate standing or consent of instructor."}
{"code": "MATH 202B", "title": "Applied Algebra II", "units": "4", "anchor": "math111a", "description": "Second course in algebra from a computational perspective. Groups, rings, linear algebra, rational and Jordan forms, unitary and Hermitian matrices, matrix decompositions, perturbation of eigenvalues, group representations, symmetric functions, fast Fourier transform, commutative algebra, Grobner basis, finite fields. Prerequisites: MATH 202A or consent of instructor.", "prereqs": "MATH 202A"}
{"code": "MATH 202C", "title": "Applied Algebra III", "units": "4", "anchor": "math111a", "description": "Third course in algebra from a computational perspective. Groups, rings, linear algebra, rational and Jordan forms, unitary and Hermitian matrices, matrix decompositions, perturbation of eigenvalues, group representations, symmetric functions, fast Fourier transform, commutative algebra, Grobner basis, finite fields. Prerequisites: MATH 202B or consent of instructor.", "prereqs": "MATH 202B"}
{"code": "MATH 203A", "title": "Algebraic Geometry I", "units": "4", "anchor": "math111a", "description": "Introduction to algebraic geometry. Topics chosen from: varieties and their properties, sheaves and schemes and their properties. May be taken for credit up to three times. Prerequisites: MATH 200C. Students who have not taken MATH 200C may enroll with consent of instructor.", "prereqs": "MATH 200C"}
{"code": "MATH 203B", "title": "Algebraic Geometry II", "units": "4", "anchor": "math111a", "description": "Second course in algebraic geometry. Continued exploration of varieties, sheaves and schemes, divisors and linear systems, differentials, cohomology. May be taken for credit up to three times. Prerequisites: MATH 203A. Students who have not taken MATH 203A may enroll with consent of instructor.", "prereqs": "MATH 203A"}
{"code": "MATH 203C", "title": "Algebraic Geometry III", "units": "4", "anchor": "math111a", "description": "Third course in algebraic geometry. Continued exploration of varieties, sheaves and schemes, divisors and linear systems, differentials, cohomology, curves, and surfaces. May be taken for credit up to three times. Prerequisites: MATH 203B. Students who have not taken MATH 203B may enroll with consent of instructor.", "prereqs": "MATH 203B"}
{"code": "MATH 204A", "title": "Number Theory I", "units": "4", "anchor": "math111a", "description": "First course in graduate-level number theory. Local fields: valuations and metrics on fields; discrete valuation rings and Dedekind domains; completions; ramification theory; main statements of local class field theory. Prerequisites: MATH 200C. Students who have not taken MATH 200C may enroll with consent of instructor.", "prereqs": "MATH 200C"}
{"code": "MATH 204B", "title": "Number Theory II", "units": "4", "anchor": "math111a", "description": "Second course in graduate-level number theory. Global fields: arithmetic properties and relation to local fields; ideal class groups; groups of units; ramification theory; adèles and idèles; main statements of global class field theory. Prerequisites: MATH 204A. Students who have not taken MATH 204A may enroll with consent of instructor.", "prereqs": "MATH 204A"}
{"code": "MATH 204C", "title": "Number Theory III", "units": "4", "anchor": "math111a", "description": "Third course in graduate-level number theory. Zeta and L-functions; Dedekind zeta functions; Artin L-functions; the class-number formula and generalizations; density theorems. Prerequisites: MATH 204B. Students who have not taken MATH 204B may enroll with consent of instructor.", "prereqs": "MATH 204B"}
{"code": "MATH 205", "title": "Topics in Number Theory", "units": "4", "anchor": "math111a", "description": "Topics in algebraic and analytic number theory, such as: L-functions, sieve methods, modular forms, class field theory, p-adic L-functions and Iwasawa theory, elliptic curves and higher dimensional abelian varieties, Galois representations and the Langlands program, p-adic cohomology theories, Berkovich spaces, etc. May be taken for credit nine times. Prerequisites: graduate standing."}
{"code": "MATH 206A", "title": "Topics in Algebraic Geometry", "units": "4", "anchor": "math111a", "description": "Introduction to varied topics in algebraic geometry. Topics will be drawn from current research and may include Hodge theory, higher dimensional geometry, moduli of vector bundles, abelian varieties, deformation theory, intersection theory. Nongraduate students may enroll with consent of instructor. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: graduate standing."}
{"code": "MATH 206B", "title": "Further Topics in Algebraic Geometry", "units": "4", "anchor": "math111a", "description": "Continued development of a topic in algebraic geometry. Topics will be drawn from current research and may include Hodge theory, higher dimensional geometry, moduli of vector bundles, abelian varieties, deformation theory, intersection theory. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 206A. Students who have not completed MATH 206A may enroll with consent of instructor.", "prereqs": "MATH 206A"}
{"code": "MATH 207A", "title": "Topics in Algebra", "units": "4", "anchor": "math111a", "description": "Introduction to varied topics in algebra. In recent years, topics have included number theory, commutative algebra, noncommutative rings, homological algebra, and Lie groups. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: MATH 200C. Students who have not completed MATH 200C may enroll with consent of instructor.", "prereqs": "MATH 200C"}
{"code": "MATH 208", "title": "Seminar in Algebraic Geometry", "units": "1", "anchor": "math111a", "description": "Various topics in algebraic geometry. May be taken for credit nine times. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor. (S/U grade only.)"}
{"code": "MATH 209", "title": "Seminar in Number Theory", "units": "1", "anchor": "math111a", "description": "Various topics in number theory. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)"}
{"code": "MATH 210A", "title": "Mathematical Methods in Physics and Engineering", "units": "4", "anchor": "math111a", "description": "Complex variables with applications. Analytic functions, Cauchy’s theorem, Taylor and Laurent series, residue theorem and contour integration techniques, analytic continuation, argument principle, conformal mapping, potential theory, asymptotic expansions, method of steepest descent. Prerequisites: MATH 20D-E-F, 140A/142A, or consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 20D", "MATH 20E", "MATH 20F", {"type": "one", "courses": ["MATH 140A", "MATH 142A"]}]}}
{"code": "MATH 210B", "title": "Mathematical Methods in Physics and Engineering", "units": "4", "anchor": "math111a", "description": "Linear algebra and functional analysis. Vector spaces, orthonormal bases, linear operators and matrices, eigenvalues and diagonalization, least squares approximation, infinite-dimensional spaces, completeness, integral equations, spectral theory, Green’s functions, distributions, Fourier transform. Prerequisites: MATH 210A or consent of instructor.", "prereqs": "MATH 210A"}
{"code": "MATH 210C", "title": "Mathematical Methods in Physics and Engineering", "units": "4", "anchor": "math111a", "description": "Calculus of variations: Euler-Lagrange equations, Noether’s theorem. Fourier analysis of functions and distributions in several variables. Partial differential equations: Laplace, wave, and heat equations; fundamental solutions (Green’s functions); well-posed problems. Prerequisites: MATH 210B or consent of instructor. (S)", "prereqs": "MATH 210B"}
{"code": "MATH 211A", "title": "Seminar in Algebra", "units": "1", "anchor": "math111a", "description": "Various topics in algebra. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor. May be taken for credit nine times. (S/U grades only.)"}
{"code": "MATH 211B", "title": "Seminar in Group Actions", "units": "1", "anchor": "math111a", "description": "Various topics in group actions. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor. May be taken for credit nine times. (S/U grades only.)"}
{"code": "MATH 212A", "title": "Introduction to Mathematical Biology I", "units": "4", "anchor": "math111a", "description": "Part one of a two-course introduction to the use of mathematical theory and techniques in analyzing biological problems. Topics include differential equations, dynamical systems, and probability theory applied to a selection of biological problems from population dynamics, biochemical reactions, biological oscillators, gene regulation, molecular interactions, and cellular function. May be coscheduled with MATH 112A. Recommended preparation: Probability Theory and Differential Equations. Prerequisites: graduate standing."}
{"code": "MATH 212B", "title": "Introduction to Mathematical Biology II", "units": "4", "anchor": "math111a", "description": "Part two of a two-course introduction to the use of mathematical theory and techniques in analyzing biological problems. Topics include partial differential equations and stochastic processes applied to a selection of biological problems, especially those involving spatial movement such as molecular diffusion, bacterial chemotaxis, tumor growth, and biological patterns. May be coscheduled with MATH 112B. Recommended preparation: Probability Theory and Stochastic Processes. Prerequisites: MATH 212A and graduate standing.", "prereqs": "MATH 212A"}
{"code": "MATH 214", "title": "Introduction to Computational Stochastics", "units": "4", "anchor": "math111a", "description": "Topics include random number generators, variance reduction, Monte Carlo (including Markov Chain Monte Carlo) simulation, and numerical methods for stochastic differential equations. Methods will be illustrated on applications in biology, physics, and finance. May be coscheduled with MATH 114. Recommended preparation: Probability Theory and basic computer programming. Prerequisites: graduate standing."}
{"code": "MATH 216A", "title": "Mathematical Methods in Data Science I", "units": "4", "anchor": "math111a", "description": "This is the first course in a three-course sequence in mathematical methods in data science, and will serve as an introduction to the rest of the sequence. Topics include principal component analysis and the singular value decomposition, sparse representation, dictionary learning, the Johnson Lindenstrauss Lemma and its applications, compressed sensing, kernel methods, nearest neighbor searches, and spectral and subspace clustering. Some scientific programming experience is recommended. Prerequisites: graduate standing."}
{"code": "MATH 216B", "title": "Mathematical Methods in Data Science II", "units": "4", "anchor": "math111a", "description": "This is the second course in a three-course sequence in mathematical methods in data science. Topics include analysis on graphs, random walks and diffusion geometry for uniform and non-uniform sampling, eigenvector perturbation, multi-scale analysis of data, concentration of measure phenomenon, binary embeddings, quantization, topic modeling, and geometric machine learning, as well as scientific applications. Some scientific programming experience is recommended. Prerequisites: MATH 216A. Students who have not completed MATH 216A may enroll with consent of instructor.", "prereqs": "MATH 216A"}
{"code": "MATH 216C", "title": "Mathematical Methods in Data Science III", "units": "4", "anchor": "math111a", "description": "This is the third course in the sequence for mathematical methods in data science. Topics include non-linear signal processing, compressed sensing and its extensions, phase retrieval, blind deconvolution, neural networks, non-convex optimization, and optimal transport distances. Some scientific programming experience is recommended. Prerequisites: MATH 216B. Students who have not completed MATH 216B may enroll with consent of instructor.", "prereqs": "MATH 216B"}
{"code": "MATH 217", "title": "Topics in Applied Mathematics", "units": "4", "anchor": "math111a", "description": "In recent years, topics have included applied complex analysis, special functions, and asymptotic methods. May be repeated for credit with consent of adviser as topics vary. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor."}
{"code": "MATH 218", "title": "Seminar in Mathematics of Biological Systems", "units": "1", "anchor": "math111a", "description": "Various topics in the mathematics of biological systems. May be taken for credit nine times. Prerequisites: graduate standing. (S/U grades only.)"}
{"code": "MATH 220A-B-C", "title": ". Complex Analysis", "units": "4-4-4", "anchor": "math111a", "description": "Complex numbers and functions. Cauchy theorem and its applications, calculus of residues, expansions of analytic functions, analytic continuation, conformal mapping and Riemann mapping theorem, harmonic functions. Dirichlet principle, Riemann surfaces. Prerequisites: MATH 140A-B or consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 140A", "MATH 140B"]}}
{"code": "MATH 221A", "title": "Topics in Several Complex Variables", "units": "4", "anchor": "math111a", "description": "Introduction to varied topics in several complex variables. In recent years, topics have included formal and convergent power series, Weierstrass preparation theorem, Cartan-Ruckert theorem, analytic sets, mapping theorems, domains of holomorphy, proper holomorphic mappings, complex manifolds and modifications. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: MATH 200A and 220C. Students who have not completed MATH 200A and 220C may enroll with consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 200A", "MATH 220C"]}}
{"code": "MATH 221B", "title": "Further Topics in Several Complex Variables", "units": "4", "anchor": "math111a", "description": "Continued development of a topic in several complex variables. Topics include formal and convergent power series, Weierstrass preparation theorem, Cartan-Ruckert theorem, analytic sets, mapping theorems, domains of holomorphy, proper holomorphic mappings, complex manifolds and modifications. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 221A. Students who have not completed MATH 221A may enroll with consent of instructor.", "prereqs": "MATH 221A"}
{"code": "MATH 231A", "title": "Partial Differential Equations I", "units": "4", "anchor": "math111a", "description": "First course in graduate partial differential equations. Laplace, heat, and wave equations. Non-linear first order equations, including Hamilton-Jacobi theory. Sobolev spaces and initial/boundary value problems for linear elliptic, parabolic, and hyperbolic equations. Non-linear second order equations, including calculus of variations. Prerequisites: MATH 210B or 240C. Students who have not completed MATH 210B or 240C may enroll with consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 210B", "MATH 240C"]}}
{"code": "MATH 231B", "title": "Partial Differential Equations II", "units": "4", "anchor": "math111a", "description": "Second course in graduate partial differential equations. Laplace, heat, and wave equations. Non-linear first order equations, including Hamilton-Jacobi theory. Sobolev spaces and initial/boundary value problems for linear elliptic, parabolic, and hyperbolic equations. Non-linear second order equations, including calculus of variations. Prerequisites: MATH 231A. Students who have not completed MATH 231A may enroll with consent of instructor.", "prereqs": "MATH 231A"}
{"code": "MATH 231C", "title": "Partial Differential Equations III", "units": "4", "anchor": "math111a", "description": "Third course in graduate partial differential equations. Laplace, heat, and wave equations. Non-linear first order equations, including Hamilton-Jacobi theory. Sobolev spaces and initial/boundary value problems for linear elliptic, parabolic, and hyperbolic equations. Non-linear second order equations, including calculus of variations. Prerequisites: MATH 231B. Students who have not completed MATH 231B may enroll with consent of instructor.", "prereqs": "MATH 231B"}
{"code": "MATH 237A", "title": "Topics in Differential Equations", "units": "4", "anchor": "math111a", "description": "Introduction to varied topics in differential equations. In recent years, topics have included Riemannian geometry, Ricci flow, and geometric evolution. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor."}
{"code": "MATH 237B", "title": "Further Topics in Differential Equations", "units": "4", "anchor": "math111a", "description": "Continued development of a topic in differential equations. Topics include Riemannian geometry, Ricci flow, and geometric evolution. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 237A. Students who have not completed MATH 237A may enroll with consent of instructor.", "prereqs": "MATH 237A"}
{"code": "MATH 240A", "title": "Real Analysis I", "units": "4", "anchor": "math111a", "description": "First course in graduate real analysis. Abstract measure and integration theory, integration on product spaces. Lebesgue measure and integral, Lebesgue-Stieltjes integrals, functions of bounded variation, differentiation of measures. Locally compact Hausdorff spaces, Banach and Hilbert spaces, linear functionals. Lebesgue spaces and interpolation, elements of Fourier analysis and distribution theory. Prerequisites: graduate standing in MA75, MA76, MA77, MA80, MA81. All other students may enroll with consent of instructor."}
{"code": "MATH 240B", "title": "Real Analysis II", "units": "4", "anchor": "math111a", "description": "Second course in graduate real analysis. Abstract measure and integration theory, integration on product spaces. Lebesgue measure and integral, Lebesgue-Stieltjes integrals, functions of bounded variation, differentiation of measures. Locally compact Hausdorff spaces, Banach and Hilbert spaces, linear functionals. Lebesgue spaces and interpolation, elements of Fourier analysis and distribution theory. Prerequisites: MATH 240A. Students who have not completed MATH 240A may enroll with consent of instructor.", "prereqs": "MATH 240A"}
{"code": "MATH 240C", "title": "Real Analysis III", "units": "4", "anchor": "math111a", "description": "Third course in graduate real analysis. Abstract measure and integration theory, integration on product spaces. Lebesgue measure and integral, Lebesgue-Stieltjes integrals, functions of bounded variation, differentiation of measures. Locally compact Hausdorff spaces, Banach and Hilbert spaces, linear functionals. Lebesgue spaces and interpolation, elements of Fourier analysis and distribution theory. Prerequisites: MATH 240B. Students who have not completed MATH 240B may enroll with consent of instructor.", "prereqs": "MATH 240B"}
{"code": "MATH 241A", "title": "Functional Analysis I", "units": "4", "anchor": "math111a", "description": "First course in graduate functional analysis. Locally convex spaces, weak topologies. Convexity and fixed point theorems. Banach algebras and C*-algebras. Operators on Hilbert spaces (bounded, unbounded, compact, normal). Spectral theory of operators, semigroups of operators. Fredholm theory. Prerequisites: MATH 240C. Students who have not completed MATH 240C may enroll with consent of instructor.", "prereqs": "MATH 240C"}
{"code": "MATH 241B", "title": "Functional Analysis II", "units": "4", "anchor": "math111a", "description": "Second course in graduate functional analysis. Locally convex spaces, weak topologies. Convexity and fixed point theorems. Banach algebras and C*-algebras. Operators on Hilbert spaces (bounded, unbounded, compact, normal). Spectral theory of operators, semigroups of operators. Fredholm theory. Prerequisites: MATH 241A. Students who have not completed MATH 241A may enroll with consent of instructor.", "prereqs": "MATH 241A"}
{"code": "MATH 242", "title": "Topics in Fourier Analysis", "units": "4", "anchor": "math111a", "description": "In recent years, topics have included Fourier analysis in Euclidean spaces, groups, and symmetric spaces. May be repeated for credit with consent of adviser as topics vary. Prerequisites: MATH 240C, students who have not completed MATH 240C may enroll with consent of instructor.", "prereqs": "MATH 240C"}
{"code": "MATH 243", "title": "Seminar in Functional Analysis", "units": "1", "anchor": "math111a", "description": "Various topics in functional analysis. May be taken for credit nine times. Prerequisites: graduate standing or consent of instructor. (S/U grades only.)"}
{"code": "MATH 245A", "title": "Convex Analysis and Optimization I", "units": "4", "anchor": "math245a", "description": "Convex sets and functions, convex and affine hulls, relative interior, closure, and continuity, recession and existence of optimal solutions, saddle point and min-max theory, subgradients and subdifferentials. Recommended preparation: course work in linear algebra and real analysis. Prerequisites: graduate standing."}
{"code": "MATH 245B", "title": "Convex Analysis and Optimization II", "units": "4", "anchor": "math245b", "description": "Optimality conditions, strong duality and the primal function, conjugate functions, Fenchel duality theorems, dual derivatives and subgradients, subgradient methods, cutting plane methods. Prerequisites: MATH 245A or consent of instructor.", "prereqs": "MATH 245A"}
{"code": "MATH 245C", "title": "Convex Analysis and Optimization III", "units": "4", "anchor": "math245c", "description": "Convex optimization problems, linear matrix inequalities, second-order cone programming, semidefinite programming, sum of squares of polynomials, positive polynomials, distance geometry. Prerequisites: MATH 245B or consent of instructor.", "prereqs": "MATH 245B"}
{"code": "MATH 247A", "title": "Topics in Real Analysis", "units": "4", "anchor": "math245c", "description": "Introduction to varied topics in real analysis. In recent years, topics have included Fourier analysis, distribution theory, martingale theory, operator theory. May be taken for credit six times with consent of adviser. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor."}
{"code": "MATH 247B", "title": "Further Topics in Real Analysis", "units": "4", "anchor": "math245c", "description": "Continued development of a topic in real analysis. Topics include Fourier analysis, distribution theory, martingale theory, operator theory. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 247A. Students who have not completed MATH 247A may enroll with consent of instructor.", "prereqs": "MATH 247A"}
{"code": "MATH 248", "title": "Seminar in Real Analysis", "units": "1", "anchor": "math245c", "description": "Various topics in real analysis. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)"}
{"code": "MATH 250A-B-C", "title": ". Differential Geometry", "units": "4-4-4", "anchor": "math245c", "description": "Differential manifolds, Sard theorem, tensor bundles, Lie derivatives, DeRham theorem, connections, geodesics, Riemannian metrics, curvature tensor and sectional curvature, completeness, characteristic classes. Differential manifolds immersed in Euclidean space. Prerequisites: consent of instructor."}
{"code": "MATH 251A-B-C", "title": ". Lie Groups", "units": "4-4-4", "anchor": "math245c", "description": "Lie groups, Lie algebras, exponential map, subgroup subalgebra correspondence, adjoint group, universal enveloping algebra. Structure theory of semisimple Lie groups, global decompositions, Weyl group. Geometry and analysis on symmetric spaces. Prerequisites: MATH 200 and 250 or consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 200", "MATH 250"]}}
{"code": "MATH 256", "title": "Seminar in Lie Groups and Lie Algebras", "units": "1", "anchor": "math245c", "description": "Various topics in Lie groups and Lie algebras, including structure theory, representation theory, and applications. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)"}
{"code": "MATH 257A", "title": "Topics in Differential Geometry", "units": "4", "anchor": "math245c", "description": "Introduction to varied topics in differential geometry. In recent years, topics have included Morse theory and general relativity. May be taken for credit six times with consent of adviser. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor."}
{"code": "MATH 257B", "title": "Further Topics in Differential Geometry", "units": "4", "anchor": "math245c", "description": "Continued development of a topic in differential geometry. Topics include Morse theory and general relativity. May be taken for credit three times with consent of adviser. Prerequisites: MATH 257A. Students who have not completed MATH 257A may enroll with consent of instructor.", "prereqs": "MATH 257A"}
{"code": "MATH 258", "title": "Seminar in Differential Geometry", "units": "1", "anchor": "math245c", "description": "Various topics in differential geometry. May be taken for credit nine times. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)"}
{"code": "MATH 259A-B-C", "title": ". Geometrical Physics", "units": "4-4-4", "anchor": "math245c", "description": "Manifolds, differential forms, homology, deRham’s theorem. Riemannian geometry, harmonic forms. Lie groups and algebras, connections in bundles, homotopy sequence of a bundle, Chern classes. Applications selected from Hamiltonian and continuum mechanics, electromagnetism, thermodynamics, special and general relativity, Yang-Mills fields. Prerequisites: graduate standing in mathematics, physics, or engineering, or consent of instructor."}
{"code": "MATH 260A", "title": "Mathematical Logic I", "units": "4", "anchor": "math245c", "description": "Propositional calculus and first-order logic. Theorem proving, Model theory, soundness, completeness, and compactness, Herbrand’s theorem, Skolem-Lowenheim theorems, Craig interpolation. Prerequisites: graduate standing or consent of instructor."}
{"code": "MATH 260B", "title": "Mathematical Logic II", "units": "4", "anchor": "math245c", "description": "Theory of computation and recursive function theory, Church’s thesis, computability and undecidability. Feasible computability and complexity. Peano arithmetic and the incompleteness theorems, nonstandard models. Prerequisites: MATH 260A or consent of instructor.", "prereqs": "MATH 260A"}
{"code": "MATH 261A", "title": "Probabilistic Combinatorics and Algorithms", "units": "4", "anchor": "math245c", "description": "Introduction to the probabilistic method. Combinatorial applications of the linearity of expectation, second moment method, Markov, Chebyschev, and Azuma inequalities, and the local limit lemma. Introduction to the theory of random graphs. Prerequisites: graduate standing or consent of instructor."}
{"code": "MATH 261B", "title": "Probabilistic Combinatorics and Algorithms II", "units": "4", "anchor": "math245c", "description": "Introduction to probabilistic algorithms. Game theoretic techniques. Applications of the probabilistic method to algorithm analysis. Markov Chains and Random walks. Applications to approximation algorithms, distributed algorithms, online and parallel algorithms. MATH 261A must be taken before MATH 261B. Prerequisites: MATH 261A.", "prereqs": "MATH 261A"}
{"code": "MATH 261C", "title": "Probabilistic Combinatorics and Algorithms III", "units": "4", "anchor": "math245c", "description": "Advanced topics in the probabilistic combinatorics and probabilistic algorithms. Random graphs. Spectral Methods. Network algorithms and optimization. Statistical learning. MATH 261B must be taken before MATH 261C. Prerequisites: MATH 261B.", "prereqs": "MATH 261B"}
{"code": "MATH 262A", "title": "Topics in Combinatorial Mathematics", "units": "4", "anchor": "math245c", "description": "Introduction to varied topics in combinatorial mathematics. In recent years topics have included problems of enumeration, existence, construction, and optimization with regard to finite sets. Recommended preparation: some familiarity with computer programming desirable but not required. May be taken for credit six times with consent of adviser as topics vary.  Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor."}
{"code": "MATH 262B", "title": "Further Topics in Combinatorial Mathematics", "units": "4", "anchor": "math245c", "description": "Continued development of a topic in combinatorial mathematics. Topics include problems of enumeration, existence, construction, and optimization with regard to finite sets. Recommended preparation: some familiarity with computer programming desirable but not required. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 262A. Students who have not completed MATH 262A may enroll with consent of instructor.", "prereqs": "MATH 262A"}
{"code": "MATH 264A-B-C", "title": ". Combinatorics", "units": "4-4-4", "anchor": "math245c", "description": "Topics from partially ordered sets, Mobius functions, simplicial complexes and shell ability. Enumeration, formal power series and formal languages, generating functions, partitions. Lagrange inversion, exponential structures, combinatorial species. Finite operator methods, q-analogues, Polya theory, Ramsey theory. Representation theory of the symmetric group, symmetric functions and operations with Schur functions."}
{"code": "MATH 267A", "title": "Topics in Mathematical Logic", "units": "4", "anchor": "math245c", "description": "Introduction to varied topics in mathematical logic. Topics chosen from recursion theory, model theory, and set theory. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: graduate standing or consent of instructor. Nongraduate students may enroll with consent of instructor."}
{"code": "MATH 267B", "title": "Further Topics in Mathematical Logic", "units": "4", "anchor": "math245c", "description": "Continued development of a topic in mathematical logic. Topics chosen from recursion theory, model theory, and set theory. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 267A or consent of instructor. Students who have not completed MATH 267A may enroll with consent of instructor.", "prereqs": "MATH 267A"}
{"code": "MATH 268", "title": "Seminar in Logic", "units": "1", "anchor": "math245c", "description": "Various topics in logic. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)"}
{"code": "MATH 269", "title": "Seminar in Combinatorics", "units": "1", "anchor": "math245c", "description": "Various topics in combinatorics. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)"}
{"code": "MATH 270A", "title": "Numerical Linear Algebra", "units": "4", "anchor": "math245c", "description": "Error analysis of the numerical solution of linear equations and least squares problems for the full rank and rank deficient cases. Error analysis of numerical methods for eigenvalue problems and singular value problems. Iterative methods for large sparse systems of linear equations. Prerequisites: graduate standing or consent of instructor."}
{"code": "MATH 270B", "title": "Numerical Approximation and Nonlinear Equations", "units": "4", "anchor": "math245c", "description": "Iterative methods for nonlinear systems of equations, Newton’s method. Unconstrained and constrained optimization. The Weierstrass theorem, best uniform approximation, least-squares approximation, orthogonal polynomials. Polynomial interpolation, piecewise polynomial interpolation, piecewise uniform approximation. Numerical differentiation: divided differences, degree of precision. Numerical quadrature: interpolature quadrature, Richardson extrapolation, Romberg Integration, Gaussian quadrature, singular integrals, adaptive quadrature. Prerequisites: MATH 270A or consent of instructor.", "prereqs": "MATH 270A"}
{"code": "MATH 270C", "title": "Numerical Ordinary Differential Equations", "units": "4", "anchor": "math245c", "description": "Initial value problems (IVP) and boundary value problems (BVP) in ordinary differential equations. Linear methods for IVP: one and multistep methods, local truncation error, stability, convergence, global error accumulation. Runge-Kutta (RK) Methods for IVP: RK methods, predictor-corrector methods, stiff systems, error indicators, adaptive time-stepping. Finite difference, finite volume, collocation, spectral, and finite element methods for BVP; a priori and a posteriori error analysis, stability, convergence, adaptivity. Prerequisites: MATH 270B or consent of instructor.", "prereqs": "MATH 270B"}
{"code": "MATH 271A-B-C", "title": ". Numerical Optimization", "units": "4-4-4", "anchor": "math245c", "description": "Formulation and analysis of algorithms for constrained optimization. Optimality conditions; linear and quadratic programming; interior methods; penalty and barrier function methods; sequential quadratic programming methods. Prerequisites: consent of instructor."}
{"code": "MATH 272A", "title": "Numerical Partial Differential Equations I", "units": "4", "anchor": "math245c", "description": "Survey of discretization techniques for elliptic partial differential equations, including finite difference, finite element and finite volume methods. Lax-Milgram Theorem and LBB stability. A priori error estimates. Mixed methods. Convection-diffusion equations. Systems of elliptic PDEs. Prerequisites: graduate standing or consent of instructor."}
{"code": "MATH 272B", "title": "Numerical Partial Differential Equations II", "units": "4", "anchor": "math245c", "description": "Survey of solution techniques for partial differential equations. Basic iterative methods. Preconditioned conjugate gradients. Multigrid methods. Hierarchical basis methods. Domain decomposition. Nonlinear PDEs. Sparse direct methods. Prerequisites: MATH 272A or consent of instructor.", "prereqs": "MATH 272A"}
{"code": "MATH 272C", "title": "Numerical Partial Differential Equations III", "units": "4", "anchor": "math245c", "description": "Time dependent (parabolic and hyperbolic) PDEs. Method of lines. Stiff systems of ODEs. Space-time finite element methods. Adaptive meshing algorithms. A posteriori error estimates. Prerequisites: MATH 272B or consent of instructor.", "prereqs": "MATH 272B"}
{"code": "MATH 273A", "title": "Advanced Techniques in Computational Mathematics I", "units": "4", "anchor": "math245c", "description": "Models of physical systems, calculus of variations, principle of least action. Discretization techniques for variational problems, geometric integrators, advanced techniques in numerical discretization. Project-oriented; projects designed around problems of current interest in science, mathematics, and engineering. Prerequisites: graduate standing or consent of instructor."}
{"code": "MATH 273B", "title": "Advanced Techniques in Computational Mathematics II", "units": "4", "anchor": "math245c", "description": "Nonlinear functional analysis for numerical treatment of nonlinear PDE. Numerical continuation methods, pseudo-arclength continuation, gradient flow techniques, and other advanced techniques in computational nonlinear PDE. Project-oriented; projects designed around problems of current interest in science, mathematics, and engineering. Prerequisites: MATH 273A or consent of instructor.", "prereqs": "MATH 273A"}
{"code": "MATH 273C", "title": "Advanced Techniques in Computational Mathematics III", "units": "4", "anchor": "math245c", "description": "Adaptive numerical methods for capturing all scales in one model, multiscale and multiphysics modeling frameworks, and other advanced techniques in computational multiscale/multiphysics modeling. Project-oriented; projects designed around problems of current interest in science, mathematics, and engineering. Prerequisites: MATH 273B or consent of instructor.", "prereqs": "MATH 273B"}
{"code": "MATH 274", "title": "Numerical Methods for Physical Modeling", "units": "4", "anchor": "math245c", "description": "(Conjoined with MATH 174.) Floating point arithmetic, direct and iterative solution of linear equations, iterative solution of nonlinear equations, optimization, approximation theory, interpolation, quadrature, numerical methods for initial and boundary value problems in ordinary differential equations. Students may not receive credit for both MATH 174 and PHYS 105, AMES 153 or 154. (Students may not receive credit for MATH 174 if MATH 170A, B, or C has already been taken.) Graduate students will complete an additional assignment/exam. Prerequisites: MATH 20D or 21D, and either MATH 20F or MATH 31AH, or consent of instructor.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 20D", "MATH 21D"]}, {"type": "one", "courses": ["MATH 20F", "MATH 31AH"]}]}}
{"code": "MATH 275", "title": "Numerical Methods for Partial Differential Equations", "units": "4", "anchor": "math245c", "description": "(Conjoined with MATH 175.) Mathematical background for working with partial differential equations. Survey of finite difference, finite element, and other numerical methods for the solution of elliptic, parabolic, and hyperbolic partial differential equations. (Formerly MATH 172; students may not receive credit for MATH 175/275 and MATH 172.) Graduate students will do an extra paper, project, or presentation, per instructor. Prerequisites: MATH 174 or MATH 274 or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 174", "MATH 274"]}}
{"code": "MATH 276", "title": "Numerical Analysis in Multiscale Biology", "units": "4", "anchor": "math245c", "description": "(Cross-listed with BENG 276/CHEM 276.) Introduces mathematical tools to simulate biological processes at multiple scales. Numerical methods for ordinary and partial differential equations (deterministic and stochastic), and methods for parallel computing and visualization. Hands-on use of computers emphasized, students will apply numerical methods in individual projects. Prerequisites: consent of instructor."}
{"code": "MATH 277A", "title": "Topics in Computational and Applied Mathematics", "units": "4", "anchor": "math245c", "description": "Introduction to varied topics in computational and applied mathematics. In recent years, topics have included applied functional analysis and approximation theory; numerical treatment of nonlinear partial differential equations; and geometric numerical integration for differential equations. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor."}
{"code": "MATH 278A", "title": "Seminar in Computational and Applied Mathematics", "units": "1", "anchor": "math245c", "description": "Various topics in computational and applied mathematics. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor. (S/U grade only.)"}
{"code": "MATH 278B", "title": "Seminar in Mathematics of Information, Data, and Signals", "units": "1", "anchor": "math245c", "description": "Various topics in the mathematics of information, data, and signals. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)"}
{"code": "MATH 278C", "title": "Seminar in Optimization", "units": "1", "anchor": "math245c", "description": "Various topics in optimization and applications. May be taken for credit nine times. Prerequisites: graduate standing. (S/U grade only.)"}
{"code": "MATH 279", "title": "Projects in Computational and Applied Mathematics", "units": "4", "anchor": "math279", "description": "(Conjoined with MATH 179.) Mathematical models of physical systems arising in science and engineering, good models and well-posedness, numerical and other approximation techniques, solution algorithms for linear and nonlinear approximation problems, scientific visualizations, scientific software design and engineering, project-oriented. Graduate students will do an extra paper, project, or presentation per instructor. Prerequisites: MATH 174, or MATH 274, or consent of instructor.", "prereqs": {"type": "one", "courses": ["MATH 174", "MATH 274"]}}
{"code": "MATH 280A", "title": "Probability Theory I", "units": "4", "anchor": "math279", "description": "This is the first course in a three-course sequence in probability theory. Topics covered in the sequence include the measure-theoretic foundations of probability theory, independence, the Law of Large Numbers, convergence in distribution, the Central Limit Theorem, conditional expectation, martingales, Markov processes, and Brownian motion. Recommended preparation: completion of real analysis equivalent to MATH 140A-B strongly recommended. Prerequisites: graduate standing."}
{"code": "MATH 280B", "title": "Probability Theory II", "units": "4", "anchor": "math279", "description": "This is the second course in a three-course sequence in probability theory. Topics covered in the sequence include the measure-theoretic foundations of probability theory, independence, the Law of Large Numbers, convergence in distribution, the Central Limit Theorem, conditional expectation, martingales, Markov processes, and Brownian motion. Prerequisites: a grade of B or better required in MATH 280A. Students who have not completed MATH 280A may enroll with consent of instructor.", "prereqs": "MATH 280A"}
{"code": "MATH 280C", "title": "Probability Theory III", "units": "4", "anchor": "math279", "description": "This is the third course in a three-course sequence in probability theory. Topics covered in the sequence include the measure-theoretic foundations of probability theory, independence, the Law of Large Numbers, convergence in distribution, the Central Limit Theorem, conditional expectation, martingales, Markov processes, and Brownian motion. Prerequisites: a grade of B or better required in MATH 280B. Students who have not completed MATH 280B may enroll with consent of instructor.", "prereqs": "MATH 280B"}
{"code": "MATH 281A", "title": "Mathematical Statistics", "units": "4", "anchor": "math279", "description": "Statistical models, sufficiency, efficiency, optimal estimation, least squares and maximum likelihood, large sample theory. Prerequisites: advanced calculus and basic probability theory or consent of instructor."}
{"code": "MATH 281B", "title": "Mathematical Statistics", "units": "4", "anchor": "math279", "description": "Hypothesis testing and confidence intervals, one-sample and two-sample problems. Bayes theory, statistical decision theory, linear models and regression. Prerequisites: advanced calculus and basic probability theory or consent of instructor."}
{"code": "MATH 281C", "title": "Mathematical Statistics", "units": "4", "anchor": "math279", "description": "Nonparametrics: tests, regression, density estimation, bootstrap and jackknife. Introduction to statistical computing using S plus. Prerequisites: advanced calculus and basic probability theory or consent of instructor."}
{"code": "MATH 282A", "title": "Applied Statistics I", "units": "4", "anchor": "math279", "description": "General theory of linear models with applications to regression analysis. Ordinary and generalized least squares estimators and their properties. Hypothesis testing, including analysis of variance, and confidence intervals. Completion of courses in linear algebra and basic statistics are recommended prior to enrollment. Prerequisites: graduate standing or consent of instructor. (S/U grades permitted.)"}
{"code": "MATH 282B", "title": "Applied Statistics II", "units": "4", "anchor": "math279", "description": "Diagnostics, outlier detection, robust regression. Variable selection, ridge regression, the lasso. Generalized linear models, including logistic regression. Data analysis using the statistical software R. Students who have not taken MATH 282A may enroll with consent of instructor. Prerequisites: MATH 282A or consent of instructor. (S/U grades permitted.)", "prereqs": "MATH 282A"}
{"code": "MATH 283", "title": "Statistical Methods in Bioinformatics", "units": "4", "anchor": "math279", "description": "This course will cover material related to the analysis of modern genomic data; sequence analysis, gene expression/functional genomics analysis, and gene mapping/applied population genetics. The course will focus on statistical modeling and inference issues and not on database mining techniques. Prerequisites: one year of calculus, one statistics course or consent of instructor."}
{"code": "MATH 284", "title": "Lifetime Data Analysis", "units": "4", "anchor": "math279", "description": "Survival analysis is an important tool in many areas of applications including biomedicine, economics, engineering. It deals with the analysis of time to events data with censoring. This course discusses the concepts and theories associated with survival data and censoring, comparing survival distributions, proportional hazards regression, nonparametric tests, competing risk models, and frailty models. The emphasis is on semiparametric inference, and material is drawn from recent literature. Students who have not completed listed prerequisites may enroll with consent of instructor. Prerequisites: MATH 282A. Students who have not completed listed prerequisite may enroll with consent of instructor.", "prereqs": "MATH 282A"}
{"code": "MATH 285", "title": "Stochastic Processes", "units": "4", "anchor": "math279", "description": "Elements of stochastic processes, Markov chains, hidden Markov models, martingales, Brownian motion, Gaussian processes. Recommended preparation: completion of undergraduate probability theory (equivalent to MATH 180A) highly recommended. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor."}
{"code": "MATH 286", "title": "Stochastic Differential Equations", "units": "4", "anchor": "math279", "description": "Review of continuous martingale theory. Stochastic integration for continuous semimartingales. Existence and uniqueness theory for stochastic differential equations. Strong Markov property. Selected applications. Prerequisites: MATH 280A-B or consent of instructor.", "prereqs": {"type": "all", "courses": ["MATH 280A", "MATH 280B"]}}
{"code": "MATH 287A", "title": "Time Series Analysis", "units": "4", "anchor": "math279", "description": "Discussion of finite parameter schemes in the Gaussian and non-Gaussian context. Estimation for finite parameter schemes. Stationary processes and their spectral representation. Spectral estimation. Students who have not taken MATH 282A may enroll with consent of instructor. Prerequisites: MATH 282A or consent of instructor.", "prereqs": "MATH 282A"}
{"code": "MATH 287B", "title": "Multivariate Analysis", "units": "4", "anchor": "math279", "description": "Bivariate and more general multivariate normal distribution. Study of tests based on Hotelling’s T2. Principal components, canonical correlations, and factor analysis will be discussed as well as some competing nonparametric methods, such as cluster analysis. Students who have not taken MATH 282A may enroll with consent of instructor. Prerequisites: MATH 282A or consent of instructor.", "prereqs": "MATH 282A"}
{"code": "MATH 287C", "title": "Advanced Time Series Analysis", "units": "4", "anchor": "math279", "description": "Nonparametric function (spectrum, density, regression) estimation from time series data. Nonlinear time series models (threshold AR, ARCH, GARCH, etc.). Nonparametric forms of ARMA and GARCH. Multivariate time series. Students who have not taken MATH 287A may enroll with consent of instructor. Prerequisites: MATH 287A or consent of instructor.", "prereqs": "MATH 287A"}
{"code": "MATH 287D", "title": "Statistical Learning", "units": "4", "anchor": "math287d", "description": "Topics include regression methods: (penalized) linear regression and kernel smoothing; classification methods: logistic regression and support vector machines; model selection; and mathematical tools and concepts useful for theoretical results such as VC dimension, concentration of measure, and empirical processes. Students who have not taken MATH 282A may enroll with consent of instructor. Prerequisites: MATH 282A or consent of instructor.", "prereqs": "MATH 282A"}
{"code": "MATH 288", "title": "Seminar in Probability and Statistics", "units": "1", "anchor": "math287d", "description": "Various topics in probability and statistics. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)"}
{"code": "MATH 289A", "title": "Topics in Probability and Statistics", "units": "4", "anchor": "math287d", "description": "Introduction to varied topics in probability and statistics. In recent years, topics have included Markov processes, martingale theory, stochastic processes, stationary and Gaussian processes, ergodic theory. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor."}
{"code": "MATH 289B", "title": "Further Topics in Probability and Statistics", "units": "4", "anchor": "math287d", "description": "Continued development of a topic in probability and statistics. Topics include Markov processes, martingale theory, stochastic processes, stationary and Gaussian processes, ergodic theory. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 289A. Students who have not completed MATH 289A may enroll with consent of instructor.", "prereqs": "MATH 289A"}
{"code": "MATH 289C", "title": "Exploratory Data Analysis and Inference", "units": "4", "anchor": "math287d", "description": "An introduction to various quantitative methods and statistical techniques for analyzing data—in particular big data. Quick review of probability continuing to topics of how to process, analyze, and visualize data using statistical language R. Further topics include basic inference, sampling, hypothesis testing, bootstrap methods, and regression and diagnostics. Offers conceptual explanation of techniques, along with opportunities to examine, implement, and practice them in real and simulated data. Recommended preparation: familiarity with linear algebra and mathematical statistics highly recommended. Prerequisites: graduate standing."}
{"code": "MATH 290A-B-C", "title": ". Topology", "units": "4-4-4", "anchor": "math287d", "description": "Point set topology, including separation axioms, compactness, connectedness. Algebraic topology, including the fundamental group, covering spaces, homology and cohomology. Homotopy or applications to manifolds as time permits. Prerequisites: MATH 100A-B-C and MATH 140A-B-C.", "prereqs": {"type": "all", "courses": ["MATH 100A", "MATH 100B", "MATH 100C", "MATH 140A", "MATH 140B", "MATH 140C"]}}
{"code": "MATH 291A", "title": "Topics in Topology", "units": "4", "anchor": "math287d", "description": "Introduction to varied topics in topology. In recent years topics have included generalized cohomology theory, spectral sequences, K-theory, homotophy theory. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor."}
{"code": "MATH 291B", "title": "Further Topics in Topology", "units": "4", "anchor": "math287d", "description": "Continued development of a topic in topology. Topics include generalized cohomology theory, spectral sequences, K-theory, homotophy theory. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 291A. Students who have not completed MATH 291A may enroll with consent of instructor.", "prereqs": "MATH 291A"}
{"code": "MATH 292", "title": "Seminar in Topology", "units": "1", "anchor": "math287d", "description": "Various topics in topology. May be taken for credit nine times. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)"}
{"code": "MATH 294", "title": "The Mathematics of Finance", "units": "4", "anchor": "math287d", "description": "Introduction to the mathematics of financial models. Hedging, pricing by arbitrage. Discrete and continuous stochastic models. Martingales. Brownian motion, stochastic calculus. Black-Scholes model, adaptations to dividend paying equities, currencies and coupon-paying bonds, interest rate market, foreign exchange models. Prerequisites: MATH 180A (or equivalent probability course) or consent of instructor.", "prereqs": "MATH 180A"}
{"code": "MATH 295", "title": "Special Topics in Mathematics", "units": "1 to 4", "anchor": "math287d", "description": "A variety of topics and current research results in mathematics will be presented by staff members and students under faculty direction."}
{"code": "MATH 296", "title": "Graduate Student Colloquium", "units": "1", "anchor": "math287d", "description": "A variety of advanced topics and current research in mathematics will be presented by department faculty. (S/U grades only.) May be taken for credit six times. Prerequisites: graduate standing."}
{"code": "MATH 297", "title": "Mathematics Graduate Research Internship", "units": "2–4", "anchor": "math287d", "description": "An enrichment program that provides work experience with public/private sector employers and researchers. Under supervision of a faculty adviser, students provide mathematical consultation services. Prerequisites: consent of instructor."}
{"code": "MATH 299", "title": "Reading and Research", "units": "1 to 12", "anchor": "math287d", "description": "Independent study and research for the doctoral dissertation. One to three credits will be given for independent study (reading) and one to nine for research. Prerequisites: consent of instructor. (S/U grades permitted.)"}
{"code": "MATH 500", "title": "Teaching Assistant Training", "units": "2 or 4", "anchor": "math287d", "description": "A course in which teaching assistants are aided in learning proper teaching methods through faculty-led discussions, preparation and grading of examinations and other written exercises, academic integrity, and student interactions. Number of units for credit depends on number of hours devoted to teaching assistant duties. May be taken for credit up to nine times for a maximum of thirty-six units. Must have concurrent teaching assistant appointment in mathematics. Prerequisites: consent of adviser. (S/U grades only.)"}
