{"code": "MBC", "name": "Marine Biodiversity and Conservation", "link": "https://catalog.ucsd.edu/courses/MBC.html"}
{"code": "SIO 295S", "title": "Introduction to Marine Biodiversity and Conservation—Seminar", "units": "8", "anchor": "sio295s", "description": "Lectures on ecological, economic, social, and legal issues related to marine biodiversity and case studies on socioeconomic and legal issues. Students are expected to attend field trips at sea and to various sites around San Diego County as part of the corequisite course. Students who have taken SIO 295 may not receive credit for SIO 295S. Prerequisites: consent of instructors. Corequisites: SIO 295LS and MAS students only.", "coreqs": "SIO 295LS"}
{"code": "SIO 295LS", "title": "Introduction to Marine Biodiversity and Conservation—Lab", "units": "8", "anchor": "sio295ls", "description": "Laboratory work on major biological taxa, field trips on biodiversity in situ, computer labs for informatic tools. Students are expected to attend field trips at sea and to various sites around San Diego County as part of the course. Students who have taken SIO 295L may not receive credit for SIO 295LS. Prerequisites: consent of instructor. Corequisites: SIO 295S and MAS students only.", "coreqs": "SIO 295S"}
{"code": "MBC 258", "title": "Marine Conservation and Communication Practicum 1", "units": "2", "anchor": "mbc258", "description": "This is the first of two required courses in a sequence for MAS-MBC students, which focuses on generation and refinement of MAS-MBC Capstone Projects, professional networking, and development of critical technical and practical skills. Students broaden understanding of and discuss complex political, social, economic, and historical issues related to marine conservation, give peer feedback on Capstone ideas, and interact with MBC leadership and invited guests. May be taken for credit three times. Prerequisites: SIO 295S and SIO 295LS summer courses. Limited to registered students in MAS Marine Biodiversity and Conservation program.", "prereqs": {"type": "all", "courses": ["SIO 295S", "SIO 295LS"]}}
{"code": "MBC 259", "title": "Marine Conservation and Communication Practicum 2", "units": "2", "anchor": "mbc259", "description": "This is the culmination of a required two-course sequence for MAS-MBC students, which focuses on continued refinement of MAS-MBC Capstone Projects, professional networking, and development of critical technical and practical skills. Students deepen understanding of and discuss complex political, social, economic, and historical issues related to marine conservation, give peer feedback on Capstone ideas, and interact with MBC leadership and invited guests. May be taken for credit three times. Prerequisites: MBC 258. Limited to registered students in MAS Marine Biodiversity and Conservation program.", "prereqs": "MBC 258"}
{"code": "MBC 296", "title": "Capstone Independent Study Project", "units": "6", "anchor": "mbc296", "description": "Building on knowledge and experience gained in the MAS Program in Marine Biodiversity and Conservation, students will design and execute a complex, interdisciplinary marine or coastal conservation project with a theoretical grounding and real-world application. This self-directed project will consider varied worldviews and perspectives and add value to the current seascape of marine biodiversity and conservation. Students will present final deliverables in an annual Capstone Symposium in June. Prerequisites: SIOB 258. MBC 296 is restricted to students in the Master of Advanced Studies—Marine Biodiversity and Conservation Program (SI83).", "prereqs": "SIOB 258"}
