{"code": "MSED", "name": "Mathematics and Science Education", "link": "https://catalog.ucsd.edu/courses/MSED.html"}
{"code": "MSED 290", "title": "Issues in Science Education Research", "units": "4", "anchor": "msed290", "description": "Survey of recent literature highlighting critical issues in science education research. Specific focus on research in biology education, chemistry education, and physics education. Theoretical perspectives and research methodology (both qualitative and quantitative) used to understand learning will be discussed. Prerequisites: admission to the Joint Doctoral Program in Mathematics and Science Education or a master’s degree in biology, chemistry/biochemistry, mathematics, or physics with consent of instructor."}
{"code": "MSED 294", "title": "Teaching Practicum", "units": "4", "anchor": "msed294", "description": "In this course, the graduate student will teach or assist a teacher in a K–12 setting. The graduate student will have the mentorship of the classroom teacher as well as the supervision of an MSED faculty member. Prerequisites: admission to the Joint Doctoral Program in Mathematics and Science Education. (S/U grades only.)"}
{"code": "MSED 295", "title": "MSED Orientation Practicum", "units": "1–3", "anchor": "msed295", "description": "Each practicum lasts five weeks and is designed to inform students about a faculty member’s research program. Assignment as a research assistant may be used as one practicum. This course should be taken during the first year. May be taken for credit three times. Prerequisites: admission to MSED Joint Doctoral Program. (S/U grades only.)"}
{"code": "MSED 296A", "title": "Theories and Applications of Mathematics and Science Education", "units": "4", "anchor": "msed296a", "description": "The course is designed to cover several major themes in mathematics and science education. It will address theories and applications of cognition, teaching and learning, and curriculum, with particular emphasis on international perspectives. This is a three-quarter sequence. Prerequisites: admission to the Joint Doctoral Program in Mathematics and Science Education or a master’s degree in biology, chemistry/biochemistry, mathematics, or physics with consent of instructor."}
{"code": "MSED 296B", "title": "Theories and Applications of Mathematics and Science Education", "units": "4", "anchor": "msed296b", "description": "The course is designed to cover several major themes in mathematics and science education. It will address theories and applications of cognition, teaching and learning, and curriculum, with particular emphasis on international perspectives. This is a three-quarter sequence. Prerequisites: admission to the Joint Doctoral Program in Mathematics and Science Education or a master’s degree in biology, chemistry/biochemistry, mathematics, or physics with consent of instructor. MSED 296A must be taken before MSED 296B."}
{"code": "MSED 296C", "title": "Theories and Applications of Mathematics and Science Education", "units": "4", "anchor": "msed296c", "description": "The course is designed to cover several major themes in mathematics and science education. It will address theories and applications of cognition, teaching and learning, and curriculum, with particular emphasis on international perspectives. This is a three quarter sequence. Prerequisites: admission to the Joint Doctoral Program in Mathematics and Science Education or a master’s degree in biology, chemistry/biochemistry, mathematics, or physics with consent of instructor. MSED 296B must be taken before MSED 296C."}
{"code": "MSED 297", "title": "Special Topics in Math and Science Education", "units": "1–4", "anchor": "msed297", "description": "Study of special topics in mathematics or science education under direction of a faculty member. Prerequisites: consent of instructor."}
{"code": "MSED 298", "title": "Research Project", "units": "2–12", "anchor": "msed298", "description": "Students will work on an independent research project under the supervision of MSED faculty."}
{"code": "MSED 299", "title": "Reading and Research", "units": "1–12", "anchor": "msed299", "description": "Students will do independent study and research in preparation of their doctoral dissertation under the supervision of MSED faculty."}
