{"code": "SCIS", "name": "Science Studies", "link": "https://catalog.ucsd.edu/courses/SCIS.html"}
{"code": "ANTH 227", "title": "Living in an Emotional World", "units": "4", "description": "This course examines the relationship between culture and emotions. It thinks about emotions as sources of knowledge, but also historicizes the delegitimization of emotions in social science and other disciplines. Each week, we will explore one emotion, including anger, shame, and hope. Prerequisites: graduate standing."}
{"code": "ANTH 267", "title": "Decolonizing Ethnography: Ethics, Politics, and Praxis", "units": "4", "description": "Despite being foundational to the discipline of anthropology, ethnographic methods are often mystifying to graduate students. Students are expected to simply go into their respective field sites armed with a notebook, voice recorder, and hope. Drawing on feminist and decolonial epistemologies, we will examine, critique, and reconstruct ethnography’s dilemmas, changing forms, and ethical stakes as we understand it as a particular mode of writing and representation. Prerequisites: graduate standing."}
{"code": "COGR 201D", "title": "Historical Methods for Communication Research", "units": "4", "description": "Different approaches to conducting historical research in communication. Such approaches may include the social history of communication technology; structuralist and poststructuralist accounts of language, media, and collective memory; and new historicist treatments of cultural history. Sources, documentation, and the nature of argument from historical evidence are emphasized. Prerequisites: graduate standing or consent of instructor."}
{"code": "COGR 201M", "title": "Content Analysis", "units": "4", "description": "History uses methodology of quantitative analysis of media content. Includes conceptual issues concerning the quantification of meaning and practical procedures for coding and data analysis. Students read examples of studies using content analysis and carry out their own pilot analyses. Prerequisites: graduate standing or consent of instructor."}
{"code": "COGR 243", "title": "Media Technologies", "units": "4", "description": "Media technologies from books to electronic media. Consideration of both technological design processes and shifting uses of media. Reflection on media and broader patterns of technological innovation. Attention to the distinctive role of media in technological change. Prerequisites: graduate standing or consent of instructor."}
{"code": "COGR 275", "title": "Topics in Communication", "units": "4", "description": "Specialized study in communication, with topics to be determined by the instructor for any given quarter."}
{"code": "HIGR 206", "title": "Histories of the Body", "units": "4", "description": "Historical topics related to the human body as a target of regulation, a site for the production of knowledge, the locus of an identity shaped by race, gender, and sexuality, and/or in terms of movement across geopolitical boundaries."}
{"code": "HIGR 236A-B", "title": ". Seminar in History of Science", "units": "4-4", "description": "A two-quarter research seminar, comprising intensive study of a specific topic in the history of science. The first quarter will be devoted to readings and discussions; the second chiefly to the writing of individual research papers. The topic varies from year to year, and students may repeat the course for credit. (IP grade to be awarded the first quarter; final grade will be given at the end of the second quarter.) Prerequisites: graduate standing."}
{"code": "HISC 163", "title": ". History, Science, and Politics of Climate Change", "units": "4", "description": "The complex historical development of human understanding of global climate change, including key scientific work, and the cultural dimensions of proof and persuasion. Special emphasis on the differential political acceptance of the scientific evidence in the U.S. and the world. Graduate students are required to submit an additional paper. Prerequisites: upper-division or graduate standing; department stamp required."}
{"code": "HISC 167", "title": ". Gender and Science", "units": "4", "description": "Why have women been traditionally excluded from science? How has this affected scientific knowledge? How have scientists constructed gendered representations not only of women, but also of science and nature? We will address these questions from perspectives including history, philosophy, and psychoanalytic theory. Prerequisites: upper-division standing or consent of instructor."}
{"code": "HISC 173", "title": ". Seminar on Darwin and Darwinisms", "units": "4", "description": "Examines evolutionary theory before Darwin, the development of the theory of natural selection, the ongoing challenge from Lamarckism, nineteenth-century social Darwinism, the emergence of the neo-Darwinist synthesis, and the recent controversies over evolutionary psychology and creationism. Graduate students are expected to submit an additional paper. Prerequisites: upper-division or graduate standing and department stamp."}
{"code": "HISC 180", "title": ". Science and Public Policy", "units": "4", "description": "This course will explore the evolution of the institutions, ideologies, procedures, standards, and expertise that modern democratic societies have used in applying science to generate and legitimate public policy. Graduate students are required to submit an additional paper. Prerequisites: upper-division or graduate standing and department stamp required."}
{"code": "PHIL 204A", "title": "Core Course in Philosophy of Science", "units": "4", "description": "An introduction to one or more central problems in the philosophy of science, or in the philosophy of one of the particular sciences, such as the nature of confirmation and explanation, the nature of scientific knowledge, reductionism, the unity of science, or realism and antirealism. May be taken for credit three times with changed content."}
{"code": "PHIL 245", "title": "Philosophy of Science", "units": "4", "description": "This seminar will cover current books and theoretical issues in the philosophy of science. May be taken for credit seven times with changed content."}
{"code": "PHIL 280", "title": "Philosophy of Science Topics and Methods", "units": "1–2", "description": "This course meets weekly to discuss recent books or articles in philosophy of science. The reading is designed both for students doing active research in the field and for those seeking to gain some familiarity with it. Can be taken nine times for credit with changed content. Prerequisites: graduate standing or consent of instructor."}
{"code": "PHIL 285", "title": "Seminar on Special Topics", "units": "4", "description": "(This course is only applicable for Science Studies credit when topic is Philosophy of Science.) Focused examination of specific problems or themes in some area of philosophy. May be taken for credit nine times with changed content."}
{"code": "SOCG 234", "title": "Intellectual Foundation of the Study of Science, Technology, and Medicine", "units": "4", "description": "This course focuses on some classic methodological and theoretical resources upon which the sociology of science, technology, and medicine all draw. It gives special attention to relationships between knowledge and social order, and between knowledge and practice, that are common to science, technology, and medicine. Prerequisites: graduate standing."}
{"code": "SOCG 238", "title": "Survey of the Sociology of Scientific Knowledge", "units": "4", "description": "An introduction to some enduring topics in the sociology of scientific knowledge and to some resources for addressing them. Attention is drawn to problems of accounting for scientific order and change, and to recurrent debates over the proper method for sociological accounts of science. Prerequisites: graduate standing."}
{"code": "SOCG 247", "title": "Madness and Society", "units": "4", "description": "An examination of the changing Western responses from the age of Bedlam to the age of Prozac. Topics include: the rise and decline of the total institution; the emergence of psychiatry; changing cultural meanings of madness; and the therapeutics of mental disorder. Prerequisites: graduate standing."}
{"code": "SOCG 284", "title": "Contemporary Biomedicine", "units": "4", "description": "Develops central themes in medical sociology in order to understand twentieth- and twenty-first-century medical practice and research. Topics include authority and expertise; health inequalities; managed care; health activism; biomedical knowledge production; and the construction of medical objects and subjects. Prerequisites: graduate standing."}
