{"code": "SE", "name": "Structural Engineering", "link": "https://catalog.ucsd.edu/courses/SE.html"}
{"code": "SE 1", "title": "Introduction to Structures and Design", "units": "4", "anchor": "se1", "description": "Introduction to fundamentals of structures and how structures work. Overview of structural behavior and structural design process through hands-on projects. Lessons learned from structural failures. Professional ethics. Role and responsibility of structural engineers. Introduction to four structural engineering focus sequences. Program or materials fees may apply. Enrollment restricted to SE27 majors only."}
{"code": "SE 3", "title": "Graphical Communication for Engineering Design", "units": "4", "anchor": "se3", "description": "Use of computer graphics (CAD software) to communicate engineering designs. Includes visualization, sketching, 2D and 3D graphics standards, dimensioning, tolerance, assemblies, and prototyping/testing with light manufacturing methods. Project/system management software, i.e., building information modeling (BIM), will be introduced. Use of computer resources. Prerequisites: SE 1", "prereqs": "SE 1"}
{"code": "SE 7", "title": "Spatial Visualization", "units": "1", "anchor": "se7", "description": "Spatial visualization is the ability to manipulate 2D and 3D shapes in one’s mind. In this course, students will perform exercises that increase their spatial visualization skills. P/NP grades only. Students may not receive credit for SE 7 and MAE 7. Prerequisites: none."}
{"code": "SE 9", "title": "Algorithms and Programming for Structural Engineering", "units": "4", "anchor": "se9", "description": "Introduction to the MATLAB environment. Variables and types, statements, functions, blocks, loops, and branches. Algorithm development. Functions, function handles, input and output arguments. Data encapsulation and object-oriented programming. Toolboxes and libraries. Models from physics (mechanics and thermodynamics) are used in exercises and projects. Prerequisites: MATH 20D and MATH 18.", "prereqs": {"type": "all", "courses": ["MATH 20D", "MATH 18"]}}
{"code": "SE 87", "title": "First-year Student Seminar", "units": "1", "anchor": "se87", "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Prerequisites: open to first-year students only."}
{"code": "SE 99H", "title": "Independent Study", "units": "1", "anchor": "se99h", "description": "Independent study or research under direction of a faculty member. Prerequisites: student must be of first year standing and a Regents Scholar. Consent of instructor or department stamp."}
{"code": "SE 101A", "title": "Mechanics I: Statics", "units": "4", "anchor": "se101a", "description": "Principles of statics using vectors. Two- and three-dimensional equilibrium of statically determinate structures under discrete and distributed loading including hydrostatics; internal forces and concept of stress; free body diagrams; moment, product of inertia; analysis of trusses and beams. Prerequisites: MATH 20C and PHYS 2A.", "prereqs": {"type": "all", "courses": ["MATH 20C", "PHYS 2A"]}}
{"code": "SE 101B", "title": "Mechanics II: Dynamics", "units": "4", "anchor": "se101b", "description": "Kinematics and kinetics of particles in two- and three-dimensional motion. Newton’s equations of motion. Energy and momentum methods. Impulsive motion and impact. Systems of particles. Kinetics and kinematics of rigid bodies in 2-D. Introduction to 3-D dynamics of rigid bodies. Prerequisites: SE 101A (or MAE 130A).", "prereqs": {"type": "one", "courses": ["SE 101A", "MAE 130A"]}}
{"code": "SE 101C", "title": "Mechanics III: Vibrations", "units": "4", "anchor": "se101c", "description": "Free and forced vibrations of damped 1-DOF systems; vibrations isolation, impact and packaging problems. Analysis of discrete MDOF systems using matrix representation; normal mode of frequencies and modal matrix formulation. Lagrange’s equations. Modal superposition for analysis of continuous vibrating systems. Prerequisites: MATH 18 and SE 101B (or MAE 130B).", "prereqs": {"type": "all", "courses": ["MATH 18", {"type": "one", "courses": ["SE 101B", "MAE 130B"]}]}}
{"code": "SE 102", "title": "Introduction to Computing for Engineers", "units": "4", "anchor": "se102", "description": "Introduction to engineering computing. Interpolation, integration, differentiation. Ordinary differential equations. Nonlinear algebraic equations. Systems of linear algebraic equations. Representation of data in the computer. Prerequisites: SE 9 (or MAE 8) and SE 101A (or MAE 130A).", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SE 9", "MAE 8"]}, {"type": "one", "courses": ["SE 101A", "MAE 130A"]}]}}
{"code": "SE 103", "title": "Conceptual Structural Design", "units": "4", "anchor": "se103", "description": "Introduction to structural design approaches for civil structures. Structural materials. Loads and load paths. Gravity and lateral load elements and systems. Code design fundamentals. Construction methods. Structural idealization. Hand and computer methods of analysis. Experimental methods applied through team-based projects. Program or materials fees may apply. Prerequisites: SE 3, MAE 8 or SE 9, SE 101A, and SE 105.", "prereqs": {"type": "all", "courses": ["SE 3", {"type": "one", "courses": ["MAE 8", "SE 9"]}, "SE 101A", "SE 105"]}}
{"code": "SE 104", "title": "Structural Materials", "units": "4", "anchor": "se104", "description": "Properties and structures of engineering materials, including metals and alloys, ceramics, cements and concretes, wood, polymers, and composites. Elastic deformation, plastic deformation, fracture, fatigue, creep. Selection of engineering materials based on performance and cost requirements. Measurement techniques. Prerequisites: SE 1 and SE 101A or MAE 130A.", "prereqs": {"type": "all", "courses": ["SE 1", {"type": "one", "courses": ["SE 101A", "MAE 130A"]}]}}
{"code": "SE 104L", "title": "Structural Materials Lab", "units": "1", "anchor": "se104l", "description": "Materials testing for cement and concrete, metals and alloys, polymers and composites, and wood. Materials selection and structural design to meet functional and cost requirements. Structural construction and testing. Materials measurement techniques. Use of computer resources. Prerequisites: SE 104.", "prereqs": "SE 104"}
{"code": "SE 105", "title": "Structural Materials", "units": "5", "anchor": "se105", "description": "Lectures and labs on structural properties of engineering materials. Stress and strain. Stain measurement. Stiffness, strength, toughness, fatigue resistance, and creep. Cement and concrete, wood, aluminum alloys, steel, engineering plastics, and composite materials. Corequisite: SE 110A or MAE 131A. Prerequisites: SE 1 and SE 101A.", "prereqs": {"type": "all", "courses": ["SE 1", "SE 101A"]}, "coreqs": {"type": "one", "courses": ["SE 110A", "MAE 131A"]}}
{"code": "SE 110A", "title": "Solid Mechanics I", "units": "4", "anchor": "se110a", "description": "Concepts of stress and strain. Hooke’s law. Stress transformation. Axial loading of bars. Torsion of circular shafts. Torsion of thin-walled members. Pure bending of beams. Unsymmetric bending of beams. Shear stresses in beams. Shear stresses in thin-walled beams. Shear center. Differential equation of the deflection curve. Deflections and slopes of beams from integration methods. Statically determinate and indeterminate problems. Prerequisites: MATH 20D and SE 101A (or MAE 130A).", "prereqs": {"type": "all", "courses": ["MATH 20D", {"type": "one", "courses": ["SE 101A", "MAE 130A"]}]}}
{"code": "SE 110B", "title": "Solid Mechanics II", "units": "4", "anchor": "se110b", "description": "Advanced concepts in the mechanics of deformable bodies. Unsymmetrical bending of symmetrical and unsymmetrical sections. Bending of curved beams. Shear center and torsional analysis of open and closed sections. Stability analysis of columns, lateral buckling. Application of the theory of elasticity in rectangular coordinates. Prerequisites: grade of C– or better in SE 110A (or MAE 131A). Enrollment restricted to SE27 majors only.", "prereqs": {"type": "one", "courses": ["SE 110A", "MAE 131A"]}}
{"code": "SE 115", "title": "Fluid Mechanics for Structural Engineering", "units": "4", "anchor": "se115", "description": "Fluid statics, hydrostatic forces; integral and differential forms of conservation equations for mass, momentum, and energy; Bernoulli equation; dimensional analysis; viscous pipe flow; external flow, boundary layers; open channel flow. Prerequisites: PHYS 2A and MATH 20D, or consent of instructor.", "prereqs": {"type": "all", "courses": ["PHYS 2A", "MATH 20D"]}}
{"code": "SE 120", "title": "Engineering Graphics and Computer Aided Structural Design", "units": "4", "anchor": "se120", "description": "Engineering graphics, solid modeling, CAD applications including 2-D and 3-D transformations, 3-D viewing, wire frame and solid models, Hidden surface elimination. Program or materials fees may apply. Prerequisites: SE 102 and SE 103.", "prereqs": {"type": "all", "courses": ["SE 102", "SE 103"]}}
{"code": "SE 125", "title": "Statistics, Probability and Reliability", "units": "4", "anchor": "se125", "description": "Probability theory. Statistics, data analysis and inferential statistics, distributions, confidence intervals. Introduction to structural reliability and random phenomena. Applications to components and systems. Students will not receive credit for both SE 125 and MAE 108. Prerequisites: MATH 18 (or MATH 31AH) and MATH 20D. Enrollment restricted to SE27 majors only.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 31AH"]}, "MATH 20D"]}}
{"code": "SE 130A", "title": "Structural Analysis I", "units": "4", "anchor": "se130b", "description": "Classical methods of analysis for statically indeterminate structures. Development of computer codes for the analysis of civil, mechanical, and aerospace structures from the matrix formulation of the classical structural theory, through the direct stiffness formulation, to production-type structural analysis programs. Prerequisites: grade of C– or better in SE 110A (or MAE 131A).", "prereqs": {"type": "one", "courses": ["SE 110A", "MAE 131A"]}}
{"code": "SE 130B", "title": "Structural Analysis II", "units": "4", "description": "Classical methods of analysis for statically indeterminate structures. Analysis of civil, mechanical, and aerospace structures from the matrix formulation of the classical structural theory, through the direct stiffness formulation, to production-type structural analysis programs. Prerequisites: MATH 18 (or MATH 31AH) and SE 130A.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["MATH 18", "MATH 31AH"]}, "SE 130A"]}}
{"code": "SE 131A", "title": "Finite Element Analysis", "units": "4", "anchor": "se131a", "description": "Development of finite element models based upon the Galerkin method. Application to static and dynamic heat conduction and stress analysis. Formulation of initial boundary value problem models, development of finite element formulas, solution methods, and error analysis and interpretation of results. Renumbered from SE 131. Students may not receive credit for SE 131A and SE 131. Corequisite: SE 130B. Prerequisites: MATH 20E, SE 3, and SE 110B (or MAE 131B).", "prereqs": {"type": "all", "courses": ["MATH 20E", "SE 3", {"type": "one", "courses": ["SE 110B", "MAE 131B"]}]}, "coreqs": "SE 130B"}
{"code": "SE 131B", "title": "Computing Projects in Structural Engineering", "units": "4", "anchor": "se131b", "description": "Project-based exploration of structural engineering computations. Topics include analysis of shell structures, design optimization, computational vibration analysis. Prerequisites: SE 131A (or SE 131), SE 101C (or MAE 130C), and SE 130B.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SE 131A", "SE 131"]}, {"type": "one", "courses": ["SE 101C", "MAE 130C"]}, "SE 130B"]}}
{"code": "SE 132", "title": "Machine Learning for Structural Engineering", "units": "4", "anchor": "se132", "description": "This course aims at introducing concepts of machine learning and its applications to structural engineering. Theory behind popular machine learning algorithms will be discussed, including supervised learning, unsupervised learning, and deep learning. Topics include regression, classification, support vector machines, clustering, tree-based methods, model selections and regularizations, cross-validation and bootstrapping, neural networks, and Python programming. Prerequisites: SE 9 (or MAE 8), SE 110A (or MAE 131A), and SE 125 (or MAE 108).", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SE 9", "MAE 8"]}, {"type": "one", "courses": ["SE 110A", "MAE 131A"]}, {"type": "one", "courses": ["SE 125", "MAE 108"]}]}}
{"code": "SE 140A", "title": "Design of Civil Structures I", "units": "4", "anchor": "se140a", "description": "Part I of multidisciplinary team experience to design, analyze, build, and test civil/geotechnical engineering components and systems considering codes, regulations, alternative design solutions, economics, sustainability, constructability, reliability, and aesthetics. Professionalism, technical communication, project management, teamwork, and ethics in engineering practice. Use of computer resources. Program or materials fees may apply. Prerequisites: SE 130B and SE 150A (or SE 150).", "prereqs": {"type": "all", "courses": ["SE 130B", {"type": "one", "courses": ["SE 150A", "SE 150"]}]}}
{"code": "SE 140B", "title": "Design of Civil Structures II", "units": "4", "anchor": "se140b", "description": "Part II of multidisciplinary team experience to design, analyze, build, and test civil/geotechnical engineering components and systems considering codes, regulations, alternative design solutions, economics, sustainability, constructability, reliability, and aesthetics. Professionalism, technical communication, project management, teamwork, and ethics in engineering practice. Use of computer resources. Program or materials fees may apply. Prerequisites: SE 140A, SE 151A, and SE 181.", "prereqs": {"type": "all", "courses": ["SE 140A", "SE 151A", "SE 181"]}}
{"code": "SE 142", "title": "Design of Composite Structures", "units": "4", "anchor": "se142", "description": "Introduction to advanced composite materials and their applications. Fiber and matrix properties, micromechanics, stiffness, ply-by-ply stress, hygrothermal behavior, and failure prediction. Lab activity will involve design, analysis, fabrication, and testing of composite structure. Program or materials fees may apply. Prerequisites: SE 110A (or MAE 131A) and SE 110B.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SE 110A", "MAE 131A"]}, "SE 110B"]}}
{"code": "SE 143A", "title": "Aerospace Structural Design I", "units": "4", "anchor": "se143a", "description": "Conceptual and preliminary structural design of aircraft and space vehicles. Minimum-weight design of primary structures based upon mission requirements and configuration constraints. Multicriteria decision making. Team projects include layout, material selection, component sizing, fabrication, and cost. Oral presentations. Written reports. Use of computer resources. Program or materials fees may apply. Prerequisites: SE 3, SE 142, and SE 160B.", "prereqs": {"type": "all", "courses": ["SE 3", "SE 142", "SE 160B"]}}
{"code": "SE 143B", "title": "Aerospace Structural Design II", "units": "4", "anchor": "se143b", "description": "Detailed structural design of aircraft and space vehicles. Composite material design considerations. Multidisciplinary design optimization. Introduction to aerospace computer-aided design and analysis tools. Team projects include the analysis, fabrication, and testing of a flight vehicle component. Oral presentations. Written reports. Use of computer resources. Program or materials fees may apply. Prerequisites: SE 143A.", "prereqs": "SE 143A"}
{"code": "SE 150A", "title": "Design of Steel Structures", "units": "4", "anchor": "se150a", "description": "Load and resistance factor design concept and loadings for structural systems. Structural steel properties and selection. Design of tension members, compression members, beams, beam-columns, simple bolted, and welded connections. Prerequisites: SE 130A.", "prereqs": "SE 130A"}
{"code": "SE 150B", "title": "Design of Steel Structures II", "units": "4", "anchor": "se150b", "description": "Theory and behavior of steel structures leading to the development of design requirements in current specifications. Topics will include design of simple and rigid connections, composite construction, advanced topics in compression and flexural members including torsion, design of plate girders, the direct analysis method, and plastic analysis. Emphasis will be placed on fundamental concepts. Prerequisites: SE 150 or SE 150A.", "prereqs": {"type": "one", "courses": ["SE 150", "SE 150A"]}}
{"code": "SE 151A", "title": "Design of Reinforced Concrete", "units": "4", "anchor": "se151a", "description": "Concrete and reinforcement properties. Service and ultimate limit state analysis and design. Design and detailing of structural components. Corequisite: SE 103. Prerequisites: SE 130A.", "prereqs": "SE 130A", "coreqs": "SE 103"}
{"code": "SE 151B", "title": "Design of Prestressed Concrete", "units": "4", "anchor": "se151b", "description": "Time-dependent and independent properties of concrete and reinforcing material. Concept and application of prestressed concrete. Service and ultimate limit state analysis and design of prestressed concrete structures and components. Detailing of components. Calculation of deflection and prestress losses. Prerequisites: SE 151A.", "prereqs": "SE 151A"}
{"code": "SE 152", "title": "Seismic Design of Structures", "units": "4", "anchor": "se152", "description": "Seismic design philosophy. Ductility concepts. Lateral force resisting systems. Mechanisms of nonlinear deformation. Methods of analysis. Detailing of structural steel and reinforced concrete elements. Lessons learned from past earthquakes. Multistory building design project. Prerequisites: SE 130B, SE 150, and SE 151A.", "prereqs": {"type": "all", "courses": ["SE 130B", "SE 150", "SE 151A"]}}
{"code": "SE 154", "title": "Design of Timber Structures", "units": "4", "anchor": "se154", "description": "Properties of wood and lumber grades. Beam design. Design of axially loaded members. Design of beam-column. Properties of plywood and structural-use panels. Design of horizontal diaphragms. Design of shear walls. Design of nailed and bolted connections. Prerequisites: SE 103 and SE 130A. Enrollment restricted to SE27 majors only.", "prereqs": {"type": "all", "courses": ["SE 103", "SE 130A"]}}
{"code": "SE 160A", "title": "Aerospace Structural Mechanics I", "units": "4", "anchor": "se160a", "description": "Aircraft and spacecraft flight loads and operational envelopes, three-dimensional stress/strain relations, metallic and composite materials, failure theories, three-dimensional space trusses and stiffened shear panels, combined extension-bend-twist behavior of thin-walled multicell aircraft and space vehicle structures, modulus-weighted section properties, shear center. Prerequisites: SE 105 (or MAE 21 or SE 104L) and SE 101B (or MAE 130B or MAE 30B) and SE 110A (or MAE 131A).", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SE 105", "MAE 21", "SE 104L"]}, {"type": "one", "courses": ["SE 101B", "MAE 130B", "MAE 30B"]}, {"type": "one", "courses": ["SE 110A", "MAE 131A"]}]}}
{"code": "SE 160B", "title": "Aerospace Structural Mechanics II", "units": "4", "anchor": "se160b", "description": "Analysis of aerospace structures via work-energy principles and finite element analysis. Bending of metallic and laminated composite plates and shells. Static vibration and buckling analysis of simple and built-up aircraft structures. Introduction to wing divergence and flutter, fastener analysis. Prerequisites: SE 160A. Enrollment restricted to MC25, MC27, and SE27 majors only.", "prereqs": "SE 160A"}
{"code": "SE 163", "title": "Nondestructive Evaluation", "units": "4", "anchor": "se163", "description": "Fourier signal processing, liquid penetrant, elastic wave propagation, ultrasonic testing, impact-echo, acoustic emission testing, vibrational testing, infrared thermography. May be coscheduled with SE 263. Prerequisites: SE 110A and SE 110B or consent of instructor.", "prereqs": {"type": "all", "courses": ["SE 110A", "SE 110B"]}}
{"code": "SE 164", "title": "Sensors and Data Acquisition for Structural Engineering", "units": "4", "anchor": "se164", "description": "This course discusses theory, design, and applications of sensor technologies in the context of structural engineering and structural health monitoring. Topics include sensors and sensing mechanisms; measurement uncertainty; signal conditioning and interface circuits; data acquisition; analog/digital circuits; and emerging sensors. May be coscheduled with SE 264. Prerequisites: SE 101C (or MAE 130C) and SE 110A.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SE 101C", "MAE 130C"]}, "SE 110A"]}}
{"code": "SE 165", "title": "Structural Health Monitoring", "units": "4", "anchor": "se165", "description": "A modern paradigm of structural health monitoring as it applies to structural and mechanical systems is presented. Concepts in data acquisition, feature extraction, data normalization, and statistical modeling will be introduced in an integrated context. MATLAB-based exercise. Term project. Use of computer resources. Prerequisites: SE 101C (or MAE 130C).", "prereqs": {"type": "one", "courses": ["SE 101C", "MAE 130C"]}}
{"code": "SE 167", "title": "Signal Processing and Spectral Analysis for Structural Engineering", "units": "4", "anchor": "se167", "description": "Signal processing is widely used in engineering and physical sciences. This course discusses techniques to analyze signals (or data), particularly related to structural dynamic response focusing on time/frequency domain data analysis (Fourier transform, digital filtering, and feature extraction). Prerequisites: SE 101C. Enrollment restricted to SE27 majors only.", "prereqs": "SE 101C"}
{"code": "SE 168", "title": "Structural System Testing and Model Correlation", "units": "4", "anchor": "se168", "description": "Dynamic/model testing of structures: test planning/execution, actuation, sensing, and data acquisition, signal processing, data conditioning, test troubleshooting. Methods of updating finite element structural models to correlate with dynamic test results. Model/test correlation assessment in industrial practice. Knowledge of MATLAB strongly encouraged. Prerequisites: SE 101C (or MAE 130C) and SE 131A (or SE 131).", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SE 101C", "MAE 130C"]}, {"type": "one", "courses": ["SE 131A", "SE 131"]}]}}
{"code": "SE 171", "title": "Aerospace Structures Repair", "units": "4", "anchor": "se168", "description": "Review methods used to repair aerospace structures. Emphasis on primary load-bearing airframe structures and analysis/design of substantiate repairs. Identification of structural/corrosion distress, fatigue cracking, damage tolerance, integrity and durability of built-up members, patching, health monitoring. Use of computer resources. Prerequisites: SE 110A (or MAE 131A) and SE 110B (or MAE 131B).", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SE 110A", "MAE 131A"]}, {"type": "one", "courses": ["SE 110B", "MAE 131B"]}]}}
{"code": "SE 180", "title": "Earthquake Engineering", "units": "4", "anchor": "se168", "description": "Elements of seismicity and seismology. Seismic hazards. Dynamic analysis of structures underground motion. Elastic and inelastic response spectra. Modal analysis, nonlinear time-history analysis. Earthquake resistant design. Seismic detailing. Prerequisites: grade of C– or better in SE 110A, and SE 130A. Enrollment restricted to SE27 majors only.", "prereqs": {"type": "all", "courses": ["SE 110A", "SE 130A"]}}
{"code": "SE 181", "title": "Geotechnical Engineering", "units": "4", "anchor": "se168", "description": "General introduction to physical and engineering properties of soils. Soil classification and identification methods. Compaction and construction control. Total and effective stress. Permeability, seepage, and consolidation phenomena. Shear strength of sand and clay. Prerequisites: grade of C– or better in SE 110A or MAE 131A. Enrollment restricted to SE27 majors only.", "prereqs": {"type": "one", "courses": ["SE 110A", "MAE 131A"]}}
{"code": "SE 182", "title": "Foundation Engineering", "units": "4", "anchor": "se168", "description": "Application of soil mechanics to the analysis, design, and construction of foundations for structures. Soil exploration, sampling, and in situ testing techniques. Stress distribution and settlement of structures. Bearing capacities of shallow foundations and effects on structural design. Analysis of axial and lateral capacity of deep foundations, including drilled piers and driven piles. Prerequisites: SE 181. Enrollment restricted to SE27 majors only.", "prereqs": "SE 181"}
{"code": "SE 184", "title": "Ground Improvement", "units": "4", "anchor": "se168", "description": "Concepts underpinning mechanical, hydraulic, chemical and inclusion-based methods of ground improvement will be discussed. Students will be able to understand the advantages, disadvantages and limitations of the various methods; and develop a conceptual design for the most appropriate improvement strategy. Prerequisites: SE 181.", "prereqs": "SE 181"}
{"code": "SE 192", "title": "Senior Seminar", "units": "1", "anchor": "se168", "description": "The Senior Seminar is designed to allow senior undergraduates to meet with faculty members to explore an intellectual topic in structural engineering. Topics will vary from quarter to quarter. Enrollment is limited to twenty students with preference given to seniors. Prerequisites: SE major. Department stamp and/or consent of instructor."}
{"code": "SE 195", "title": "Teaching", "units": "2–4", "anchor": "se168", "description": "Teaching and tutorial assistance in a SE course under supervision of instructor. Not more than four units may be used to satisfy graduation requirements. (P/NP grades only.) Prerequisites: B average in major, upper-division standing, and consent of department chair. Department stamp required."}
{"code": "SE 197", "title": "Engineering Internship", "units": "1–4", "anchor": "se168", "description": "An enrichment program, available to a limited number of undergraduate students, which provides work experience with industry, government offices, etc., under the supervision of a faculty member and industrial supervisor. Coordination of the Engineering Internship is conducted through UC San Diego’s Academic Internship Program. Prerequisites: completion of ninety units with a 2.5 GPA and consent of department chair. Department stamp required."}
{"code": "SE 198", "title": "Directed Study Group", "units": "4", "anchor": "se168", "description": "Directed group study, on a topic or in a field not included in the regular department curriculum, by special arrangement with a faculty member. (P/NP grades only.) Prerequisites: consent of instructor or department stamp."}
{"code": "SE 199", "title": "Independent Study", "units": "1–4", "anchor": "se168", "description": "Independent reading or research on a problem by special arrangement with a faculty member. (P/NP grades only.) Prerequisites: consent of instructor or department stamp."}
{"code": "SE 200", "title": "Applied Mathematics in Structural Engineering", "units": "4", "anchor": "se168", "description": "This course is designed to give beginning students the basic preparation in mathematical methods required for graduate Structural Engineering courses. Topics include linear algebra; systems of ordinary differential equations; diffusion and wave propagation problems; integral transforms; and calculus of variations. Prerequisites: graduate standing or approval of instructor."}
{"code": "SE 201A", "title": "Advanced Structural Analysis", "units": "4", "anchor": "se168", "description": "Application of advanced analytical concepts to structural engineering problems. Analysis of frame structures using matrix methods and introduction to the finite element method. Displacement-based and force-based beam element formulations. Development of computer programs for structural analysis. Use of computer resources. Prerequisites: graduate standing."}
{"code": "SE 201B", "title": "Nonlinear Structural Analysis", "units": "4", "anchor": "se168", "description": "The course emphasizes the principles behind modern nonlinear structural analysis software. It deals with the theory, computer implementation, and applications of methods of material and geometric nonlinear analysis. Emphasis is on 2D and 3D frame structures modeled using 1D (beam-column) elements. Use of computer resources. Prerequisites: SE 201A or equivalent, or consent of instructor.", "prereqs": "SE 201A"}
{"code": "SE 202", "title": "Structural Stability", "units": "4", "anchor": "se168", "description": "Static, dynamic, and energy-based techniques and predicting elastic stability. Linear and nonlinear analysis of classical and shear deformable beams and plates. Ritz, Galerkin, and finite element approaches for frames and reinforced shells. Nonconservative aerodynamic (divergence flutter) and follower forces. Recommended preparation: SE 101A-C and SE 110A or equivalent background in solid mechanics and structural dynamics. Prerequisites: graduate standing."}
{"code": "SE 203", "title": "Structural Dynamics", "units": "4", "anchor": "se168", "description": "Response of discrete linear structural systems to harmonic, periodic and transient excitations. Lagrangian mechanics. Linearization of the equations of motion. Free and forced vibrations of multi degree-of-freedom structures. Normal mode, frequency response and numerical methods. Continuous systems. Prerequisites: graduate standing or consent of instructor."}
{"code": "SE 204", "title": "Advanced Structural Dynamics", "units": "4", "anchor": "se168", "description": "Free- and forced-vibration of continuous systems such as axial and torsional vibrations of bars and transverse vibrations of various beams, membranes, and plates. Euler-Lagrange formulation using variational calculus. Rayleigh-Ritz method for approximation. Applications in vibration suppression/isolation. Prerequisites: graduate standing."}
{"code": "SE 205", "title": "Nonlinear Mechanical Vibrations", "units": "4", "anchor": "se168", "description": "Advanced analytical techniques to understand nonlinearity in mechanical vibration. Phase plane analysis instability, and bifurcations. Application in nonlinear structural resonance. Introduction to chaotic dynamics, advanced time series analysis, and using chaotic dynamics in applications such as structural damage assessment. Prerequisites: SE 203 or consent of instructor, graduate standing.", "prereqs": "SE 203"}
{"code": "SE 206", "title": "Random Vibrations", "units": "4", "anchor": "se168", "description": "Introduction to probability theory and random processes. Dynamic analysis of linear structural systems subjected to stationary and nonstationary random excitations. Reliability studies related to first excursion and fatigue failures. Applications in earthquake engineering, offshore engineering, wind engineering, and aerospace engineering. Use of computer resources. Recommended preparation: basic knowledge of probability theory (SE 125 or equivalent). Prerequisites: SE 203, graduate standing. ", "prereqs": "SE 203"}
{"code": "SE 207", "title": "Topics in Structural Engineering", "units": "4", "anchor": "se168", "description": "A course to be given at the discretion of the faculty in which topics of current interest in structural engineering will be presented."}
{"code": "SE 211", "title": "Advanced Structural Concrete", "units": "4", "anchor": "se168", "description": "Properties of reinforcing steels; concrete technology; creep, shrinkage and relaxation; Mohr-Coulomb failure criteria for concrete; confinement, moment curvature and force-displacement responses; plastic design; code compliant seismic design philosophy; code compliant seismic design of structural walls. Use of computer resources. Recommended preparation: SE 151A and SE 151B or equivalent background in basic RC/PC design. Prerequisites: department approval or consent of instructor."}
{"code": "SE 212", "title": "Advanced Structural Steel Design", "units": "4", "anchor": "se168", "description": "Load and Resistance Factor Design (LRFD) philosophy. Behavior and design of steel elements for global and local buckling. Background of seismic codes. Ductility requirements and capability design concept. Seismic design of steel moment frames and braced frames. Prerequisites: SE 201 and SE 150, or equivalent course, or consent of instructor.", "prereqs": {"type": "all", "courses": ["SE 201", "SE 150"]}}
{"code": "SE 213", "title": "Bridge Design", "units": "4", "anchor": "se168", "description": "Design and analysis of bridge structures, construction methods, load conditions. Load paths and distribution of dead and live loads. Service, strength, and extreme event limit states and other load and resistance factor design (LRFD) principles. Design of prestressed concrete bridges. Special problems in analysis—concrete box girders, curved and skewed bridges, environmental and seismic loads. Conceptual/preliminary bridge design project. Recommended preparation: SE 151A-B, SE 201A, SE 211, SE 223, or equivalent courses. Prerequisites: graduate standing."}
{"code": "SE 214", "title": "Masonry Structures", "units": "4", "anchor": "se168", "description": "Analysis and design of unreinforced and reinforced masonry structure using advanced analytical techniques and design philosophies. Material properties, stability, and buckling of unreinforced masonry. Flexural strength, shear strength, stiffness, and ductility of reinforced masonry elements. Design for seismic loads. Prerequisites: SE 151A, B, or equivalent basic reinforced concrete course, or consent of instructor, graduate standing.", "prereqs": {"type": "all", "courses": ["SE 151A", "SE 151B"]}}
{"code": "SE 215", "title": "Cable Structures", "units": "4", "anchor": "se168", "description": "The course deals with cable structures from a structural mechanics point of view. The theoretical and practical aspects of the application of cables to moorings, guyed structures, suspension bridges, cable-stayed bridges, and suspended membranes are discussed. Prerequisites: graduate standing or consent of instructor."}
{"code": "SE 220", "title": "Seismic Isolation and Energy Dissipation", "units": "4", "anchor": "se168", "description": "Concepts, advantages, and limitations of seismic isolation techniques; fundamentals of dynamic response under seismic excitation; spectral analysis; damping; energy approach; application to buildings and structures. Prerequisites: background in structural dynamics, or consent of instructor."}
{"code": "SE 221", "title": "Earthquake Engineering", "units": "4", "anchor": "se168", "description": "Introduction to plate tectonics and seismology. Rupture mechanism, measures of magnitude and intensity, earthquake occurrence and relation to geologic, tectonic processes. Probabilistic seismic hazard analysis. Strong earthquake ground motion; site effects on ground motion; structural response; soil-structure interaction; design criteria; code requirements. Use of computer resources. Prerequisites: SE 201A or SE 203, graduate standing. ", "prereqs": {"type": "one", "courses": ["SE 201A", "SE 203"]}}
{"code": "SE 222", "title": "Geotechnical Earthquake Engineering", "units": "4", "anchor": "se168", "description": "Influence of soil conditions on ground motion characteristics; dynamic behavior of soils, computation of ground response using wave propagation analysis and finite element analysis; evaluation and mitigation of soil liquefaction; soil-structure interaction; lateral pressures on earth retaining structures; analysis of slope stability. Recommended preparation: SE 181 or equivalent. Prerequisites: department approval and graduate standing."}
{"code": "SE 223", "title": "Advanced Seismic Design of Structures", "units": "4", "anchor": "se168", "description": "Modal analysis. Nonlinear response spectra. Performance based seismic design. Nonlinear time history analyses. Capacity design. Structural walls. Coupled walls. Rocking walls. Base isolation. Recommended preparation: grade of B+ or higher in SE 211 and SE 201B. Prerequisites: department approval and graduate standing."}
{"code": "SE 224", "title": "Structural Reliability and Risk Analysis", "units": "4", "anchor": "se168", "description": "Review of probability theory and random processes. Fundamentals of structural reliability theory. First- and second-order, and simulation methods of reliability analysis. Structural component and system reliability. Reliability sensitivity measures. Bayesian reliability analysis methods. Bases for probabilistic design codes. Use of computer resources. Recommended preparation: basic knowledge of probability theory (e.g., SE 125). Prerequisites: graduate standing."}
{"code": "SE 226", "title": "Geotechnical Groundwater Engineering", "units": "4", "anchor": "se168", "description": "This course will treat quantitative aspects of the flow of uncontaminated groundwater as it influences the practice of geotechnical engineering. We will cover flow through porous media, generalized Darcy’s law, groundwater modeling, confined and unconfined systems, well hydraulics, land subsidence, and construction dewatering. Prerequisites: SE 241 or consent of instructor, graduate standing.", "prereqs": "SE 241"}
{"code": "SE 227", "title": "Seismic Design and Performance of Nonstructural Components and Systems", "units": "4", "anchor": "se168", "description": "This course provides students with an understanding of the design and performance of nonstructural components and systems (NCSs) when subjected to earthquake loads. Specifically, this course will cover 1) classification and sources of damage, 2) case histories, 3) experimental advancements, 4) methods in practice (force- and displacement-based), 5) methods of analysis, 6) anchorage design, and 7) protection of NCSs. Corequisite: SE 203. Prerequisites: graduate standing.", "coreqs": "SE 203"}
{"code": "SE 233", "title": "Computational Techniques in Finite Elements", "units": "4", "anchor": "se168", "description": "Cross-listed with MAE 235. Practical application of the finite element method to problems in solid mechanics. Elements of theory are presented as needed. Covered are static and dynamic heat transfer and stress analysis. Basic processing, solution methods, and postprocessing are practiced with commercial finite element software. Students may not receive credit for SE 233 and MAE 235."}
{"code": "SE 235", "title": "Wave Propagation in Elastic Media", "units": "4", "anchor": "se168", "description": "Wave propagation in elastic media with emphasis on waves in unbound media and on uniform and layered half-spaces. Fundamental aspects of elastodynamics. Application to strong-motion seismology, earthquake engineering, dynamics of foundations, computational wave propagation, and nondestructive evaluations. Prerequisites: graduate standing or consent of instructor."}
{"code": "SE 236", "title": "Wave Propagation in Continuous Structural Elements", "units": "4", "anchor": "se168", "description": "Propagation of elastic waves in thin structural elements such as strings, rods, beams, membranes, plates, and shells. An approximate strength-of-materials approach is used to consider propagation of elastic waves in these elements and obtain the dynamic response to transient loads. Prerequisites: graduate standing or consent of instructor."}
{"code": "SE 241", "title": "Advanced Soil Mechanics", "units": "4", "anchor": "se168", "description": "Advanced treatment of topics in soil mechanics, including state of stress, pore pressure, consolidation and settlement analysis, shear strength of cohesionless and cohesive soils, mechanisms of ground improvement, and slope stability analysis. Concepts in course reinforced by laboratory experiments."}
{"code": "SE 242", "title": "Advanced Foundation Engineering", "units": "4", "anchor": "se168", "description": "Application of soil mechanics to the analysis, design, and construction of foundations for structures. Soil exploration, sampling, and in-situ testing techniques. Stress distribution and settlement of structures. Bearing capacities of shallow foundations and effects on structural design. Analysis of axial and lateral capacity of deep foundations, including drilled piers and driven piles. Prerequisites: graduate standing or consent of instructor."}
{"code": "SE 243", "title": "Soil-Structure Interaction", "units": "4", "anchor": "se168", "description": "Advanced treatment of the dynamic interaction between soils and structures. Dynamic response of shallow and embedded foundations. Kinematic and inertial interaction. General computational and approximate analytical methods of analysis. Prerequisites: SE 200 and SE 203, graduate standing.", "prereqs": {"type": "all", "courses": ["SE 200", "SE 203"]}}
{"code": "SE 244", "title": "Numerical Methods in Geomechanics", "units": "4", "anchor": "se168", "description": "Application of finite element method to static and dynamic analysis of geotechnical structures. One-, 2-, and 3-D static and seismic response of earth structures/slopes/Foundation systems. Pore-pressure generation/effects during cycle loading. System identification using strong motion downhole-array data. Use of computer resources required. Prerequisites: graduate standing."}
{"code": "SE 246", "title": "Unsaturated Soil Mechanics", "units": "4", "anchor": "se168", "description": "This course covers the hydraulic and mechanical behavior of unsaturated soils. Topics include soil-air-water interactions, measurement of hydraulic properties, water flow analysis, effective stress theory, and elasto-plastic constitutive modeling. Applications to foundation engineering, slope stability, earth dams, and geoenvironmental engineering are presented. Prerequisites: graduate standing."}
{"code": "SE 247", "title": "Ground Improvement", "units": "4", "anchor": "se168", "description": "Concepts underpinning mechanical, hydraulic, chemical and inclusion-based methods of ground improvement will be discussed. Students will be able to understand the advantages, disadvantages and limitations of the various methods; and develop a conceptual design for the most appropriate improvement strategy. Recommended Preparation: SE 181 or equivalent background in the physics and engineering properties of soil. Prerequisites: graduate standing."}
{"code": "SE 248", "title": "Engineering Properties of Soils", "units": "4", "anchor": "se168", "description": "Experimental/constitutive modeling perspectives on mechanical, hydraulic, thermal behavior of dry and saturated soils. Experimental techniques and methodologies presented; students will be able to perform key tests. Behavior of saturated sands and clays described based on key studies. Calibration of constitutive models for stress-strain behavior of soils, including hyperbolic, Mohr-Coulomb/Cam-Clay models. Modification of these models to consider thermal effects. Prerequisites: graduate standing."}
{"code": "SE 249", "title": "Rock Mechanics and Engineering", "units": "4", "anchor": "se168", "description": "Origins of rock, intact rock stress-strain behavior and testing, theory of poroelasticity, fracture behavior and permeability, elastic description of orthotropic and transversely isotropic rock mass. Engineering topics include excavations, foundations, stresses around the circular hole in rock, principles of hydraulic fracturing. Prerequisites: graduate standing."}
{"code": "SE 250", "title": "Stability of Earth Slopes and Retaining Walls", "units": "4", "anchor": "se168", "description": "Fundamental and advanced concepts of stability analysis for earth slopes and retaining walls with soil backfill. Topics: shear strength, effective/total stress analysis, infinite/finite slopes, reinforced soil slopes, lateral earth pressure, retaining wall design and reinforced soil retaining walls. Recommended preparation: SE 181 or equivalent background. Prerequisites: department approval and graduate standing."}
{"code": "SE 251A", "title": "Processing of Polymers and Composites", "units": "4", "anchor": "se168", "description": "Introduction to processing and fabrication methods of polymers and composite materials. Processing techniques; facilities and equipment; material-processing-microstructure interaction; materials selection; form and quality control. Extrusion; injection molding; blow molding; compression molding; thermoforming; casting; foaming. Wet layup; sprayup; autoclave cure, SMC; RTM; resin infusion; winding and fiber placement; pultrusion. Process induced defects and environmental considerations. Cross-listed with MATS 261A. Prerequisites: graduate standing."}
{"code": "SE 251B", "title": "Mechanical Behaviors of Polymers and Composites", "units": "4", "anchor": "se168", "description": "Material science-oriented course on polymers and composites. Mechanical properties of polymers; micromechanisms of elastic and plastic deformations, fracture, and fatigue of polymers and composites. Cross-listed with MATS 261B. Prerequisites: graduate standing required."}
{"code": "SE 252", "title": "Experimental Mechanics and NDE", "units": "4", "anchor": "se168", "description": "Requirements for strain measurements, electrical resistance strain gages, fiberoptic strain gages, wave propagation, ultrasonic testing, impact-echo, acoustic emission, infrared thermography, vibrational testing. Applications to materials characterization, defect detection, and health monitoring of structural components. Recommended preparation: SE 101A, SE 110A or MAE 131A, and SE 110B or MAE 131B. Prerequisites: department approval required, graduate standing."}
{"code": "SE 253A", "title": "Mechanics and Design of Composite Structures", "units": "4", "anchor": "se168", "description": "Graduate-level introduction to advanced composite materials and their applications. Fiber and matrix properties, 3D properties, stress-strain relationships, micromechanics, stiffness, ply-by-ply stress, classical laminated plate theory, hygrothermal/CTE behavior, and failure prediction. Lab activity will involve composite fabrication methods and design, analysis, build, and testing of composite structure. May be coscheduled with SE 142. Program or materials fees may apply. Prerequisites: graduate standing."}
{"code": "SE 253B", "title": "Mechanics of Laminated Composite Structures II", "units": "4", "anchor": "se168", "description": "Advanced topics, with prerequisite being SE 253A, or equivalent. Macro- and micro-material modeling, classical and shear deformable laminate beam and plate theories developed via energy principles, Ritz, Galerkin, and Finite element based solutions, advanced failure theories, fracture, holes/notches and hole-size effect, interlaminar stresses, free-edge problems, impact, damage tolerance, fatigue, elastic tailoring, thermally stabile/zero CTE structures, etc. Prerequisites: SE 253A or equivalent, graduate standing.", "prereqs": "SE 253A"}
{"code": "SE 253C", "title": "Mechanics of Laminated Anisotropy Plates and Shells", "units": "4", "anchor": "se168", "description": "Static/dynamic/elastic stability of laminated anisotropic plates and cylindrical shells. Theories: thin-plate (classical lamination theory), first-and third- order shear-deformable (Reissner-Mindlin and Reddy) thick plates, and refined layer-wise theories. Solution methods: exact, approximate (Ritz, Galerkin) and finite element method. Additional topics: sandwich construction, elastic couplings, thermal response, shear factor determination, fiber/interlaminar stress recovery, strength/safety. Prerequisites: SE 253B; graduate standing or consent of instructor.", "prereqs": "SE 253B"}
{"code": "SE 254", "title": "FRPs in Civil Structures", "units": "4", "anchor": "se168", "description": "Strengthening of existing reinforced concrete structures with fiber reinforced composites. Mechanics of Fiber Reinforced Plastic lamina, bond strength of FRP-to-concrete joints, shear and flexural strengthening of beams and walls, increased strength and ductility of axially loaded columns, and seismic retrofit of columns. Use of computer resources. Prerequisites: SE 253A, graduate standing.", "prereqs": "SE 253A"}
{"code": "SE 255", "title": "Textile Composite Structures", "units": "4", "anchor": "se168", "description": "Introduction to textile structure and behavior, mechanics of yarns and fabrics as relevant to structural composites and geotechnical applications. Mechanics of textiles and fabric-based composites. Applications in fiber reinforced composites, coated textile structures, geotextiles."}
{"code": "SE 260A", "title": "Aerospace Structural Mechanics I", "units": "4", "anchor": "se168", "description": "Aircraft and spacecraft flight loads and operational envelopes, three-dimensional stress/strain relations, metallic and composite materials, failure theories, three-dimensional space trusses and stiffened shear panels, combined extension-bend-twist behavior of thin-walled multicell aircraft and space vehicle structures, modulus-weighted section properties, shear center. Prerequisites: graduate standing."}
{"code": "SE 260B", "title": "Aerospace Structural Mechanics II", "units": "4", "anchor": "se168", "description": "Analysis of aerospace structures via work-energy principles and finite element analysis. Bending of metallic and laminated composite plates and shells. Static vibration and buckling analysis of simple and built-up aircraft structures. Introduction to wing divergence and flutter, fastener analysis. Prerequisites: SE 260A, graduate standing.", "prereqs": "SE 260A"}
{"code": "SE 261", "title": "Aerospace Engineering Design", "units": "4", "anchor": "se168", "description": "Advanced topics in the design of weight-critical aerospace structures. Topics include static, dynamic, and environmental load definitions; metallics and polymeric composite material selection; semimonocoque analysis techniques; and bolted/bonded connections. Design procedures for sizing the structural components of aircraft and spacecraft will be reviewed."}
{"code": "SE 262", "title": "Aerospace Structures Repair", "units": "4", "anchor": "se168", "description": "Review methods used to repair aerospace structures. Emphasis on primary load-bearing airframe structures and analysis/design of substantiate repairs. Identification of structural/corrosion distress, fatigue cracking, damage tolerance, integrity and durability of built-up members, patching, health monitoring. Use of computer resources. Prerequisites: graduate standing. Restricted to SE and MAE graduate students (major codes SE75, SE76, SE77, SE78, SE79, SE80, SE81, SE82, MC75, MC76, MC78, MC80, MC81, MC82, MC83, MC84, MC85, MC86, MC87, MC88)."}
{"code": "SE 263", "title": "Nondestructive Evaluation", "units": "4", "anchor": "se168", "description": "Fourier signal processing, liquid penetrant, elastic wave propagation, ultrasonic testing, impact-echo, acoustic emission testing, vibrational testing, infrared thermography. May be coscheduled with SE 163. Recommended Preparation: undergraduate degree in structural, civil, mechanical, or aerospace engineering. Prerequisites: graduate standing."}
{"code": "SE 264", "title": "Sensors and Data Acquisition for Structural Engineering", "units": "4", "anchor": "se168", "description": "This course discusses theory, design, and applications of sensor technologies in the context of structural engineering and structural health monitoring. Topics include sensors and sensing mechanisms; measurement uncertainty; signal conditioning and interface circuits; data acquisition; analog/digital circuits; and emerging sensors. May be coscheduled with SE 164. Prerequisites: graduate standing."}
{"code": "SE 265", "title": "Structural Health Monitoring", "units": "4", "anchor": "se168", "description": "A modern paradigm of structural health monitoring as it applies to structural and mechanical systems is presented. Concepts in data acquisition, feature extraction, data normalization, and statistical modeling will be introduced in an integrated context. MATLAB-based exercises. Term project. Prerequisites: graduate student, undergraduate vibrations or structural dynamics course."}
{"code": "SE 266", "title": "Smart and Multifunctional Materials", "units": "4", "anchor": "se168", "description": "This course examines the properties, physics, mechanisms, and design of smart and multifunctional materials; data acquisition and operating principles of sensor technologies; smart materials (piezoresistive, piezoelectric, magnetorheological, and shape memory materials); nanotechnology-enabled multifunctional materials; and applications for structural health monitoring. Use of computer resources. Prerequisites: graduate standing."}
{"code": "SE 267A", "title": "Signal Processing and Spectral Analysis for Structural Engineering", "units": "4", "anchor": "se168", "description": "Signal processing is widely used in engineering and physical sciences. This course discusses techniques to analyze signals (or data), particularly related to structural dynamic response focusing on time/frequency domain data analyses (Fourier transform, digital filtering, and feature extraction). May be coscheduled with SE 167. Prerequisites: graduate standing. Restricted to major codes SE75, SE77, SE80, and SE81."}
{"code": "SE 268", "title": "Structural System Testing and Model Correlation", "units": "4", "anchor": "se168", "description": "Dynamic/model testing of structures: test planning/execution, actuation, sensing, and data acquisition, signal processing, data conditioning, test troubleshooting. Methods of updating finite element structural models to correlate with dynamic test results. Model/test correlation assessment in industrial practice. May be coscheduled with SE 168. Recommended preparation: vibrations, finite element analysis, and knowledge of MATLAB. Prerequisites: graduate standing."}
{"code": "SE 269", "title": "Verification and Validation of Computational Models", "units": "4", "anchor": "se168", "description": "This course covers methods to verify and validate numerical simulations, including the analysis of verification tests, asymptotic convergence of solutions, validation metrics for test-analysis correlation, global sensitivity analysis, propagation of uncertainty through numerical models, and model calibration. Prerequisites: department approval required, graduate standing."}
{"code": "SE 270", "title": "Fracture Mechanics of Materials and Structures", "units": "4", "anchor": "se168", "description": "This course covers topics in fracture mechanics, including theoretical strength; stress concentration; strain energy release rate; linear and nonlinear fracture mechanics: stress singularity, fracture modes, crack tip plastic zone, Dugdale model, R-curve, elastic-plastic fracture mechanics, the J-integral; experimental techniques; and special topics. Prerequisites: graduate standing."}
{"code": "SE 271", "title": "Solid Mechanics for Structural and Aerospace Engineering", "units": "4", "anchor": "se168", "description": "Application of principles of solid mechanics to structural components and systems, description of stresses, strains, and deformation. Use of conservation equations and principle of minimum potential energy. Development of constitutive equations for metallic cementitious and polymeric materials. Prerequisites: SE 110A or consent of instructor.", "prereqs": "SE 110A"}
{"code": "SE 272", "title": "Theory of Elasticity", "units": "4", "anchor": "se168", "description": "Development, formulation, and application of field equations of elasticity and variational principles for structural applications in civil and aerospace area. Use of plane stress and plane strain formulation, solution of typical boundary value problems. Prerequisites: SE 271 or consent of instructor.", "prereqs": "SE 271"}
{"code": "SE 273", "title": "Inelasticity", "units": "4", "anchor": "se168", "description": "Overview of inelastic behavior of materials. Models of plasticity, viscoplasticity, viscoelasticity. Micromechanics and modeling of damage. Fatigue phenomena. Fracture mechanics. Processes and models of the failure of materials. Students may not receive credit for SE 273 and MAE 231C. Prerequisites: graduate standing and SE 271/MAE 231A or consent of instructor.", "prereqs": {"type": "one", "courses": ["SE 271", "MAE 231A"]}}
{"code": "SE 274", "title": "Nonlinear Finite Element Methods for Solid Mechanics", "units": "4", "anchor": "se168", "description": "Modeling of mechanical deformation processes in solids and structures by the finite element method. PDE models of deformations in solids and structures. Weak form. Weighted residual method. Material models for 3-D solids and rods, beams, shells: elasticity, plasticity, viscoplasticity. Prerequisites: graduate standing."}
{"code": "SE 276A", "title": "Finite Element Methods in Solid Mechanics I", "units": "4", "anchor": "se168", "description": "Finite element methods for linear problems in solid mechanics. Emphasis on the principle of virtual work, finite element stiffness matrices, various finite element formulations and their accuracy and the numerical implementation required to solve problems in small strain, isotropic elasticity in solid mechanics."}
{"code": "SE 276B", "title": "Finite Element Methods in Solid Mechanics", "units": "4", "anchor": "se168", "description": "Finite element methods for linear problems in structural dynamics. Beam, plate, and doubly curved shell elements are derived. Strategies for eliminating shear locking problems are introduced. Formulation and numerical solution of the equations of motion for structural dynamics are introduced and the effect of different mass matrix formulations on the solution accuracy is explored."}
{"code": "SE 276C", "title": "Finite Element Methods in Solid Mechanics III", "units": "4", "anchor": "se168", "description": "Finite element methods for problems with both material and geometrical (large deformations) nonlinearities. The total LaGrangian and the updated LaGrangian formulations are introduced. Basic solution methods for the nonlinear equations are developed and applied to problems in plasticity and hyperelasticity. Prerequisites: graduate standing and SE 276A or MAE 232A and MAE 231A or SE 271.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SE 276A", "MAE 232A"]}, {"type": "one", "courses": ["MAE 231A", "SE 271"]}]}}
{"code": "SE 277", "title": "Error Control in Finite Element Analysis", "units": "4", "anchor": "se168", "description": "This course will provide an overview of the latest technology for evaluating and improving the accuracy and validity of linear and nonlinear finite element models, solution verification, finite element model validation, sensitivity analysis, uncertainty analysis, and test-analysis correlation. Prerequisites: SE 232B or MAE 232B.", "prereqs": {"type": "one", "courses": ["SE 232B", "MAE 232B"]}}
{"code": "SE 278A", "title": "Finite Elements for Fluid Mechanics", "units": "4", "anchor": "se168", "description": "Development and application of advanced computational techniques for fluid flow. Stabilized and variational multiscale methods for finite element and related discretizations are stressed. Applications involve advection-diffusion equations and systems, and incompressible and compressible Navier-Stokes equations. Turbulence modeling will also be covered. Prerequisites: MAE 232A or SE 276A or consent of instructor, graduate standing.", "prereqs": {"type": "one", "courses": ["MAE 232A", "SE 276A"]}}
{"code": "SE 278B", "title": "Computational Fluid-Structure Interaction", "units": "4", "anchor": "se168", "description": "Conservation laws on general moving domains. Arbitrary Lagrange-Eulerian (ALE) and space-time approaches to fluid-structure interaction are covered. Suitable discretizations, mesh motion, and discrete solution strategies are discussed. Prerequisites: SE 278A.", "prereqs": "SE 278A"}
{"code": "SE 279", "title": "Meshfree Methods for Linear and Nonlinear Mechanics", "units": "4", "anchor": "se168", "description": "Meshfree approximation theories (moving least-squares, reproducing kernel, partition of unity, radial basis), Galerkin meshfree methods, collocation meshfree methods, imposition of boundary conditions, domain integration, stability, nonlinear meshfree method for hyperelasticity and plasticity, meshfree methods for fracture and plate/shell problems. Prerequisites: SE 276A or MAE 232A, graduate standing.", "prereqs": {"type": "one", "courses": ["SE 276A", "MAE 232A"]}}
{"code": "SE 280", "title": "Finite Element Computations in Solid Mechanics", "units": "4", "anchor": "se168", "description": "Techniques of computation with the finite element method. Preprocessing (geometry, mesh generation, boundary conditions), solution methods (statics including contact, dynamics, buckling), and postprocessing (visualization, error estimation, interpretation of results). Hands-on exercises with commercial and open-source software. Use of computer resources. Prerequisites: graduate standing, SE 276A or MAE 232A, and SE 276B or MAE 232B.", "prereqs": {"type": "all", "courses": [{"type": "one", "courses": ["SE 276A", "MAE 232A"]}, {"type": "one", "courses": ["SE 276B", "MAE 232B"]}]}}
{"code": "SE 281", "title": "3D Printable Robotics", "units": "4", "anchor": "se168", "description": "This project-based, systems engineering course explores robotics in the context of next-generation layered manufacturing techniques (3D printing). Students will design, model, simulate, optimize, 3D print, test, and refine a remotely controllable robotic system as member of a multidisciplinary team. Recommended preparation: students should have experience with computer aided design (CAD). Prerequisites: graduate standing."}
{"code": "SE 282", "title": "Diagnostic Imaging", "units": "4", "anchor": "se168", "description": "This course provides an introduction to diagnostic imaging with a focus on forensic engineering. A broad range of imaging techniques are studied, enabling multidimensional analysis of engineered artifacts and detection of conditions that may lead to undesirable performance characteristics or failure, identify the onset of failure, failure progression, and failure mechanisms overall. Prerequisites: graduate standing."}
{"code": "SE 283", "title": "Engineering Frontiers", "units": "4", "anchor": "se168", "description": "Explores strategies for the augmentation, advancement, and restoration of human abilities, covering the design and systems engineering cycle; from initial user study, ideation, and conceptual design to subject imaging, modeling, and simulation; all the way to layered manufacturing and testing. Recommended preparation: students should have experience with computer aided design (CAD). Prerequisites: graduate standing."}
{"code": "SE 285", "title": "Structural Optimization", "units": "4", "anchor": "se168", "description": "Construction of structural design as an optimization problem; mathematical programming for sizing, shape, and topology; linear and nonlinear programming; continuous and discrete optimization methods; Lagrangian function and KKT optimality condition; MATLAB. Use of computer resources. Prerequisites: graduate standing, SE 276A or MAE 232A or SE 233 or MAE 235.", "prereqs": {"type": "one", "courses": ["SE 276A", "MAE 232A", "SE 233", "MAE 235"]}}
{"code": "SE 286", "title": "Design Optimization for Additive Manufacturing", "units": "4", "anchor": "se168", "description": "This course will cover the following topics: fundamental mathematical concepts of optimization, constrained optimization, sensitivity analysis, topology optimization methods (SIMP and Level Set Topology Optimization), state of the art topology optimization applications and additive manufacturing methods, and future perspectives. Prerequisites: graduate standing."}
{"code": "SE 290", "title": "Structural Engineering Seminar", "units": "2", "anchor": "se168", "description": "Weekly seminar and discussion by faculty, visitors, postdoctoral research fellows and graduate students concerning research topics in earthquake engineering and related subjects. May be repeated for credit. (S/U grades only.) Prerequisites: graduate standing."}
{"code": "SE 296", "title": "Independent Study", "units": "4", "anchor": "se168", "description": "Prerequisites: consent of instructor."}
{"code": "SE 298", "title": "Directed Group Study", "units": "1–4", "anchor": "se168", "description": "Directed group study on a topic or in a field not included in regular department curriculum, by special arrangement with a faculty member. Prerequisites: consent of instructor."}
{"code": "SE 299", "title": "Graduate Research", "units": "1–12", "anchor": "se168", "description": "(S/U grades permitted.)"}
{"code": "SE 501", "title": "Teaching Experience", "units": "2", "anchor": "se168", "description": "Teaching experience in an appropriate SE undergraduate course under direction of the faculty member in charge of the course. Lecturing one hour per week in either a problem-solving section or regular lecture. Prerequisites: consent of instructor and the department. (S/U grades permitted.)"}
