{"code": "WARR", "name": "Warren College", "link": "https://catalog.ucsd.edu/courses/WARR.html"}
{"code": "WARR 1", "title": "First Year Experience", "units": "2", "anchor": "warr1", "description": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking and organizational, interpersonal, and wellness skills. P/NP grades only. Prerequisites: open to Warren NFRS students only."}
{"code": "WARR 2", "title": "Transfer Year Experience", "units": "2", "anchor": "warr2", "description": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking and organizational, interpersonal, and wellness skills. P/NP grades only. Prerequisites: open to Warren College transfer students only."}
{"code": "WCWP 10A", "title": "The Writing Course A", "units": "4", "anchor": "wcwp10a", "description": "A seminar-style course in reading and writing required of all Warren College students. The course emphasizes argumentation and critical writing based on sources. Letter grades only. Prerequisites: satisfaction of the UC Entry Level Writing Requirement and must be a Warren College student."}
{"code": "WCWP 10B", "title": "The Writing Course B", "units": "4", "anchor": "wcwp10b", "description": "A seminar-style course in reading and writing required of all Warren College students who have completed WCWP 10A. The course continues the emphasis on argumentation and critical writing based on sources. Letter grades only. Prerequisites: satisfaction of WCWP 10A and must be a Warren College student.", "prereqs": "WCWP 10A"}
{"code": "WCWP 100", "title": "Academic Writing", "units": "4", "anchor": "wcwp100", "description": "An upper-division workshop course in argumentation and research with particular attention to analyzing and constructing academic arguments. A course specially designed for and required of transfer students who enter Warren College through the TAG, IGETC, or another articulation agreement. The course must be taken for a letter grade to fulfill this requirement. Letter grades only. Prerequisites: junior/senior standing and must be a Warren College student."}
{"code": "WCWP 160", "title": "Technical Writing for Scientists and Engineers", "units": "4", "anchor": "wcwp160", "description": "An upper-division workshop-style writing course focused on the principles and practices of scientific and technical writing and communication. Emphasis on the analysis, evaluation, design, and production of technical writing projects in science and engineering courses and context. Open to students from all colleges. Prerequisites: junior/senior standing."}
{"code": "WARR 189", "title": "Academic Mentoring and the Writing Process", "units": "2", "anchor": "warr189", "description": "Students will gain a fundamental understanding of all stages of the writing process and will develop the necessary skills to serve as productive mentors for their peers. P/NP grades only. May be taken for credit three times. Prerequisites: permission of instructor is required to enroll."}
{"code": "WCWP 198", "title": "Group Study", "units": "2", "anchor": "wcwp198", "description": "A directed group study involving research and analysis of activities and services in writing, public and civic writing, publishing, and other areas that are not covered by the present curriculum. The course involves reading, writing, and discussion by a small group of students under supervision of a faculty member."}
{"code": "WCWP 500", "title": "Apprentice Teaching in WCWP", "units": "2 or 4", "anchor": "wcwp500", "description": "Consideration of pedagogical methods appropriate to undergraduate teaching in Warren College Writing courses, under the supervision of the program director. (S/U grade only.) Prerequisites: graduate standing."}
